a
aa'
aa¹
Aa²
aa³
Aabayeel¹
Aabayeel²
Aabayeelid
Aabayn
Aabbannimo
Aabbayaal
Aabbe
Aabbo
aabbur¹
aabbur²
aabburan¹
aabburan²
aabburid
aabburmid
aabburnaan
aabburnaansho
Aabee
Aabeyeelid
Aabi
aabiweyrax
Aabo
Aabonimo
Aabyoo
Aabyood
Aad
Ąad¹
Ąad²
Ąad³
aadaab
aadaamid
aadaan¹
aadaan²
aadami
aadaminnimo¹
aadaminnimo²
aadane
aaddamid
aaddan¹
aaddan²
aaddan³
aaddin
aadeer
aadi
aadid
aadimo
aadin
aadiraac
aadmi
aadminnimo
aadsii
aadsiin
aadyar
aaf
aafayn
aafee
aafeysan
aafeysnaan
aafeysnaansho
aafo
aafoobid
aafow
aag
aagaan¹
aagaan²
aagga-qabow
aah
aaho
aa'id
aajur
aakhir
aakhiritaan
aakhiro
aakhirutahan
aakib
aal¹
al²
aalaa
ąalad
ąaladee
ąaladeyn
ąaladeysan
ąaladeysnaan
ąaladeysnaansho
ąalad-kabniin
aale
aalkol
aalkolo
aallid
aalo
aameel
ąamiin
ąamiinsad
ąamiinsasho
ąamiinsi
ąamiinso
ąammiin
ąammiinsad
ąammiinsasho
ąammiinso
ąammin¹
ąammin²
ąamminaad
ąamminbax
ąamminbixid
ąammindarreysad
ąammindarreysasho
ąammindarreysi
ąammindarreyso
ąammindarro
ąamminid
ąamminnimo
ąamminsan
ąamminsanaan
ąamminsanaansho
ąamminsanow
ąamminsii
ąamminsiin
aammus¹
aammus²
aammusan
aammusdaran
aammusdarnaan
aammusdarnaansho
aammusi
aammusid
aammusin
aammusis
aammusnaan
aammusnaansho
aan¹
aan²
aanayn
aanaysasho
aanaysi
aanayso
aanee
aannu
aano
aar¹
aar²
aaraa'
aarad
aaradee
aaradeyn
aaradeysan
aaradeysnaan
aaradeysnaansho
aaran
aarbax¹
aarbax²
aarbi-aar
aarbixid
aardoon
aardoonad
aardoonasho
aardoono
aargalaan
aargoonle
aargoosad
aargoosasho
aargoosi
aargooso
aargud
aargudasho
aargudid
aargudis
aarid
aaris
aarnimo
aarsashaddoon
aarsasho
aarsi
aarso
aas¹
aas²
aasaas¹
aasaas²
aasaasan¹
aasaasan²
aasaasi
aasaasid
aasaasmid
aasaasnaan
aasaasnaansho
aasan¹
aasan²
aashuun
aasid
aasmid
aasnaan
aasnaansho
aasnow
aaway
aawaye
aawi
aawil¹
aawil²
aawilid
aawin
aawis
aawo
aayad
aayakatalin
aayakatashi
aayar
aayatiin
aayaxumaan
aayaxumaansho
aayaxumi
aayaxumo
aayaxun
aaye
aayid
aayis
aayo¹
aayo²
aayodhiin
aayon
aayoonayn
ab¹
ab²
abaab¹
abaab²
abaabi
abaabid
abaabin
abaabis
abaabul¹
abaabul²
abaabulan
abaabulay
abaabule
abaabulid
abaabulnaan
abaabulnaansho
abaad¹
abaad²
abaadi
abaadid
abaadin
abaadsii
abaadsiin
abaahi¹
abaahi²
abaahin
abaahiqab
abaahis
abaahiyid
abaaji¹
abaaji²
abaajiyid
abaal
abaalceli
abaalcelin
abaalcelis
abaaldaran
abaaldarnaan
abaaldarnaansho
abaaldarro
abaaldhac¹
abaaldhac²
abaaldhicid
abaaldooris
abaalgud¹
abaalmarin.
abaalgud²
abaalgudid
abaalhay
abaalhayn
abaali
abaalmari
abaalmarin
abaalmaris
abaar
abaarayn
abaaraysad
abaaraysan
abaaraysasho
abaaraysi
abaaraysii
abaaraysiin
abaaraysnaan
abaaraysnaansho
abaarayso
abaaree
abaareysad
abaarikeentay
abaaroobid
abaarow
abaarsad
abaarsasho
abaarso
abaaseere
abab¹
abab²
ababi
ababid
ababin
ababis
abad
abadan
abaddar
abaddarnimo
abakaar
abakaarnimo
abaqaal¹
abaqaal²
abaqaalid
abasax¹
abasax²
abasaxan
abasaxi
abasaxnaan
abasaxnaansho
abasaxsan
abasaxsanaan
abasaxsanaansho
abashuqle
abashuqlee
abashuqleyn
abasixid
abataqan
abaydimi
abaydimin
abaydin
abbaan
abbaanduul
abbaanduule
abbaannimo
abbaansasho
abbaansi
abbaanso
abbaanwarre
abbaar¹
abbaar²
abbaar³
abbaaran¹
abbaaran²
abbaare
abbaarid
abbaarmid
abbaarnaan
abbaarnaansho
abbaarqaadasho
abbaarqaado
abbaarsii
abbaarsiin
abbaato
abbaay
abbaay-abbaay
abbaaye
abbaayguddoy
abbaayo
abbaseere
abboow
abboowe
abbuul
abdo
abeer
abeesabbadeed
abeesajilfaaley
abeesalugaley
abeesaxambaar
abeeso
abeesojufaaley
abeesow
abguri
abhi
abhin
abhis
abid
abiid
abitey
abjac
abjacnimo
abjad
abjed
abkow
abkownimo
abla'ablayn
ablaawe
abley
abnaq¹
abnaq²
abnaq³
abnaqid
ab'ogaa
aboobid
aboodi
aboor¹
aboor²
aboornimo
abootannimo
abooto
abooto-idabbadis
ab'orijinis
abqaad
abqo
abraar¹
abraar²
abraarid
abraarsii
abraarsiin
abraarsiis
abriil
abriile
abris
absaxan
abshir
absiisa
abti
abtibadbaadeed
abtinnimo
abtiri
abtirin
abtiris
abtirsad
abtirsasho
abtirsi
abtirsiimo
abtirsiino
abtirsiinyo
abtirso
abtisarow
abtiyoobid
abtiyow¹
abtiyow²
abur
aburi
aburin
aburshuqlayn
aburshuqle
aburshuqlee
abuuddocan
abuuddoocan
abuudiiq
abuullan
abuumaqas
abuur¹
abuur²
abuur³
abuuran¹
abuuran²
abuurcas
abuure
abuurid
abuuris
abuuritaan
abuurmid
abuurnaan
abuurnaansho
abuutufaax
abwaan
abwaanad
abwaannimo
abxad
abyamid
abyan¹
abyan²
abyanaha-logaridam
abyane-huban
abyin
abyineed-aan-hubnayn
abyineed-huban
abyin-jeexeed
abyood
abyoone
acuudu-billaahi
acuudu-billaysad
acuudu-billaysasho
acuudu-billeysi
acuudu-billeyso
acyuun
adaa
adaadax¹
adaadax²
adaadi
adaadixid
adaadumasho
adaadumid
adaadumo
adaadun¹
adaadun²
adaahi
adaan
adaarbiciid
adab¹
adab²
adable
adaddaah¹
adaddaah²
adaddaahid
adag
adamaddoon
adame
adami
adamiyeysasho
adamiyeysi
adamiyeyso
adan
adar
adarbiciid
adayg
addeec¹
addeec²
addeecid
addeecis
addeecsan
addeecsanaan
addeecsanaansho
addimaad
addimid
addin¹
addin²
addin³
addinmaal
addoomoobid
addoomow
addoon¹
addoon²
addoonnimo
addoonsad
addoonsasho
addoonsi
addoonso
adduun
adduunweyne
adduunyo
adeeg¹
adeeg²
adeegasho
adeege
adeegid
adeego
adeegsad
adeegsasho
adeegsi
adeegso
adeegto
adeer
adeernimo
adeeryo
adhaxle
adi
adiga
adinayn
adiyo
adkaan
adkaansho
adkayn
adkaysad
adkaysan¹
adkaysan²
adkaysasho
adkaysi¹
adkaysi²
adkaysiinyo
adkaysin
adkayso
adke
adkee
adkow
adna
adoo
adooga
adse
aduu
adwaar
adyadee
adyadeyn
af¹
af²
afaaf
afacaayil
afaggaal
afar
afaraad
afardhegood
afaree
afareyn
afareys
afareysad
afareysasho
afareysi
afareyso
afarfaallow
afarfoolle
afargees
afariyotobnaad
afar-jiho
afar-madaxle
afarqaad¹
afarqaad²
afarqaadid
afarqaadis
afarqaadlays
afarqaadle
afarqaadleyn
afarran¹
afarran²
afarranaan
afarranaansho
afarrey
afarsuulle
afartamaad
afartambax¹
afartambax²
afartambixi
afartambixid
afartambixin
afartameeye
afartameeyo
afartan
afartanaad
afartanbax¹
afartanbax²
afartanbixi
afartanbixid
afartanbixin
afartaneeye
afayn
afays
afaysan¹
afaysan²
afaysasho
afaysmid
afaysnaan
afaysnaansho
afayso
afbadan
afbadnaan
afbadnaansho
afbar
afbarad
afbarasho
afbarid
afbaro
afbax¹
afbax²
afbeel¹
afbeel²
afbeelid
afbilaabasho
afbilaabo
afbilaw
afbixid
afbuur¹
afbuur²
afbuurid
afcaal
afcaan
afcadde
afceli
afcelin
afcelis
afceliso
afceliye
afcuug
afdabayl
afdaran
afdarnaan
afdarnaansho
afdarraan
afdarraansho
afdarro
afdhaaf
afdhaafid
afdhabaandhab¹
afdhabaandhab²
afdhabaandhabid
afdhabaandhaw
afdhalow
afdheere
afdhuub
afdhuubyaalayn
afdhuubyaale
afdhuubyaalee
afdoolin
afduub¹
afduub²
afduuban
afduube
afduubid
afduubnaan
afduubnaansho
afee
afeef
afeefad
afeefasho
afeefo
afeeftamid
afeeftan
affur¹
affur²
affuran
affuri
affurid
affurin
affurnaan
affurnaansho
affursii
affursiin
afgaab
afgammuur¹
afgammuur²
afgammuuran¹
afgammuuran²
afgammuurid
afgammuurmid
afgammuurnaan
afgammuurnaansho
afgammuux¹
afgammuux²
afgammuuxan¹
afgammuuxan²
afgammuuxmid
afgammuuxnaan
afgammuuxnaansho
afgamuuran¹
afgamuuran²
afgamuurmid
afgamuurnaan
afgamuurnaansho
afgamuuxan¹
afgamuuxan²
afgamuuxmid
afgamuuxnaan
afgamuuxnaansho
afgarad
afgarasho
afgaro
afgarooc
afgaroocnimo
afgembi¹
afgembi²
afgembin
afgobaadsad
afgobaadsi
afgobaadso
afgorofow
afgoys
afguri
afhaye
afhayeen
afjaaq¹
afjaaq²
afjaaqid
afjig
afjigid
afjuxuunsad
afjuxuunsasho
afjuxuunsi
afjuxuunso
afkaar
afkalahayn
afkalahays
afkalaqaad
afkalaqaadid
afkatoob
afkulleeble
afkullibaaxle
afkuxaarre
afkuxuuble
afla'
afla'aan
afla'aansho
aflaam
aflaan
aflaawe
aflaggaaddee
aflaggaaddeyn
aflaggaaddo
aflaw
aflax¹
aflax²
aflaxaad
aflixi
aflixid
aflixin
aflixis
afmaal
afmaalnimo
afmaldah
afmaldahid
afmeer¹
afmeer²
afmeeran
afmeerid
afmeernaan
afmeernaansho
afmiinshaar
afmiinshaarayn
afmiinshaaree
afmiinshaarnimo
afmiishaar
afmiishaarayn
afmiishaaree
afmiishaarnimo
afnaq¹
afnaq²
afnaqid
afo
afqab
afqabid
afqays
afqoys
afraad
afrid
afrog¹
afrog²
afrogan
afrogid
afrognaan
afrognaansho
afruug¹
afruug²
afruugid
afruujin
afsaar
aftahan
aftahannimo
aftahmo
aftax¹
aftax²
afti
aftin
aftir¹
aftir²
aftirasho
aftirid
aftiro
aftixid
aftoolin
aftuur¹
aftuur²
aftuurid
afur¹
afur²
afuran
afuri
afurid
afurin
afurnaan
afurnaansho
afursan
afursanaan
afursanaansho
afursii
afursiin
afuuf¹
afuuf²
afuufan¹
afuufan²
afuufid
afuufmid
afuufnaan
afuufnaansho
afuufo
afuug¹
afuug²
afuugid
afuujin
afwaaji
afwaajin
afwebi
afweyn
afweyn-holac
afxaar
afxir¹
afxir²
afxiran
afxirasho
afxirid
afxirnaan
afxirnaansho
afxiro
afxumaan
afxumaansho
afxumayn
afxumee
afxumi
afxumo
afxumow
afxun
afyaal
afyaqaan
afyar
afyuub
afyuun
ag
agaag
agaagse
agaasiman
agaasime
agaasimid
agaasin¹
agaasin²
agaasinnaan
agaasinnaansho
agab¹
agab²
agabbar¹
agabbar²
agabbarid
agabsasho
agag
agagaar
agagas
agaggaar
agagse
agagsi
agagsiyid
agan
agas
agjoog
agjoogid
agjooji
agjoojin
agliil
aglool¹
aglool²
agloolan
agloolid
agloolnaan
agloolnaansho
agmar¹
agmar²
agmari
agmarid
agmarin
agool
agoomayn
agoomee
agoomoobid
agoomow
agoon¹
agoon²
agoonnimo
agoonobid
agoonow
agoontoobid
agoontow
agoor
agoornimo
agoosto
agow
agtag
agtegid
aguug¹
aguug²
aguugan¹
aguugan²
aguugid
aguugmid
aguugnaan
aguugnaansho
ah¹
ah²
ahaan
ahaansho
ahaateenaa
ahal
ahalo
ahalunnaar
ahamiyad
ahaw
ahaysii
ahaysiin
ahbalad
ahbalnimo
ahbi
ahbin
ahbis
ahdaaf
ahlan
ahlunaar
ahmi
ahmin
ahmiyad
ahraam¹
ahraam²
ajal¹
ajal²
ajalid
ajalo
ajar¹
ajar²
ajar³
ajaran¹
ajaran²
ajaraysasho
ajarayso
ajarid
ajarmid
ajarnaan
ajarnaansho
ajarro
ajarsad
ajarsasho
ajarsi
ajarso
ajee
ajeendo
ajeyn
aji
ajiib¹
ajiib²
ajiibid
ajir
ajirsad
ajirsasho
ajirso
ajli
ajnebi
ajnebiyad
ajo
ajoo
ajood
ajri
ajuuro
akademiye
akademiyo
akeekamid
akeekan¹
akeekan²
akhas
akhdar
akhir
akhiran¹
akhiran²
akhiri
akhirid
akhirin
akhirmid
akhirnaan
akhirnaansho
akhlaaq
akhri
akhrin
akhris
akhrisasho
akhriso¹
akhriso²
akhriye
akhriyid
akhtar
akhyaar
akid
akidid
akidis
akrobalus
akson
alaab
alaab-caydhiin
alaab
alaabayn
alaabee
alaabo
alaah
alaakood
alaakoodi
alaakoodin
alaakoodis
alaal
alaalabbaq¹
alaalabbaq²
alaalabbiqid
alaalax¹
alaalax²
alaale
alaalennimo
alaalixid
alaalnimo
alaalo
alab
alabbas¹
alabbas²
alabbasid
alabbaslays
alabbaslee
alabbasleyn
alabbasmays
alabbasmeyn
alal
alalaas¹
alalaas²
alalaasid
alalad¹
alalad²
alaladi
alaladid
alaladin
alaladsii
alaladsiin
alalaxi
alalid
alamsasho
alamsi
alamso
alan¹
alan²
alawaad
albaab¹
albaab²
albaaban
albaabid
albaabjooge
albaabnaan
albaabnaansho
alcood
aldhihaydh
aleeggad¹
aleeggad²
aleeggadid
aleel
aleelaale
aleelatuur¹
aleelatuur²
aleelatuurid
aleelayn
aleelaysan
aleelaysnaan
aleelaysnaansho
aleelee
aleemi
aleemin
aleemis
aleen
alfaan
alfiyoole
algoordan
alhuumo
alif
alifaatig
alifba'
alifle
alifley
aliil
aliindi
aljebra
alji
alkaali
alkahool
alkayn
alkeyn
alkiin
alkohooliisam
alkuman¹
alkuman²
alkumasho
alkume
alkumid
alkumo
alkun¹
alkun²
alkun³
alkunmid
alkunnaan
alkunnaansho
alla
allaale
allabbari¹
allabbari²
allabbariyid
allacaabud
allacaabudid
alladiidnimo
allaqabey
alla-uxiir
allaylee
allaylehe
Alle
allebadane
alleyl
allif¹
allif²
allifaad
allife
allifid
alluumiiniyam
alluumiiniyam-ogsaydh
alma-almay
alma-almayn
alma-almee
almaas
almadar
almi
almin
aloog
abuurid.
aloogan¹
aloogan²
aloogid
aloogmid
aloognaan
aloognaansho
aloogsasho
aloogso
alool
aloos
aloosan¹
aloosan²
aloosid
aloosmid
aloosnaan
aloosnaansho
alotarobi
alwaax
alwasho
alwo
alxaman¹
alxaman²
alxamdulillaysad
alxamdulillaysasho
alxamdulillaysi
alxamdulillayso
alxame
alxamid
alxan¹
alxan²
alxanan¹
alxanan²
alxanmid
alxannaan
alxannaansho
ama
amaa
amaag
amaagan¹
amaagan²
amaagid
amaagnaan
amaagnaansho
amaah
amaahasho
amaahbax¹
amaahbax²
amaahi
amaahin
amaahis
amaahiye
amaaho
amaamud¹
amaamud²
amaamudan
amaamude
amaamudid
amaamudnaan
amaamudnaansho
amad
amag
amakaag¹
amakaag²
amakaagid
amakaagsan
amakaagsanaan
amakaagsanaansho
amankaag¹
amankaag²
amankaagid
amankaagsan
amankaagsanaan
amankaagsanaansho
amar¹
amar²
amarbixin
amardiiddo
amardiidmo
amarkutaaglayn
amarkutaagle
amarkutaaglee
amarkutaagleeye
amarti
amarweynaan
amarweyni
amayn
amba¹
amba²
ambaal
ambabbax¹
ambabbax²
ambabbaxsan
ambabbaxsanaan
ambabbaxsanaansho
ambabbixi
ambabbixid
ambabbixin
ambabbixis
ambad
ambalaas
ambaqaad¹
ambaqaad²
ambaqaadid
ambasho
ambi
ambiiro
ambin
ambiyeer
ambiyeer-beege
ambo¹
ambo²
ambuul
ameer
amiiba
amiino
amiino-asiidh
amiir
amiirnimo
amley
amma
ammaa
ammaag
ammaagan¹
ammaagan²
ammaagid
ammaagnaan
ammaagnaansho
ammaan¹
ammaan²
ammaan³
ammaana-allah
ammaanan
ammaanayn
ammaanaysan
ammaanaysasho
ammaanaysii
ammaanaysnaan
ammaanaysnaansho
ammaanayso
ammaanduul
ammaanduule
ammaanee
ammaangeli
ammaangelin
ammaanid
ammaannaan
ammaannaansho
ammaano
ammaansasho
ammaansi
ammaanso
ammiir
ammiirnimo
ammin¹
ammin²
amminka
amminla'
ammooniya
ammuur¹
ammuur²
ammuurayn
ammuuraysan
ammuuraysnaan
ammuuraysnaansho
ammuuree
amnac
amni
amran
amranaan
amranaansho
amrid
amuur
ana
anaa¹
anaa²
anaakici
anaani
anaaninnimo
anaaniyad
anaaniyo
anaanuf¹
anaanuf²
anaanufid
anafee
anafeyn
anafo
anafoo
anafood
anatomi
andaco
andacoo
andacood
andaqaad¹
andaqaad²
andaqaadid
aneexo
anemoomitir
anfac¹
anfac²
anfaco
anfariir¹
anfariir²
anfariiri
anfariirid
anfariirin
anfariirsan
anfariirsanaan
anfariirsanaansho
anficid
angar¹
angar²
angaran¹
angaran²
angarid
angarmid
angarnaan
angarnaansho
anguubyo
anguugyo
anhaydaraydh
ani
aniga
animoomitir
aniyo
anjiina-bektores
anna¹
anna²
annaaniyad
annaga
annilliida
anoo
anoofeles
anqaas
anqalyo
anqari
anqarin
anqaris
anqarsasho
anqarso
anqaw
ansaar
ansaarax¹
ansaarax²
ansaarixid
ansaarixin
ansaleel
ansaleeli
ansaleelin
ansareer
ansareeri
ansareerin
ansax¹
ansax²
ansaxin
anse
anshax
anshaxdaran
anshaxdarnaan
anshaxdarnaansho
anshaxdarro
anshaxdarroo
anshaxdarrood
anshaxdarrow
anshax-xumaan
anshax-xumaansho
anshax-xumi
anshax-xumo
anshax-xumow
anshax-xun
anshi
ansixi
ansixid
ansixin
ansixis
antaradhaaf¹
antaradhaaf²
antaradhaafi
antaradhaafid
antaradhaafin
antarasayt
antaro
antaweeri
antaweerin
antaweeris
anuu
anuug
anuun
anyakow
aq
aqab
aqal
aqalgal¹
aqalgal²
aqalgeli
aqalgelid
aqalgelin
aqalsoomaali
aqas
aqasho
aqbal¹
aqbal²
aqbalid
aqbalsii
aqbalsiin
aqbo
aqi
aqin
aqlabiyad
aqli
aqo
aqoo
aqood
aqool¹
aqool²
aqool³
aqoolan
aqoolid
aqoolnaan
aqoolnaansho
aqoolxumaan
aqoolxumaansho
aqoolxumi
aqoolxumo
aqoolxun⁴
aqoon
aqoon-farsamo
aqoonbaaris
aqoon-beereed
aqoondaran
aqoondarnaan
aqoondarnaansho
aqoondarri
aqoondarro
aqoondhaaf
aqoon-isweydaarsi
aqoonla'aan
aqoonli'i
aqoonni
aqoonnin
aqoonsad
aqoonsan
aqoonsanaan
aqoonsanaansho
aqoonsasho
aqoonsi
aqoonsii
aqoonsiin
aqoonso
aqoonta-cudurrada
aqoonta-kansarka
aqoonta-ummulinta
aqoonxumaan
aqoonxumaansho
aqoonxumi
aqoonxumo
aqoonxun
aqoonyahan
aqoonyahannimo
aqsayn
aqsaysan
aqsaysii
aqsaysiin
aqsaysnaan
aqsaysnaansho
aqsee
aqso
aqsoo
aqsoobid
aqsood
aqsow
aqyaar¹
aqyaar²
aqyaarayn
aqyaaree
aqyaarnimo
ar
araaji
araanjo
araarayn
araare
araaree
araari
araasi¹
araasi²
araasiyid
arabbikhi
arad¹
arad²
arag¹
arag²
aragbeel¹
aragbeel²
aragbeelid
arag-dhowaadka
arag-qumin
aragti
aragtida-Darwin
aragtida-kuwaantam
aragtida-Leewis
aragti-haraa
aragtiinka-asaasiga-ah-ee-aljebra
aragtiinka-asaasiga-ee-kalkulaska-abynan
aragti-isir
aragxumaan
aragxumaansho
aragxumi
aragxumo
aragxun
arah¹
arah²
arahdoon¹
arahdoonid.
arahdoon²
arahdoonad
arahdoonasho
arahdoonid
arahdoono
aram
arammi
aranjaato
arar
ararad
ararasho
arari
ararin
araro
arax
araxdaaco
araxnimo
araye
arayl
arbaco
arbe
arbucuun¹
arbucuun²
arbucuunaan
arbucuunaansho
arbucuunan
arbucuunid
arbucuunis
arbush¹
arbush²
arbushaad
arbushan¹
arbushan²
arbushid
arbushmid
arbushnaan
arbushnaansho
ardaa
ardaadhig¹
ardaadhig²
ardaadhigid
ardaaggal¹
ardaaggal²
ardaaggelid
ardaal
ardaalnimo
arday
ardayad
ardiyad
ardooyin
areebo
areerin
argag¹
argag²
argaggax¹
argaggax²
argaggaxsan
argaggaxsanaan
argaggaxsanaansho
argaggixi
argaggixid
argaggixin
argaggixis
argaggixisannimo
argaggixiso
argagid
argagsan
argagsanaan
argagsanaansho
argeeg
arhasho
arhid
arho
ari
aricad
arifadh
arijir
aritmatig
arjantam
arji
arjibilaago
arjiqore
arjumid
arjun
arkaan
arkaanu-islaan
arkaniida
arkid
arkiifiyo
arkijireddoon
arkoo
arkood
arkoon
arkoonaan
arkoonaansho
arlaa'i
arli
arlo
armaa
armaadyo
armaajo
armac
aroomaatig
arǫor
aroor¹
aroor²
aroore
aroore-holac
aroore-qaade
arǫorhoraad
aroori
aroorid
aroorin
arooris
aroornimo
aroorsan
aroorsanaan
aroorsanaansho
arǫoryo
arooryohoraad
aroos¹
aroos²
aroosad
aroosgal¹
aroosgal²
aroosgeli
aroosgelid
aroosgelin
aroosi
aroosid
aroosin
arraajo
arrad¹
arrad²
arradan
arradbax¹
arradbax²
arradbaxsan
arradbaxsanaan
arradbaxsanaansho
arradbixi
arradbixid
arradbixin
arradi
arradid
arradin
arradnaan
arradnaansho
arradsan
arradsanaan
arradsnaansho
arrad-tir¹
arrad-tir²
arrad-tiran
arrad-tirasho
arrad-tirid
arrad-tirnaan
arrad-tirnaansho
arrad-tiro
arrafo
arratir¹
arratir²
arratiran
arratirasho
arratirid
arratirnaan
arratirnaansho
arratiro
arrimi
arrimin
arrimis
arrin
arrinsad
arrinsasho
arrinsi
arrinso
arruman
arrumasho
arrumid
arrumnaan
arrumnaansho
arrumo
arrun¹
arrun²
arrunnaan
arrunnansho
arruug
arruugnimo
arsaaq¹
arsaaq²
arsaaqad
artaraboodha
aruundi
aruur¹
aruur²
aruuri
aruurid
aruurin¹
aruurin²
aruuris
aruursan
aruursanaan
aruursanaansho
aruursasho
aruurso
arwaax¹
arwaax²
arwaax³
arwaaxi
arwaaxid
arwaaxin
arwaaxsan
arwaaxsanaan
arwaaxsanaansho
arxaan
arxamid
arxan¹
arxan²
arxan³
aryaa
aryaadha
asaabboon
asaabboonaan
asaabboonaansho
asaag
asaagsad
asaagsasho
asaagsi
asaagso
asaas¹
asaas²
asaasan¹
asaasan²
asaasi
asaasid
asaasmid
asaasnaan
asaasnaansho
asaay
asaaye
asaayo
asaaysaar¹
asaaysaar²
asaaysaarid
asaddah¹
asaddah²
asaddihi
asaddihid
asaddihin
asal¹
asal²
asal³
asali
asalmadoorshe
asaraar¹
asaraar²
asaraarid
asaraartamid
asaraartan¹
asaraartan²
asaruur¹
asaruur²
asaruuran¹
asaruuran²
asaruurid
asaruurmid
asaruurnaan
asaruurnaansho
asaw
asay
asbaab
asbax¹
asbax²
asbiriin
asbixi
asbixid
asbixin
ascaar
asduurad
aseeb
aseebe
aseebid
aseendo
ash
ashaamid
ashahaadasho
ashahaado¹
ashahaado²
ash-ash¹
ash-ash²
asha-shid
asheer
asheerasho
asheeri
asheerid
asheerin
asheero
ashkatayn
ashkatee
ashkato
ashkatoo
ashkatood
ashkir
ashqaraar¹
ashqaraar²
ashqaraari
ashqaraarid
ashqaraarin
ashtakayn
ashtakee
ashtako
ashtakoo
ashtakood
ashuun
asii
asiib
asiibid
asiidh
asiidha-yuurig
asiidh-bu'eed
asiidh-cabirid
asiidh-dufaneed
asiidh-laagtika
asiidh-ooman
asiili
asitayl
asjab
askaaris
askaax
askar
askarayn
askaree
askari
askarinnimo
askarmaroodi
askarnimo
askax
askoorbik-asiidh
askumid
askun¹
askun²
aslaax¹
aslaax²
aslaaxi
aslaaxid
aslaaxin
aslaaxsan
aslaaxsanaan
aslaaxsanaansho
aslan¹
aslan²
aslanaan
aslanaansho
aslasho
asli
aslid
aslo
asluub
asluubee
asluubeyn
asluubeysan
asluubeysnaan
asluubeysnaansho
asmayn
asmaysan
asmaysnaan
asmaysnaansho
asmee
asmo
asool¹
asool²
asoolid
asoollan
asoollanaan
asoollanaansho
asoolli
asoolliyid
asqayn
asqaysan
asqaysii
asqaysiin
asqaysnaan
asqaysnaansho
asqee
asqo
asqoo
asqoobid
asqood
asqow
asraarrey
asraarrow
astaad
astaajir
astaamayn¹
astaamayn²
astaamaysan
astaamaysnaan
astaamaysnaansho
astaamee
astaan¹
astaan²
astaan³
astaaqfurow
astakayn
astakee
astako
astakoo
astakood
astayn
astaysan
astaysnaan
astaysnaansho
astee
asto
astur¹
astur²
asturan¹
asturan²
asturid
asturmid
asturnaan
asturnaansho
asuul
asxantu
asyab
atam
atlas
atom
atool
atoor
ATP
aw
awaaji¹
awaaji²
awaajiyid
awaal¹
awaal²
awaalid
awaamir
awaarayn
awaaree
awal
awasho
away
aw-batiiqow
awd¹
awd²
aw-daare
awdan¹
awdan²
awday
awdid
awdmid-halbowle-wadne
awdmid¹
awdmid²
awdnaan
awdnaansho
aweyti¹
aweyti²
aweytiyid
awlaad
awlaadsasho
awlaadsi
awlaadso
awlal
awlax
awlee
awleyn
awliyo
awno
awo¹
awo²
awood¹
awood²
awood³
awood-danabeed
awooddaran
awooddarnaan
awooddarnaansho
awooddarri
awooddarro
awoode
awoodid
awoodla'aan
awoodla'aansho
awoodli'i
awoodsii
awoodsiin
awoodsiis
awoowe
awow
awr
awradhale
awradhaye
awrdhal
awrdhaw¹
awrdhaw²
awrdhebid
awrqaad
awtaamid
awtaan
awtomaatig
awtomaatiko
axaaddiis
axad¹
axad²
axadeysasho
axadeysi
axadeyso
axadh¹
axadh²
axadhid
axal¹
axal²
axan¹
axan²
axar
axaran
axarid
axarnaan
axarnaansho
axdi
axgab¹
axgab²
axgabid
axkaan
axmaq
axmaqnimo
axmid
axran
axranaan
axranaansho
axrid
axsaab
axsaan
axsantu
axwaal
ay¹
ay²
ay³
ay4
ayaa
ayaamo
ayaan²
ayaandaran
ayaandarnaan
ayaandarnaansho
ayaandarri
ayaandarro
ayaanla'aan
ayaanlaawe
ayaanle
ayaanli'i
ayaansasho
ayaanso
ayaantirin
ayaanwanaag
ayaanxumaan
ayaanxumaansho
ayaanxumi
ayaanxumo
ayaanxun
ayax
aydin
aydiyaalism
aydiyolooji
aydiyooloojiyo
ayeeyo
ayeeyolugadheer
ayeeyolugdheer
aygarad
aygaradnimo
ayid
ayidid
ayidsan
ayidsanaan
ayidsanaansho
ayiman
ayimid
ayimnaan
ayimnaansho
ayin¹
ayin²
aynab¹
aynab²
aynabid
aynfaad¹
aynfaad²
aynfaadid
ayni
aynnu
aynshaad¹
aynshaad²
aynshaadid
ayo
ayodhiin
ayoon
ayoonisfeer
ayoon-taban
ayoon-togan
ayro
aysootoonik
