b
ba
ba'¹
ba'²
baa
baab
baabaha
baabasiir
baabba'¹
baabba'²
baabbaca-caleen
baabbacayn
baabbacays
baabbacee
baabbaco
baabbah
baabba'san
baabba'sanaan
baabba'sanaansho
baabbe
baabbi'i
baabbi'id
baabbi'in
baabbi'is
baabbul
baabee
baabeyn
baabila
baabillooma
baabsad
baabsasho
baabsi
baabso
baabusiir
baabuur
baabuurraac
baac
baaci
baacin
baacsad
baacsan
baacsanaan
baacsanaansho
baacsasho
baacsi
baacso
baacug
baad¹
bąad¹
baad²
bąad²
baadari
baaddad
baaddil
baaddilnimo
baaddiye
baaderi
baadi
baadibixiye
baadibooliye
baadicarar
baadid
bąadid
baadiddon¹
baadiddoon²
baadiddoonid
baadiddoonis
baadifad
baadifur
baadiggef¹
baadiggef²
baadiggefid
baadiggoob¹
baadiggoob²
baadiggoobid
baadiggoobis
baadinnimo
baadiqaris
baadisooc¹
baadisooc²
baadisoocid
baadiyayn
baadiyaysan
baadiyaysnaan
baadiyaysnaansho
baadiyee
baadiyoobid
baadiyow
baaf
baafi
baafin
baafis
baah¹
baah²
baahan
baahasho
baahawadaag
baahayn
baahee
bąahi
baahi¹
baahi²
baahid
baahillaawe
baahin
bąahin
baahirsaaf
baahis
bąahis
baahitir¹
baahitir²
baahitirid
baahnaan
baahnaansho
baahnow
baaho¹
baaho²
bąahsan
bąahsanaan
bąahsanaansho
baaji
baajin
baakad
baako
baal¹
baal²
baalal
baalalley
baalash¹
baalash²
baalashee
baalasheyn
baalashid
baalbaal
baalcad¹
baalcad²
baalcas
baaldacar
baaldhiig
baaldi
baaldillaacsad
baaldillaacsasho
baaldillaacsi
baaldillaacso
baalentoloji
baalfallaar
baalgorayo
baalgub
baali
bąali¹
bąali²
bąalid¹
bąalid²
bąalidid
bąalin
bąalis
baaliyoobid
bąaliyoobid
baaliyow
bąaliyow
baallacad
baallayn
baallee
baalley
baalleybarro
baalquraanle
baaltaag¹
baaltaag²
baaltaagid
baaluq¹
baaluq²
baaluqad
baaluqid
baaluqnimo
baaluqo
baalxaaf
baambow
baamiye
ba'an
baan¹
baan²
baan³
baanasho
baandhayn
baandhays
baandhee
baandho
baane
baangad
baani
baanid
baanin
baanis
baanise
baaniso
baaniyaal
baanji¹
baanji²
baanjiyid
baankariis
baano
baansad
baansasho
baansi
baansiin
baansiino
baanso¹
baanso²
baantiisimaada
baantookh
baantookhid
baantow
baantoy
baaq¹
baaq²
baaq³
baaqad
baaqasho
baaqbaaq
baaqbaaqid
baaqe
baaqi
baaqid
baaqimo
baaqin¹
baaqin²
baaqo
baaqsad
baaqsasho
baaqsi
baaqso
baaquli
baar¹
baar²
baar³
baaraabuf
baaraabuq
baaraan
baaraandeg¹
baaraandegid
baarad
bąarad
baaranooya
baarasho
bąarasho
baarashuud
baarax
baarbitureyt
baare
baarfuran
baari¹
baari²
baarid¹
baarid²
baarin¹
baarin²
baaris¹
baaris²
baaris³
baaritaan
baariyam-salfeyt
baariyid
baarlammaan
bąaro
baaro¹
baaro²
baarqab
baarramid
baarran¹
baarran²
baarri
baarrimasho
baarrimo
baarrinnimo
baarrog
baarroho
baarug
baarugid
baaruud
baaryid
baaryoomid
baaryoon
baas¹
baas²
baasaboor
baasaboorto
baasarac
baasarce
baasaysad
baasaysasho
baasaysi
baasayso
baash
baashaal¹
baashaal²
baashaali
baashaalid
baashaalin
baashaar
baashad
baashee
baasheyn
baashi
baashir
baashirid
baasho¹
baasho²
baasid
baasiin
baasiino
baasilas
baaskiil
baasto
baastoolad
baatad
baati
baatir
baatooloji
baatul¹
baatul²
baatulan¹
baatulan²
baatulid
baatulmid
baatulnaan
baatulnaansho
baawasiir
baawee
baaweyn
baaxaaddeg¹
baaxaaddegan
baaxaaddegid
baaxaadeg¹
baaxaadeg²
baaxaadegan
baaxaadegid
baaxaadegnaan
baaxaadegnaansho
baaxadsoore
baaxeer
baay
baayac¹
baayac²
baayacad
baayacasho
baayacmushtar¹
baayacmushtar²
baayacmushtari
baayacmushtarid
baayaco
baayactamid
baayactan¹
baayactan²
baaybal
baayicid
baayir¹
baayir²
baayirid
baayirnimo
baayoco
babac¹
babac²
babacdhig¹
babacdhig²
babacdhigid
babactamid
babactan¹
babactan²
babbaay
babbad
babban
babbasho
babbi
babbin
babbis
babbisjinni
babbo
babcan
babcanaan
babcanaansho
babcid
bac
bacaac
bacaad
bacaadcelin
bacaad-qaab-bileed
bacad
bacadle
bacaraar
bacaroor
bacaw¹
bacaw²
bacayr
bacdad
bacdamaa
bacdi
bacle
bacleel
bacleelid
bacood
bacramid
bacran¹
bacran²
bacranaan
bacranaansho
bacrimane
bacrimayn
bacrimays
bacrimee
bacrimi
bacrimin¹
bacrimin²
bacrimis
bacrimiye
bacrin-la'an
bacsii
bacsiin
bąd
bad¹
bad²
badad
badad-birlabeed
badalli
badan¹
badan²
badanaa
badan-midab-ileys
badar
badasho
badbaadayn
badbaadaysasho
badbaadayso
badbaadee
badbaadi
badbaadin
badbaadis
badbaado
badbaadsasho
badbaadso
badbad
badbadi
badbadid
badbadin
badbax¹
badbax²
badbeed
badbeedid
badbixid
baddal¹
baddal²
baddalaad
baddalan¹
baddalan²
baddalasho
baddalid
baddalmid
baddalnaan
baddalnaansho
baddalo
bad-dhac
badeecad
badeeco
badeel
badfur
badfuran
badhan
badhax
badhaysi
badhe
badhi¹
badhi²
badhiwale
badho
badi¹
badi²
badid
badidhace¹
badidhace²
badiil
badin
badis
badiyid
badmaax
badmar
badmareen
badmarid
badnaan
badnaansho
badni
badnow
bado
badow
badownimo
badraan
badraannimo
badrad
badsad
badsasho
badsi
badso
baduug
baduugan¹
baduugan²
baduugid
baduugis
baduugnaan
baduugnaansho
baduujin
baduujis
baduuqan²
baduuqid
baduuqnaansho
badweyn¹
badweyn²
badwi
badwiyad
badxidhan
badxir
badxiran
badyaro
baf
bafto
baga
bagaago
bagaf
bagafsan
bagafsanaan
bagafsanaansho
bagagi
bagal
bah
bąh
bahaahin
bahaa'in
bahaayin
bahal¹
bahal²
bahaldile
bahaldileen
bahalhiglo
bahalhoosaad
bahalhoose
bahalnimo
bahaloobid
bahalow¹
bahalow²
bahardaac¹
bahardaac²
bahardaaci
bahardaacid
bahardaacin
bahardaacis
bahardaadi
bahardaadin
bahaysad
bahaysasho
bahaysi
bahayso
bah-cadceed
bahgaatama
bahgulufto
bahnimo
baho
bahoobid
bahow¹
bahow²
bahwadaag
ba'id
baji
bąji
bajin
bąjin
bakaal
bakaar
bakaaroobid
bakaarow
bakad
bakade
bakayle
bake
bakeeri
bakhaar
bakhaarhaye
bakhayl¹
bakhayl²
bakhaylad
bakhaylid
bakhaylnimo
bakhiil¹
bakhiil²
bakhiilid
bakhiilnimo
bakhti¹
bakhti²
bakhti-afuuf¹
bakhti-afuuf²
bakhti-afuufid
bakhtifuul
bakhtiggowrac¹
bakhtiggowracid
bakhtiiji
bakhtiijin
bakhtiijis
bakhtiin
bakhtiis
bakhtijiid¹
bakhtijiid²
bakhtijiidid
bakhtijiidis
bakhti-ku-baxe
bakhtiquf¹
bakhtiquf²
bakhtiqufid
bakhtiwareemid
bakhtiwareen¹
bakhtiwareen²
bakhtiyaanasiib
bakhtiyid
bakool
bakoorad
bakooro
bakteeriafayj
bakteeriya
bakteeriya-ciijiye
bal¹
bal²
balaambal¹
balaambal²
balaambalid
balaanktoon
balaaqo
balaasma
balaasmoodiya
balaasmoodiyam
balaatihelmantis
balaayo
balac¹
balac²
balacsad
balacsan
balacsanaan
balacsanaansho
balacsasho
balacsi
balacso
balaf
bąlaf¹
bąlaf²
balafbalafsii
balafbalafsiin
balag¹
balag²
balalo
balaloo
balalood
balambaallis
balambal¹
balambal²
balambalid
balambam
balanbalo
balanqo
balaq¹
balaq²
balaqid
balaqoobid
balaqow
balaqsad
balaqsan
balaqsanaan
balaqsanaansho
balaqsasho
balaqsi
balaqso
balashi
balaslayn
balaslee
balbal
balbalayn
balbalee
balbalid
balbalo
baldaaq
baldhoole
balfi
bąlfi
balfid
balfin
bąlfin
balfis
bąlfis
balki
ballaa
ballaar
ballaarad
ballaaran
ballaarasho
ballaari
ballaarin
ballaarin
ballaarnaan
ballaarnaansho
ballaaro
ballaarsad
ballaarsasho
ballaarsi
ballaarso
ballaas
ballac
ballad
ballami
ballamid
ballamin
ballan¹
ballan²
ballanbaaji
ballanbaajin
ballanbaajis
ballandarnaan
ballandarnaansho
ballandarri
ballandarro
ballandhigad
ballandhigasho
ballandhigo
ballanfur¹
ballanfur²
ballanfurid
ballanfuryo
ballangal¹
ballangal²
ballangelid
ballanqaad¹
ballanqaad²
ballanqaadid
ballanqaadis
ballansan
ballansanaan
ballansanaansho
ballaq¹
ballaq²
ballaqan¹
ballaqan²
ballaqid
ballaqmid
ballaqnaan
ballaqnaansho
ballayn
ballaysimo
ballaysin
ballee
balli
balliqid
balool
balooley
baloolley
balow
bąlow¹
bąlow²
bąlow³
balqami
balqamin
balqamis
balqan
balqan-keenebalqasho
balqi
balqin
balqo
balwad
balwee
balweyn
balwid
balwo
balxad
balxasho
balxo
bambaani
bambaanin
bambaano
bamban
bambas
bambasayn
bambasee
bambasoobid
bambasow
bambax¹
bambax²
bambiiro
bambixid
bambo
bamgaree
bamgareyn
ban¹
ban²
banaadiiq
banaag
ba'naan
banaanadi
banaanadin
banaanadis
ba'naansho
banaatiiq
banaaxi¹
banaaxi²
banaaxin
banaaxiyid
banaaxo
banbaano
bandar
bandhig¹
bandhigan
bandhigid
bandhignaan
bandhignaansho
bandiirad
bandiiro
bandoo
bandow
banduul
banfadhi
banfariisad
banfariisasho
banfariisi¹
banfariisi²
banfariiso
bangalo
bangaree
bangareyn
bangi
banii-aadan
banii-aadannimo
banii-aadmi
banji
banji-bicaddaan
banji-bidooh
banji-bijoohaar
banji-bisaliim
banji-bishiish
banji-biyeeg
banjiyad
banjoog
banjoogoobid
banjoogow
bankad
bankarroor¹
bankarroor²
bankarroori
bankarroorid
bankarroorin
bankarroorsan
bankarroorsanaan
bankarroorsanaansho
banki
banmar¹
banmar²
banmari
banmarid
banmarin
banmaris
bannaambax¹
bannaambax²
bannaambixidbannaan¹
bannaan²
bannaanaan
bannaanaansho
bannaanayn
bannaanee
bannaan-fatah
bannaanow
bannayn
bannee
bano
banoo
banood
banqay
banqi
bansiin
bantar¹
bantar²
bantarid
baq¹
baq²
baqaal
baqaalad
baqabbeenlayn
baqabbeenle
baqabbeenlee
baqabbeeno
baqacarar¹
baqacarar²
baqacararid
baqal¹
baqal²
baqalye
baqalyo
baqas
baqasho
baqay
baqaye
baqaynimo
baqbaq
baqbeeno
baqdhoos
baqdin
baqe
baqid
baqlad
baqo¹
baqo²
baqool¹
baqool²
baqoole
baqooli
baqoolid
baqoolin
baqoolis
baqoolsii
baqoolsiin
baqoolsiis
baqshad
baqshadayn
baqshadee
baqshiish¹
baqshiish²
baqshiishid
baqti¹
baqti²
baqti-afuuf¹
baqti-afuuf²
baqti-afuufid
baqtifuul
baqtiggowrac¹
baqtiggowrac²
baqtiggowracid
baqtii
baqtiiji
baqtiijin
baqtiijis
baqtiin
baqtiis
baqtijiid¹
baqtijiid²
baqtijiidid
baqtijiidis
baqtiquf²
baqtiqufid
baqtiwareemid
baqtiwareen¹
baqtiwareen²
baqtiyaanasiib
baqtiyid
bar¹
bar²
bar³
bar⁴
baraacuud
baraag
baraakad
baraakin
baraako
baraale
baraaley
baraamitir
baraaq
baraar¹
baraar²
baraar³
baraaraysan
baraaraysnaan
baraaraysnaansho
baraare
baraari
baraarid
baraarin
baraaris
baraarnimo
baraaro
baraarshishi¹
baraarshishi²
baraarshishiyid
baraarug¹
baraarug²
baraarug³
baraarugid
baraarugsan
baraarugsanaan
baraarugsanaansho
baraarujin
baraarujin-caafimaad
baraarujis
baraas
baraashirix
barabbax
barabbax
barabbax¹
barabbax²
barabbixid
barad
baradhacsasho
baradhacsi
baradhacso
baradho
baradii-ku-noole
baraf
barafasoor
barafayn
baraf-dhagax
baraf-dhalaal
baraf-durduro
barafoobid
barafow
barafuumayn
barafuumaysan
barafuumaysnaan
barafuumaysnaansho
barafuumee
barafuun
barahaman
barakac¹
barakac²
barakayn
barakaysan
barakaysasho
barakaysnaan
barakaysnaansho
barakayso
barakee
barakicid
barako
barakoobid
barakow
baraley
barambaro
barambarqo
baramboorri
baran¹
baran²
barandi
barannimo
baranugul
baraq
baraqnugeyl
baraqnuglaan
baraqnugeyl,
baraqnuglaansho
baraqnuglow
baraqnugulbarar¹
barar²
bararan
barari
bararid
bararin
bararis
barariso
bararnaan
bararnaansho
bararsan
bararsanaan
bararsanaansho
bararshe
baras
barasaab
barashada-baali-nololeedbarashada-badweynada
barashada-cilmiyadii
barashada-foosillada
barashada-gabowga
barashada-lakabyada-dhulka
barashada-unugga
barasho
barashuud
baratami
baratamid
baratamin
baratan¹
baratan²
baratansii
baratansiin
baratansiis
barax¹
barax²
baraxume
barbaar¹
barbaar²
barbaar³
barbaari
barbaarid
barbaarin
barbaaris
barbaariye
barbaarnimo
barbar¹
barbar²
barbarafow
barbaran
barbarda'¹
barbarda'²
barbardhac¹
barbardhac²
barbardhicid
barbardhig
barbardhigid
barbardi'id
barbarid
barbarkadhac
barbarkadhicid
barbarnaan
barbarnaansho
barbarradhac¹
barbarradhac²
barbarradhicid
barbarrayn
barbarree
barbarro
barbartamid
barbartan¹
barbartan²
barbax¹
barbax²
barbixi
barbixid
barbixin
barbixis
bardad¹
bardad²
bardadid
bardadsan
bardadsanaan
bardadsanaansho
bardaq
bardaqsan
bardaqsanaan
bardaqsanaansho
barde
bardiil
bardooddamid
bardooddan¹
bardooddan²
bardootamid
bardootan¹
bardootan²
bare
bareeg
bareer¹
bareer²
bareerid
bareero
barfasoor
bargarasho
bargaro
bari¹
bari²
bari³
baricadde
barid
baridhawr
bariggo'an
bariggoo
bariggooyo
bariggoyn
barii
bariid
bariidi
bariidin
bariidis
bariido
bariin
bariiq
bariir
bariis
bariisasho
bariisii
bariisiin
bariiso¹
bariiso²
barijab
barijugle
barijuglee
barijugley
barijugleyn
barimarsi
baris
baritaar¹
baritaar²
baritan
bariweyne
barixume
barjaho
barjayn
barje
barjee
barjimasho
barjimo
barjo
barjooqo
barkad¹
barkad²
barkad³
barkadhac¹
barkadhac²
barkadhicid
barkadid
barkadley
barkadsan
barkadsanaan
barkadsanaansho
barkag¹
barkag²
barkagid
barkagsan
barkagsanaan
barkagsanaansho
barkarkareed
barkasho
barkhad
barkhadayn
barkhadee
barkhadle
barki
barkimo
barkin¹
barkin²
barkin³
barkindhac¹
barkindhac²
barkindhicid
barkinwaraabe
barko
barlamaan
barlammaan
barmaguur
barmid
barmiil
barnaamij
barnaan
barnaansho
barni
barnoqod
baro¹
baro²
barood¹
barood²
baroodid
baroole
barooq
baroor¹
baroor²
baroor³
baroorad
baroorasho
baroordiiq¹
baroordiiq²
baroordiiqid
baroori
baroorin
barooro¹
barooro²
baroorsasho
baroorsi
baroorsii
baroorsiin
baroorso
barqaceli
barqacelin
barqacelis
barqagibin
barqalibaaxi
barqalibaaxin
barqammaal¹
barqammaal²
barqammaalid
barqanoqo
barqanoqod
barqanoqosho
barqaqabow
barqi
barqiirqiir
barqimo
barqin¹
barqin²
barqo
barqo-kulul
barqorraxeed
barraah¹
barraah²
barraahid
barraahsad
barraahsasho
barraahsi
barraahso
barraaji
barraajin
barraajis
barraaq
barraaqdo
barraaqid
barraaqsad
barraaqsasho
barraaqsi
barraaqso
barrad
barras
barriiji
barriijin
barriin
barriiqasho
barriiqo¹
barriiqo²
barroosi
barroosin
barsad
barsakhan
barshin
barshinwaraabe
barsho
barso
bartame
bartan
bartilmaameed
bartiree
bartireyn
bartiyaqaan
bartiyaqaannimo
baruur
barwaaqasooran
barwaaqayn
barwaaqaysan
barwaaqaysasho
barwaaqaysnaan
barwaaqaysnaansho
barwaaqayso
barwaaqee
barwaaqo
barwaaqoobid
barwaaqow
barxad¹
barxad²
barxamid
barxan¹
barxan²
barxanaan
barxanaansho
barxasho
barxid
barxo
baryaddilad
baryaddilasho
baryaddilo
baryaddoon
baryadilad
baryadilasho
baryadilo
baryaqaad¹
baryaqaad²
baryaqaadid
baryaysad
baryaysasho
baryaysi
baryayso
baryid
baryo
baryood
baryootamid
baryootan¹
baryootan²
bas¹
bas²
basaas¹
basaas²
basaas³
basaasan
basaasid
basaasnaan
basaasnaansho
basaasnimo
basaay
basal
basalt
ba'san
ba'sanaan
ba'sanaansho
basanbaas¹
basanbaas²
basanbaasi
basanbaasid
basanbaasin
basar¹
basar²
basari¹
basari²
basarikibir
basarin
basarlow
basarxumaan
basarxumaansho
basarxumi
basarxumo
basarxumow
basarxun
basbaas
bash¹
bash²
bashaash
bashaashad
bashaashnimo
bashaqle
bashbash
bashiic
bashiican
bashiici
bashiicin
bashiicmid
bashiicsan
bashiicsanaan
bashiicsanaansho
bashiishad
bashiishasho
bashiishirad
bashiishirasho
bashiishiro
bashiisho
basho
bashuuqsad
bashuuqsasho
bashuuqsi
bashuuqso
basid
baslayn
basle
baslee
baso
basoole
basowti
basowtinnimo
basrid
bastoolad
bastooreyn
bataato
bataax
batac
batacsan
batacsanaan
batacsanaansho
batal
batar
batiikh
batiikhoobid
batiikhow
batiiq
batoojin
batraamid
batraan¹
batraan²
batraannimo
batrool
batuux
bawaasiir
bawhaar
bawis¹
bawis²
bawisid
bawlad
bawlo
bawne
bax
baxaalli
baxaar
baxar
baxarsaaf
baxdow
baxdownnimo
baxdoy
baxdoynnimo
baxnaan
baxnaani
baxnaanin
baxnaanis
baxnaano
baxnin
baxri
baxsad
baxsan
baxsanaan¹
baxsanaan²
baxsanaansho
baxsasho
baxshuush
baxshuushsan
baxshuushsanaan
baxshuushsanaansho
baxsi
baxsii
baxsiin
baxsiis
baxso
bayaad
bayaan
bayaani
bayaanin
bayaxaw
bayb
baybayle
baybaysasho
baybaysi
baybayso
bayd
baydaan
baydacar
baydad¹
baydad²
baydadi
baydadin
bayddi
baydi
baydin
baydwalaal
bayhoof¹
bayhoof²
bayhoofid
bayhoofsan
bayhoofsanaan
bayhoofsanaansho
bayid
bayidid
bayl¹
bayl²
baylah
baylahayn
baylehee
bayli
baylid
baylihi
baylihin
baylin
baylis
baylohoobid
baylohow
baynibax¹
baynibax²
baynibixi
baynibixid
baynibixin
baynibixis
bayoolajiga-moolikiyuullada
bayooloji
bayr¹
bayr²
bayr³
bayrabayre
bayrac
bayraq
bayrbayr¹
bayrbayr²
bayrbayriyid
bayri
bayrid
bayrin
baysadhabad
baysadhabasho
baysadhabo
baysaqasho
baysaqo
baytammaal¹
baytammaal²
baytammaalid
bayti
baytimmaal¹
baytimmaal²
baytimmaali
baytimmaalid
baytimmaalin
baytimmaalis
baytin
baytis
bayuur
bayuurayn
bayuuree
beb
bebid
bebsiin
bed¹
bed²
bed³
beddel¹
beddel²
beddelaad
beddelan¹
beddelan²
beddelasho
beddelid
beddelmid
beddelnaan
beddelnaansho
beddelo
beden
beder¹
beder²
bedertami
bedertamid
bedertamin
bedertan¹
bedertan²
bedertansii
bedertansiin
bedertansiis
bedqab
bedqabid
bedqabis
bedrid
beeb
beeba
beec
beeci
beecin
beecis
beecmushtar¹
beecmushtar²
beecmushtari
beecmushtarid
beecsad
beecsasho
beecsi
beecso
beed
beedal¹
beedal²
beedalan
beedalid
beedalnaan
beedalnaansho
beeddal¹
beeddal²
beeddalan
beeddalid
beeddalnaan
beeddalnaansho
beeg¹
beeg²
beegaal-heerkul-cadaadis-(B.H.C.)
beegan¹
beegan²
beegasho
beegid
beegmo
beegnaan
beego
beegsad
beegsasho
beegsi
beegso
beejaggoys
beejaqab
beeji
beejin
beejo
beekhaami
beekhaamid
beekhaamin
beekhaan¹
beekhaan²
beekhaansad
beekhaansan
beekhaansanaan
beekhaansanaansho
beekhaansasho
beekhaansi
beekhaanso
beel¹
beel²
beel³
beelaysan
beelaysasho
beelaysi
beelaysnaan
beelaysnaansho
beelayso
beeldaaje
beelid
beeloobid
beelow
beelyo
beembeen
beembeeni
beembeenin
been
beenaale
beenaaley
beenawaas
beenayn
beendabaad
beendadaab
beendhure
beenee
beenguur¹
beenguur²
beenguurid
beenguuris
beenhawaas
beenhawaasad
beeni
beenii-aadmi
beenin
beenley
beenlow
beenoobid
beenow
beensheeg
beensheegid
beeqbaaq¹
beeqbaaq²
beeqbaaqid
beer
beer¹
beer²
beer³
beer-abuur
beerabuurid
beerabuuris
beeraley
beeran¹
beeran²
beer-aqoon¹
beer-aqoon²
beer-aqoonnimo
beerasho
beercaddaad
beercaddaansho
beercaddow
beerdulacsad
beerdulacsasho
beerdulacsi
beerdulacso
beerdulucsasho
beerdulucsi
beerdulucso
beerfal
beerfalasho
beerfalid
beerfalis
beerfalow
beerfarriije
beerfuur
beergooye
beergoys
beeri
beerid
beerin
beeris
beerjilcan
beerjilcanaan
beerjilcanaansho
beerjileec
beerkurus
beerkutaal
beerkutaallo
beerlaag
beerlamaane
beerlaxawsad
beerlaxawsasho
beerlaxawsi
beerlaxawso
beermid
beernaan
beernaansho
beernugeyl
beernuglaan
beernuglanaansho
beernuglow
beernugul
beero
beerqaad¹
beerqaad²
beerqaadid
beerrey
beersaar¹
beersaar²
beersaarid
beersaaro
beertacab
beerxaw
beeryaro¹
beeryaro²
beesad
beeso
beestayn
beesteen
beexaamid
beexaan¹
beexaan²
beeyo
begel
beji
bejiino
bejin
bejis
bejiye
bejiyo
bekeeri
bekel
bekelnimo
belaayo
belbel¹
belbel²
belbeli
belbelid
belbelin
belbelis
beldaan
beled
beledee
beledeyn
beledeysasho
beledeysi
beledeyso
belediyad
belee
belel¹
belel²
beleli
belelid
belelin
belelis
beleyn
beleysan
beleysnaan
beleysnaansho
bellaagra
belo
beloobid
below
belwo
bender
bengali
beni
benii-aadan
benii-aadannimo
benii-aadmi
benisiliin
benned
bennedan¹
bennedan²
bennedid
bennednaan
bennednaansho
bensiin¹
bensiin²
berber¹
berber²
berberan¹
berberan²
berberid
berbermid
berbernaan
berbernaansho
berded¹
berded²
berdedid
berdedsan
berdedsanaan
berdedsanaansho
beretami
beretamid
beretamin
beretan¹
beretan²
beretansii
beretansiin
beretansiis
beri¹
beri²
beriberi
beridhax
beridhaxmo
berisabool
berisamaad
beritalsis
beriyid
berkad
berked
berkeg¹
berkeg²
berkegid
berkegsan
berkegsanaan
berkegsanaansho
berri¹
berri²
berribiyood
berridambe
berrin
berrito
berriyeed
bersad
bersed
berso
bes
betrooliyam
bey¹
bey²
bey'ad
beycad
beycas
beyd
beydacar
beygag¹
beygag²
beygagi
beygagid
beygagin
beyguduud
beymmadow
beynaad
beynajaho
beys
beytalmay
beytimmaal¹
beytimmaal²
beytimmaali
beytimmaalid
beytimmaalin
beytimmaalis
beytulxaraam
beytummaal¹
beytummaal²
biciid
bicir
biciriir
biciriirsad
biciriirsasho
biciriirsi
biciriirso
bid
bidaa'i
bidaal
bidaar¹
bidaar²
bidaarhoraad
bidaarle
bidaarloobid
bidaarlow
bidaarre
bidaarroobid
bidaarrow
bidcee
bidceyn
bidceysasho
bidceyso
bidci
bidcinnimo
bidco
bidcoobid
bidcow
biddad
biddannimo
bidde
biddo
biddood
bidhaamid
bidhaan¹
bidhaan²
bidhaansad
bidhaansasho
bidhaansi
bidhaanso
bidibidi
bidid
bidix
bidixee
bidixeyn
big
bigayn
bigays
bigee
bigil
biglayn
biglee
bigrojebi
bigrojebin
bihimbih
bihimbihi
bihimbihin
bi'i
bii'ad
biibbiilayn
biibbiile
biibbiilee
biibbo
biibiile
biic
biici
biicin
biicis
biicmushtar¹
biicmushtar²
biicmushtaritahay;
biicmushtarid
biicsad
biicsasho
biicsi
biicso
biid
bi'id
biif¹
biif²
biif-abaar
biifane
biifayn
biifee
biifid
biig
biijo
biil¹
biil²
biilasho
biilid
biilo
biimayn
biime
biimee
biimo
biin
bi'in
biinan
biindhayn
biindhee
biindho
biiq¹
biiq²
biiqid
biir¹
biir²
biir³
biire
biiri
biirid
biirin
biiriqaate
biiris¹
biiris²
biirjeex
biirjeexnimo
biiro
biiroo
biiroobid
biirood
biirow
biirqool¹
biirqool²
biirqoolan
biirqoolid
biirqoolnaan
biirqoolnaansho
biirsad
biirsamid
biirsan¹
biirsan²
biirsanaan
biirsanaansho
biirsasho
biirsi
biirso
bi'is
biishad
biish-bicaddaan
biish-bidooh
biish-bijoohaar
biish-bijoohar
biish-bisaliim
biish-bishiish
biish-biyeeg
biitaysad
biitaysasho
biitaysi
biitayso
biito
biixi
biixiweyn
bijaamo
bikaac
bikaaco
bikaacsad
bikaacsasho
bikaacsi
bikaacso
bikil¹
bikil²
bikilan¹
bikilan²
bikilid
bikilmid
bikilnaan
bikilnaansho
bikrad
bikrajebi
bikrajebin
bikrajebis
bil¹
bil²
bilaaban
bilaabasho
bilaabid
bilaabmid
bilaabo
bilaale
bilaash
bilaashxeyte
bilad
biladdaye
bilan
bilasho
bila-yaro
bilbil¹
bilbil²
bilbilan
bilbilasho
bilbilid
bilbilnaan
bilbilnaansho
bilbilo¹
bilbilo²
bilcaan
bilcamid
bilcan¹
bilcan²
bilcil
bilcooshaan
bildayaxeed
bileys
bileysad
bileysasho
bileysi
bileyso
bilhaarsiya
bili
bilic
bilicsan
bilicsanaan
bilicsanaansho
bilid
bilig
biligbilig
biliglayn
biliglee
biliis
bililiqaysad
bililiqaysasho
bililiqaysi
bililiqayso
bililiqo
biliq
bilirubiin
bilis
bilisayn
bilisee
bilisxaawo
bilisxawood
bilkeedi
bilkeedin
bilkeedo
billaa
billaaban
billaabasho
billaabid
billaabmid
billaabo
billaawe
billad
billayn
billaysimo
billaysin
billee
billow¹
billow²
bilmasal
bilmasil
bilmatal
bilmatil
bilmesel
bilmetel
bilnaan
bilnaansho
bilo
bilooras
bilow¹
bilow²
bilqan
bilqanaan
bilqanaansho
bilqasab
bilqaxan
bilqaxnaan
bilqaxnaansho
bilqid
bilyaardi
bilyan
bini
binii-aadan
binii-aadannimo
binii-aadmi
biniini
biniinin
biniinis
binnuur
binnuuri
biqid
biqil¹
biqil²
biqitin
biqlayn
biqlays
biqle
biqlee
biqlid
biqlo
bir¹
bir²
bir³
biraha-alkaali
bir-ajuuraan
birayn
bircayd
birdaawe
birdaawo
birdanab
birdhaf
birdhi
birdhic
birdhig¹
birdhig²
birdhigid
bire
biree
bireeris
biresbiyobiya
biri
birid
biriir
biriiri
biriirin
biriiris
biriirix
biriirixid
biriiryaabid
biriiryow¹
biriiryow²
birikinnaas¹
birikinnaas²
birikinnaasid
birilaxooxeed
birimbirqayn
birimbirqee
birimbirqo
birin
biriq¹
biriq²
biririf
birisam
biriwax¹
biriwax²
biriwixid
birikinnaasid,
birjeeb
birjeex
birjiir
birjiko
birlabnimo-duleed
birlaxooxeed
birmac
birmad
birmasho
birmiil
birmo
biro-dhuleed-alkaliin
birow
birqaab
birqabad
birqabad-dhalis
birqalax
birqid
birre
birri
birriyad
birsan
birshub
birshubid
birsol¹
birsol²
birsolid
birsulub
birtaawe
birtaawo
bir-u-eke
birxaar
birxarbi
bis
bisabbisoo
bisabbisood
bisad
bisayl
bisbaas
bishaarad
bishaarayn
bishaaree
bishaaro
bishiic
bishiican
bishiici
bishiicin
bishiicmid
bishiicsan
bishiicsanaan
bishiicsanaansho
bishil¹
bishil²
bishilid
bishin
bishkil¹
bishkil²
bishkilid
bisil
bisimbisoo
bisimbisood
bisin
bisiq
biskoo
biskood
biskoodsii
biskoodsiin
bislaan
bislaansho
bislayn
bislays
bislaysad
bislaysasho
bislaysi
bislayso
bislee
bislow
bismillaahi
bismillee
bismilleyn
bisqan
bisqanley
bisqin
bisturi
bitaamid
bitaan¹
bitaan²
biti¹
biti²
bitijor
bitin
bito
bituuminas
bixi
bixid
bixin
bixis
bixitimid
bixitin¹
bixitin²
bixiye
biyaano
biyabbax¹
biyabbax²
biyabbaxo
biyabbeel¹
biyabbeel²
biyabbeelid
biyabbixid
biyabbiyayn
biyabbiyee
biyabbiyo
biyabbiyoobid
biyabbiyood
biyabbiyow¹
biyabbiyow²
biyabbooli
biyaddiid¹
biyaddiid²
biyaddiidid
biyadhac¹
biyadhac²
biyadhaceen
biyadhicid
biyadhig¹
biyadhig²
biyadhigid
biyafariisad
biyafariisin
biyaggaleen
biyajab
biyajiid
biyakuhar
biyamar
biyamarin
biyamaris¹
biyamaris²
biyammacee
biyammaceyn
biyammaddaadshe
biyammareen
biyantooni
biyantooniyad
biyaqabad
biyaqabatin
biyarraacidhammeysa
biyarraacin
biyashub
biyashubad
biyashuban
biyashubasho
biyashubmid
biyashubo
biyatooni
biyatooniyad
biyaxir
biyaxireen
biyayari
biyayaro
biyayarood
biyee
biyeyn
biyo
biyo¹
biyo²
biyobax
biyoculus¹
biyoculus²
biyodhac
biyodhac-yar
biyo-dhuleed
biyo-fadhis
biyo-fududayn
biyogal
biyo-goboleedbiyoobid
biyood
biyoole
biyo-saar
biyow¹
biyow²
biyuutanool
bocool
bocoolaggale
bocoolaggurad
bocoolaggurasho
bocoolagguro
bocor¹
bocor²
bog¹
bog²bog³
bogaad
bogaadi
bogaadin
bogaadis
bogaadsi
bogasho
bogcad
bogdoox¹
bogdoox²
bogdooxid
boggan
bogganaan
bogla'
bogo
bogox
bogsad
bogsasho
bogsi
bogsiin
bogsiis
bogsoo
bogsood
bohol
boholaddumi
boholaddumin
boholaddumis
boholatus¹
boholatus²
boholatusid
boholyoobid
boholyow¹
boholyow²
bohon
bohonnimo
boji
bojiino
bojin
bokooro
boliis
bolol¹
bolol²
bololid
bolshofiik
bombo
bongaree
bongareyn
boob¹
boob²
boobas
boobe
boobid
boobsii
boobsiin
boobsiis
booc¹
booc²
boocaar
bǫod
bood¹
bood²
boodaami
boodaamin
boodaan
boodal
boodayn
booddo¹
booddo²
boodee
boodh
boodhar
boodid
boodsii
boodsiin
boodsiis
boodsol
boog
boogadhay
boogadhaye
boogayn
boogaysan
boogaysnaan
boogaysnaansho
boogcalooleed¹
boog-calooleed²
boogcaloolo
boogee
boogoobid
boogow¹
boog-xiidmeed
boohaar
boohi
boohin
boohise
boojaal
boojay
booji
boojimo
boojin
boojis
boojisnimo
boolaboolo
boolamboolo
boolaxooftayn
boolaxooftee
boolaxoofto
boolayn
boolbare
boolbire
booldhannimo
booldhe
boolee
booli¹
booli²
boolibabtaydh
boolicun
boolicune
booliis
booliquute
boolixooftayn
boolixooftee
boolixoofto
boolo
boolyid
boon¹
boon²
boonbiyeed
boondhow
boongeli
boongelin
boongelis
booqad
booqasho
booqo
bǫor
boor¹
boor²
boor³
booraan
booraandawaco
booran
boorane
booranji
boorayn
booraysad
booraysasho
booraysi
boorayso
boore
booree
boorid
boorimee
boorimeyn
boorimo
boorjiif
boor-kamakacdo
boornaan
boornaansho
booron
boorri
boorrin
boorso
boos¹
boos²
boosay
boosh
boosh
booshool
booso
boostaale
boostada
boosto
bootaale
bootaan
bootar
bootayn
bootays
bootee
booti
bootimaale
bootimaaleysad
bootimaaleysasho
bootimaaleysi
bootimaaleyso
bootin
bootis
booto
bootoole
boowe
booy¹
booy²
booyaamid
booyaan¹
booyaan²
booyad
booyid
boqnagoo
boqnagooyo
boqnagoyn
boqnajarboqnajarid
boqol
boqolaad
boqollaal
boqolle
boqollow
boqon¹
boqon²
boqon³
boqondhaw¹
boqondhaw²
boqondhebid
boqongoo
boqongooyo
boqool¹
boqool²
boqoole
boqooli
boqoolid
boqoolin
boqoolis
boqoolsii
boqoolsiin
boqoolsiis
boqor¹
boqor²
boqorad
boqornimo
boqortiirshe
boqortooyo
boqoshaa
boqran
boqranaan
boqranaansho
boqrasho
boqrid
boqro
boqshad
borobogaanda
borojekshan-koombeed
borojekshan-sargo'an
borojekshan-toobineed
boromiin
boronkiito
borookaariyootigboroolataariyad
borootiin
borotiin-bu'eed
borotista
borotobalaasam
borotokool
borotoon
botani
bow
bowbow
bowd
bowdabbaariile
bowdaqaawi
bowdaqaawin
bowdaqaawis
bowd-dumis
bowdlameer
bowdlameeri
bowdlameerin
bowdlameersan
bowdlameersanaan
bowdlameersanaansho
bowdo
bowsasho
bowsi
bowso
boy¹
boy²
braagmatiismaha
bu'¹
bu'²
bu'asho
bub
bubbucood
bucabbucayn
bucabbucee
bucasho
bucayn
bucshirad
bucshiro
buctureen
bucul
bud¹
bud²
budaddar¹
budaddar²
budaddaran
budaddarid
budaddarnaan
budaddarnaansho
budayn
bud-dhig¹
bud-dhig²
bud-dhige
bud-dhigid
buddi
budee
budli
budlin
budlis
budo
budoobid
budow¹
budow²
budul
bug¹
bug²
bugayn
bugcad
bugee
bugtaan
bugto
bugux
buhabbuhayn
buhabbuhee
buhayn
buhee
buji
bujin
bukaan
bukaani
bukaanjiif
bukaannimo
bukaanqaad
bukaansocod
bukaansocod-eegto
bukaan-wareysi
bukaar
bukabbukayn
bukabbukee
bukasho
bukayn
bukaysii
bukaysiin
bukee
bukid
buko
bukoo
bukood
bukǫoni
bukur¹
bukur²
bul¹
bul²
bulaal¹
bulaal²
bulaali
bulaalid
bulaalin
bulaamid
bulaan¹
bulaan²
bulac
bulan
bulay
bulayn
bulaysan
bulaysnaan
bulaysnaasho
bulbul¹
bulbul²
buldi¹
buldi²
buldiyid
bule
bulee
buli
bulid
buliis
bullaacad
bullaale
bullo
bulmid
bulshannimo
bulshee
bulshey
bulsheyn
bulsheynimo
bulsho
bulu
bulukaati
bulukeeti
bulul
bulumbulyo
buluqbuluq
buluqbuluqlee
buluqbuluqleyn
bulush
buluto
buluug
bulxamid
bulxan¹
bulxan²
bumbo
bun
bunaaxi¹
bunaaxi²
bunaaxin
bunaaxis
bunaaxiyidbunaaxo
bunaysad
bunaysasho
bunaysi
bunayso
bunbay
bundad
bundaqiijiye
bunduq
bungaree
bungareyn
bungis
bunji
bunkis
bunnaahi²
bunnaahin
bunnaahis
bunnaahiyid
bunnaasho
buntuq
bunuug
bu'o
buq¹
buq²
buq³
buqad
buqasho
buqbuqayn
buqbuqee
buqbuqo
buqbuqood
buqcad
buqid
buqo
buqshad
buqul¹
buqul²
buquuji
buquujin
buquul
bur¹
bųr¹
bur²
bųr²
buraambur¹
buraambur²
buraamburid
buraash¹
buraash²
buraashad
buraashan
buraashid
buraashnaan
buraashnaansho
burabbahalaad
buracaanood
burad
buraddee
buraddeyn
buraddeys
buraree
burareyn
burareys
buray¹
buray²
burbur¹
burbur²
burburi
burburid
burburin
burburis
burbursad
burbursan¹
burbursan²
burbursanaan
burbursanaansho
burbursasho
burbursi
burburso
burcad¹
burcad²
burcadnimo
burcayd
burciid¹
burciid²
burco
burdad
burdaddo
burde
bure
buree
bureyn
bureys
burgaanti
burge
burhaan
buri
bųri
burid
bųrid
bųrin
burin¹
burin²
buris¹
bųris¹
buris²
bųris²
burjaan
burje
burjiko
burjiwaasi
burjuwaasiyad
burkaanti
burladduulnimo
burlaqan
burloox
burmad
bųro
buro¹
buro²
burobahalaad
burocaanood
buro-qanjireed
burqad
burqasho
burqo
burri
burrin
burris
bursad
bursaliid
bursariir
bursasho
bursayn
burshaan
burshin
burshintuur¹
burshintuur²
burshintuurid
bursi
bursiino
burso
burtuur¹
burtuur²
burtuurid
burtuuris
burtuursan
burtuursanaan
burtuursanaansho
burumbuur
burun
burunbur
burunji
burunjiyee
burunjiyeyn
buruq
burur¹
burur²
bururi
bururid
bururin
bururis
burursad
burursan
burursanaan
burursanaansho
burursasho
bururso
burush
buruud
buruudshiil¹
buruudshiil²
buruudshiilid
buruuj
bus
busaambus
busaarad
busaaradeysan
busaaradeysnaan
busaaradeysnaansho
busaaro
busbus
buseel¹
buseel²
buseelid
bushaarad
bushaaro
bushi
bushi¹
bushi²
bushin
bushintuur¹
bushintuur²
bushintuurid
bushkaleeti
bushkuleeti
bushle
buskeeti
buskud
bustaan
buste
busteeki
busur
butaac
butaaci
butaacid
butaacin
butaaco
buto
butuc
butucsan
butucsanaan
butucsanaansho
buturi
buturin
buub¹
buub²
buubaal¹
buubaal²
buubaalid
buubi
buubid
buubin
buubis
buubsad
buubsasho
buubso
buud
buudaan
buudhi¹
buudhi²
buudhin
buudhis
buudhqab
buuf¹
buuf²
buufbuuf
buufi
buufimo
buufin¹
buufin²
buufis
buufiye
buuflayn
buuflee
buug
buuhood
buul
buulallo
buulalloobid
buulallow
buulcaws
buulley¹
buulley²
buulo
buumbuuni
buumbuunin
buumbuunis
buun
buundo
buuni
buunshabbaxsan
buunshabbaxsanaan
buunshabbaxsanaansho
buunshabbixi
buunshabbixin
buunshabbixis
buunshe
buunsho
buunto
buuq¹
buuq²
buuq³
buuqid
buur
buur¹
buur²
buuran
buurasho
bųurasho
buurbuur
buure
buuri¹
buuri²
buurid
buurin
buuriyahan
buurnaan
buurnaansho
buurni
buuro
bųuro
buurqaaf
buur-sameyn
buuryaggoys
buuryaqab¹
buuryaqab²
buuryo
buuryo-goys
buus
buusan¹
buusan²
buusbuus
buushe
buusid
buusmid
buusnaan
buusnaansho
buux¹
buux²
buuxdhaaf¹
buuxdhaaf²
buuxdhaafi
buuxdhaafid
buuxdhaafin
buuxdhaafis
buuxi
buuxid
buuxin
buuxis
buuxiye
buuxsamid
buuxsan¹
buuxsan²
buuxsanaan
buuxsanaansho
buuxsasho
buuxso
buxuur
bu'yaro






