d
da'¹
da'²
daa
da'aa
da'aad
daab¹
daab²
daab³
daabac¹
daabac²
daabacaad
daabacan
daabacnaan
daabacnaansho
daabad
daabakhaad
daaban
daabaqaad
daabasho
daabax¹
daabax²
daabaxid
daabbad
daabbadqaad
daabbul
daabbulad
daabbule
daabbulid
daabdulle
daabece
daabicid
daabid
daabixid
daabnaan
daabnaansho
daabo
daabul
daabulid
daac¹
daac²
daacad
daacadnimo
daacadxumo
daacaqurmid
daacaqurun¹
daacaqurun²
daacasho
daaci¹
daaci²
daacid
daacin
daaco¹
daaco²
daacuf
daacufle
daacuun¹
daacuun²
daacuun-calooleed
daacuuncaloolo
daacwashiir¹
daacwashiir²
daacwashiirid
daad¹
daad²
daad³
daadad
daadasho
daaddah
daaddeg¹
daaddeg²
daaddeg³
daaddegid
daaddihi
daaddihin
daadduf¹
daadduf²
daaddufid
daadduumi
daadduumid
daadduumin
daadduun¹
daadduun²
daadduunshe
daadduunsii
daadduunsiin
daadgurayn
daadguree
daadi
daadid
daadin
daadis
daado
daadsan
daadsanaan
daadsanaansho
daaduf¹
daaduf²
daadufid
daadxoor
daaf
dąaf¹
dąaf²
dąaf³
daafac¹
daafac²
daafacaad
daafad
daafad-xagleed
daafi
daaficid
dąafid
daafkaddeeg¹
daafkaddeeg²
daafkaddeegid
daah¹
dąah¹
daah²
dąah²
daah³
dąahan
dąahasho
daahi
daahid
dąahid
daahiil¹
daahiil²
daahiilid
daahin
daahir¹
daahir²
daahiri
daahirid
daahirin
daahirnimo
dąahiro
daahiyad
dąahnaan
dąahnaansho
dąaho
daahsad
daahsan
daahsanaan
daahsanaansho
daahsasho
daahsi
daahso
daa'imi
daa'imid
daa'imin
daa'imis
daa'imo
daa'in¹
daa'in²
daa'iro
daaji
daajin
daajis
daakir
daakiraad
daakirid
daal
dąal¹
dąal²
dąal³
daalac¹
daalac²
daalacan
daalacasho
daalaco
daalalli
daalan
dąalan
daaldhe
daali
daalib¹
daalib²
daalibid
daalici
daalicid
daalicin
daalid
daalin
daalis
daallan
dąallan
daalli
daallin
daallinnimo
daaltir
daaltirad
daaltirasho
daaltirid
daaltiro
daamad
daamir
daammur
daan¹
daan²
daan³
daandaami
daandaamid
daandaamin
daandaan¹
daandaan²
daandaansad
daandaansan
daandaansanaan
daandaansanaansho
daandaansasho
daandaansi
daandaanso
daandheero
daanduumi
daanduumid
daanduumin
daanduun¹
daanduun²
daanduunshe
daanduunsii
daanduunsiin
daangee
daangeyn
daangeysad
daangeysasho
daangeysi
daangeyso
daango
daanguur
daani¹
daani²
daanka-hoose
daanshoo
daanshood
daanyeer
daanyeerad
daaq¹
daaq²
daaqad
daaqbarad
daaqbarasho
daaqbaro
daaqcune
daaqe
daaqgee
daaqgeyn
daaqi
daaqid
daaqo
daaqsad
daaqsasho
daaqsii
daaqsiin
daaqsiis
daaqsin
daaqso
daaqtag¹
daaqtag²
daaqtegid
dąar
daar¹
daar²
daarad
daaran¹
daaran²
daarasho
daardaar¹
daardaar²
daardaarasho
daardaarid
daardaaro
daardhuuq
daari
daarid
daaris
daarmid
daarnaan
daarnaansho
daarnow
daaro
daaruqayn
daaruqays
daaruqaysan
daaruqaysnaan
daaruqaysnaansho
daaruqe
daaruqee
daaruqoobid
daaruqow
daas
daasad
daash
daata
daawad
daawade
daawadhigad
daawadhigasho
daawadhigo
daawaley
daawasho
daawe
daawee
daaweyn
daaweynta-fiisikaad
daaweysad
daaweysasho
daaweysi
daaweysii
daaweysiin
daaweyso
daawo¹
dąawo¹
daawo²
dąawo²
daawoobid
daawow
daaxuur
daay
daayac¹
daayac²
daayacaad
daayeer
daayeerad
daayicid
daayimi
daayimid
daayimin
daayimis
daayin¹
daayin²
dab¹
dab²
dab³
daba-aal
daba-aallid
dabaadi
dabaakh¹
dabaakh²
dabaakhad
dabaakhid
dabaal
dabaalad
dabaalasho
dabaali
dabaalin
dabaaljoog
dabaaljoogle
dabaaljooglee
dabaaljoogleyn
dabaaljoogtee
dabaaljoogteyn
dabaaljoogto
dabaalo
dabaalsii
dabaalsiin
dabaan
dabaaq¹
dabaaq²
dabaaqad
dabaaqid
dabaax¹
dabaax²
dabaaxid
dabaaxsii
dabaaxsiin
dababbax¹
dababbax²
dababbixid
dabac¹
dabac²
dabacadde
dabacaddeeye
dabacase
dabacla'aan
dabacsamid
dabacsan¹
dabacsan²
dabacsanaan
dabacsanaansho
dabacsanow
dabaculus
dabaddookhaan
dabadeed
dabadhac
dabadhah
dabadheer
dabadheeraan
dabadheeraansho
dabadheerow
dabadheh
dabadhicid
dabadhihid
dabadhiig
dabadhilif¹
dabadhilif²
dabadhilifnimo
dabaduugato
dabafadal
dabafur¹
dabafur²
dabafurid
dabagaab
dabaggaalle
dabaggal¹
dabaggal²
dabaggee
dabaggeli
dabaggelid
dabaggelin
dabaggelis
dabaggelisayn
dabaggelisee
dabaggeyn
dabaggibin
dabaggorayee
dabaggorayeyn
dabaggorayo
dabaggur¹
dabaggur²
dabaggurid
daba-imow
dabajoog¹
dabajoog²
dabajoogid
daba-ka-eri
dabakafur
dabakafuul
dabakakiil¹
dabakakiil²
dabakakiilad
dabakakiilasho
dabakakiilid
dabakakiilo
dabakannaax
dabakannaaxid
dabakar¹
dabakar²
dabakarid
dabakarruub
dabakeen¹
dabakeen²
dabakeen³
dabakeenid
dabakeennimo
daballaab
dabammar¹
dabammar²
dabammari
dabammarid
dabammarin
dabammaryayn
dabammaryee
dabammaryo
daban
dabandeeb¹
dabandeeb²
dabandeebid
dabannashlayn
dabannashlee
daba-ordid
daba-orod
dabaq¹
dabaq²
dabaqaad¹
dabaqaad²
dabaqaadid
dabaqabad
dabaqabasho
dabaqabo
dabaqad
dabaqallooc
dabar¹
dabar²
dabar³
dabar-ayoon
dabargo'¹
dabargo'²
dabargo'an
dabargo'id
dabargo'naan
dabargo'naansho
dabargoo
dabargoyn
dabargoys
dabar-haydarojiin
dabar-lammaan
dabarriyaadle
dabarriyeedle
dabar-wadaag
dabasacle
dabashabeelis
dabashiid
dabasho
dabasoco
dabasocod
dabasocosho
dabataag
dabato
dabax¹
dabax²
dabaxad
dabaxadid
dabaxaw
dabaxir¹
dabaxir²
dabaxiran
dabaxirasho
dabaxirid
dabaxirnaan
dabaxirnaansho
dabaxiro
dabayaaqo
dabayl¹
dabayl²
dabaylayn
dabaylbadan
dabaylbadnaan
dabaylbadnaansho
dabaylbadni
dabayl-bataax
dabayl-cirifeed
dabaylee
dabayleed
dabayl-joogta
dabaylnuug
dabaylraac
dabaylraacid
dabaylwac
dabayood
dabayshad
dabayshi
dabaysho
dabbaabad
dabbaal¹
dabbaal²
dabbaal³
dabbaalad
dabbaalasho
dabbaaldeg¹
dabbaaldeg²
dabbaaldegid
dabbaali
dabbaalid
dabbaalin
dabbaaljoog
dabbaaljooglee
dabbaaljoogleyn
dabbaaljoogtee
dabbaaljoogteyn
dabbaaljoogto
dabbaalnimo
dabbaalo
dabbaalsii
dabbaalsiin
dabbaalsiis
dabbaan¹
dabbaan²
dabbaan³
dabbaanid
dabbaq
dabbaqid
dabbar
dabbaraale
dabbi
dabbin
dabbis
dabbisan
dabbisasho
dabbisnaan
dabbisnaansho
dabbiso
dabboojiye
dabcad
dabcan
dabci¹
dabci²
dabcid
dabcin
dabdamis
dabdheer
dabdhul
dabduug
dabeeb
dabeebad
dabeebasho
dabeebo
dabeec
dabeecad
dabeecadxumaan
dabeecadxumaansho
dabeecadxumi
dabeecadxumo
dabeecadxun
dabeeco
dabeer¹
dabeer²
dabeyl
dabeyl-kulul
dabgaab
dabid
dabiib¹
dabiib²
dabiibid
dabiicad
dabiici
dabin
dabindhuud
dabinqool
dabis
dabjoog
dable
dabley
dabnaan
dabnaansho
dabnaareed
dabniin
dabo¹
dabo²
dabool¹
dabool²
dabool³
daboolan¹
daboolan²
daboole
daboolid
daboolmid
daboolnaan
daboolnaansho
daboolo
dabqaad
dabqabad
dabqid
dabraac¹
dabraac²
dabraac³
dabraacid
dabradduul
dabramid
dabran¹
dabran²
dabranaan
dabranaansho
dabranow
dabrasho
dabrayn
dabree
dabrid¹
dabrid²
dabrin
dabro¹
dabro²
dabsaar
dabshid
dabsii
dabsiin
dabsoon
dabtuur
dabuub
dabuubad
dabuubasho
dabuubo
dabuuq
dabweyn
dabxid
dabyar
dac
dacaayad
dacaayadee
dacaayadeyn
dacaayo
dacal¹
dacal²
dacalmadow
dacar¹
dacar²
dacarayn
dacaraysan
dacaraysnaan
dacaraysnaansho
dacarbax¹
dacarbax²
dacarbixi
dacarbixid
dacarbixin
dacardhiig
dacaree
dacarfaal¹
dacarfaal²
dacarfaalid
dacarfal¹
dacarfal²
dacarfalid
dacaroo
dacarood
dacas¹
dacas²
dacati¹
dacati²
dacatin
dacatiyid
dacawamadow
dacawo
dacay¹
dacay²
dacay³
dacayan
dacayasho
dacayayn
dacayee
dacayeysan
dacayeysasho
dacayeysnaan
dacayeysnaansho
dacayeyso
dacayid
dacayn
dacaynaan
dacaynaansho
dacayo
dacdarrayn
dacdarraysan
dacdarraysnaan
dacdarraysnaansho
dacdarree
dacdarro
dacdarroobid
dacdarrow
dacee
dacgab¹
dacgab²
dacgabid
daciif¹
daciif²
daciifad
daciifi
daciifid
daciifin
daciifis
daciifsan
daciifsanaan
daciifsanaansho
dacjoog
dacluus¹
dacluus²
dacluusid
dacmad
dacwad
dacwashiir¹
dacwashiir²
dacwashiirid
dacwee
dacweyn
dacwi¹
dacwi²
dacwin
dacwiyid
dacwo
dacwoo
dacwood
dacyaal
dad
dąd¹
dąd²
dadaabee
dadaabeyn
dadaabeysad
dadaabeysasho
dadaabeysi
dadaabeyso
dadaal¹
dadaal²
dadaalid
dadab¹
dadab²
dadab³
dadabdhig¹
dadabdhig²
dadabdhigid
dadabgal¹
dadabgal²
dadabgelid
dadabhambaar
dadabsad
dadabsasho
dadabsi
dadabso
dadabxambaar¹
dadabxambaar²
dadabxambaarasho
dadabxambaarid
dadabxambaaro
dadabxambaarsasho
dadabxambaarso
dadan¹
dadan²
dadan³
dadban
dadbanaan
dadbanaansho
dadbid
dadcun
daddaab
daddaabbe
daddaabbee
daddaabeyn
daddaabeysan
daddaabeysnaan
daddaabeysnaansho
daddaami
daddaamin
daddaansad
daddaansasho
daddaansasho
daddaanso
daddan
daddanaan
daddanaansho
daddil
daddo
daddoo
daddoobid
daddood
daddow
dadduuc
dadduucid
dądid
dadlaq
dadliq
dadmid
dadnaan
dadnaansho
dadnimo
dadoobid
dadow
dadqaad
dadqaadnimo
dadqal
dadqalad
dadqaladnimo
dadqalatanimo
dadqalato
dadqalnimo
dadweyne
dadyahan
daf¹
daf²
daf³
dafaar
dafac
dafcad
dafdaf
dafdaflayn
dafdafle
dafdaflee
dafid
dafir¹
dafir²
dafiraad
dafirid
dafo
dafraan
dafshaan
daftar
dafto
da'fur¹
da'fur²
da'furid
dag
dagaag¹
dagaag²
dagaagid
dagaagnimo
dagaal¹
dagaal²
dagaal-aqoon
dagaalgal
dagaalgeli
dagaalgelin
dagaalgelis
dagaalid
dagaaljecel
dagaaljeclaan
dagaaljeclaansho
dagaaljooji
dagaaljoojin
dagaaljoojis
dagaallamid
dagaallan¹
dagaallan²
dagaaltoleed
dagaalyahan
dagaalyahannimo
dagaggoo
dagaggooyn
dagaggooys
dagan¹
dagan²
daganduug¹
daganduug²
daganduugid
dagarasoon
dagasho
dagati
dagid
dagiigaxasho
dagiigix
dagiigoxo
dagmid
dagnaan
dagnaansho
dago¹
dago²
daguug
daguugan
daguugid
daguugmid
dah
dahaar¹
dahaar²
dahaaran
dahaarid
dahaarnaan
dahaarnansho
dahab
dahabee
dahabeyn
dahabi
dahabo
dahan
dahar
dahasho
dahid
dahnaan
dahnaansho
daho
dahsoomid
dahsoon¹
dahsoon²
dahsoonaan
dahsoonaansho
dakaamid
dakaamo
dakaan¹
dakaan²
dakanaduug¹
dakanaduug²
dakanaduugid
dakane
dakano
dakar
dakayn
dakee
dakhaakhul¹
dakhaakhul²
dakhaakhulid
dakhal
dakhar¹
dakhar²
dakhli
dakhramid
dakhran¹
dakhran²
dakhranaan
dakhranaansho
dakhrid
dal¹
dal²
dala'¹
dala'²
dalaabid
dalaad
dalaadala
dalaaf¹
dalaaf²
dalaafid
dalaafsan
dalaafsanaan
dalaafsanaansho
dalaandal¹
dalaandal²
dalaandalan
dalaandalid
dalaandalnaan
dalaandalnaansho
dalaaq¹
dalaaq²
dalaaq³
dalaaqid
dalaaqo
dalaaw¹
dalaaw²
dalab¹
dalab²
dalab³
dalable
dalag
dalag-geddis
dalaggeddi
dalaggeddin
dalaggeddis
dalagle
dalalaco
dalalka-horumaray
dalalka-soo-koraya
dalambaabbi¹
dalambaabbi²
dalambaabbin
dalambaabbiyid
dalan
dalandal¹
dalandal²
dalandalid
dalandool¹
dalandool²
dalandoolid
dalandoolli
dalandoolyo
dalankac¹
dalankac²
dalankacayn
dalankacee
dalankacid
dalankicid
dalaq
dalaqoon
dala'sad
dala'sasho
dala'si
dala'so
dalaw¹
dalaw²
dalawi
dalayn
dalbajuuco
dalballaarsi
dalbasho
dalbid
dalbo¹
dalbo²
dalboole
dalcad
daldaalyayn
daldaalyee
daldaalyo
daldal¹
dąldal¹
daldal²
dąldal²
daldalaad
dąldalan
daldalan¹
daldalan²
daldalasho
daldalid
dąldalid
daldalmid
daldalnaan
daldalnaansho
daldalo
daldalool¹
daldalool²
daldalooli
daldaloolid
daldaloolin
daldaloolis
dalee
daleel
dalid
dal'id
daliig¹
daliig²
daliig³
daliigid
daliigtin
daliil¹
daliil²
daliili
daliilin
daliilnimo
daliiq
daliiqan
daliiqid
daliiqnaan
daliiqnaansho
daliishad
daliishasho
daliisho
daljecli
daljir
dalkucelin
dalkuggal
dalkujoog
dalkummar
dallaal
dąllaal¹
dąllaal²
dąllaalid
dallaalin
dallaallimayn
dallaallimee
dallaallimo
dallaalnimo
dąllaalnimo
dallaalo
dallaashad
dallaasho
dallaayad
dallac¹
dallac²
dallacaad
dallacbilaash
dallacsii
dallacsiin
dallacsiis
dallad
dal-lahelay
dallal¹
dallal²
dallalid
dallayn
dallaysasho
dallayso
dallee
dalleen
dalleensan
dalleensanaan
dalleensanaansho
dallici
dallicid
dallicin
dalluug
dalluun
dalmar
dalmarid
dalmid
dalool¹
dalool²
dalool³
dalooli
daloolid
daloolin
daloolin-cad-hunguri
dalooliye
dalooshamid
dalooshan¹
dalooshan²
dalooshnaan
dalooshnaansho
dalow¹
dalow²
dalqad
dalqami
dalqamid
dalqamin
dalqamiso
dalqan¹
dalqan²
dalqe
dalqo
dalqoholac
dalsan
daltabyeysan
daltabyeysnaan
daltabyeysnaansho
daltabyo
daltabyoo
daltabyood
dalwi
dalwin
dalxiis¹
dalxiis²
dalxiise
dalxiisid
dalxiisnimo
dalyaqaan
dam
damaaci
damaan
damaashaad¹
damaashaad²
damaashaadid
damac¹
damac²
damacsan
damacsanaan
damacsanaansho
damal
damaq
dambaab¹
dambaab²
dambaabas¹
dambaabas²
dambaabasad
dambaabasasho
dambaabasid
dambaabaso
dambaabburo
dambaabi
dambaabid
dambaabin
dambaabis
dambaabsii
dambaabsiin
dambaaburo
dambaaji
dambaajin
dambacaad
dambar
dambari
dambarin
dambaris
dambarsad
dambarsame
dambarsasho
dambarsi
dambarso
dambas
dambasame
dambasayn
dambasee
dambasoobid
dambasow
dambasqaad
dambasyaal
dambaxir¹
dambaxir²
dambaxiran
dambaxirid
dambaxirnaan
dambaxirnaansho
dambayn
dambaysii
dambaysiin
dambe
dambee
dambeed
dambeeto
dambi
dambidhaaf¹
dambidhaaf²
dambidhaafid
dambiil
dambiilannimo
dambiile
dambitir¹
dambitir²
dambitirid
dambow
damci
damcid
damcin
damcis
damdaguugan
dameer¹
dameer²
dameerabilayn
dameeradhaglayn
dameeradhaglee
dameeradhuuji
dameeradhuujin
dameeradhuujo
dameerajoogeen
dameerdibadeed
dameerfarow
dameerhogo
dameerjoog
dameero
dameerow
dami
damid
dąmiin
damiin¹
damiin²
damiinad¹
damiinad²
damiinid
damiinnimo
dąmiinnimo
damiino
damiir
damin
damis
dammaad¹
dammaad²
dammaadid
dammaadsan
dammaadsanaan
dammaadsanaansho
dammaan
dammaanad¹
dammaanad²
dammaanasho
dammaano
damman
dammanaan
dammanaansho
damme
dammeer¹
dammeer²
dąmmiin
dammiin¹
dammiin²
dammiinad¹
dammiinad²
dammiinasho
dammiinid
dammiinnimo
dąmmiinnimo
dammiino
dammooti
damqad
damqasho
damqi
damqid
damqin
damqo
damrad
damradayn
damradee
damuuji
damuujin
damuuqsad
damuuqsasho
damuuqsi
damuuqso
dan
dąn
danaag¹
danaag²
danaagax
danaani
dąnaani¹
durruqaan.
dąnaani²
danaanin
danaano
danaanyid
danab¹
danab²
danabayn
danabaysan
danabaysnaan
danabaysnaansho
danabee
danabneg
danabnimo
danaboobid
danabow
danab-soocid
danaf
danagax
danan²
dananid
danaq
danayn
danaysad
danaysan
danaysasho
danaysi
danaysnaan
danaysnaansho
danayso
danayste
danbiil
dandaami
dandaamin
dąndaan
dandaansad
dandaansasho
dandaanso
dandarrayn
dandarraysan
dandarraysnaan
dandarraysnaansho
dandarree
dandarro
danduul
danee
danfadhi
danfariisad
danfariisasho
danfariisi¹
danfariisi²
danfariiso
dangalo
dangaraaro
dangaraaroo
dangaraarood
dangee
dangeyn
dangeys
dangeysan
dangeysnaan
dangeysnaansho
dangiig¹
dangiig²
dangiigid
dangiigsad
dangiigsasho
dangiigsi
dangiigso
dangoobid
dangow
dani¹
dani²
danjir
danjire
danla'aan
danla'aansho
dan-lahelay
dannaago
dannaanni²
dannaanniyid
dannabayn
dannabe
dannabee
dannabo
danni¹
danni²
danniyid
dano
danqaab¹
danqaab²
danqaabid
danqaabo
danqaare
danqaaro
danqad
danqasho
danqi
danqid
danqin
danqo
dansan
dansanaan
dansanaansho
danseeg¹
danseeg²
danseegid
danseeji
danseejin
danseejis
dansheegad
dansheegasho
dansheego
danwadaag
danyar¹
danyar²
danyaraan
danyari
danyaro
da'oobid
da'ow
daqan
daqaqamid
daqaqan¹
daqaqan²
daqar¹
daqar²
daqarasoon
daqarsoon
daqay
daqiiji
daqiijin
daqiiq
daqiiqad
daqiiqo
daqmad
daqmasho
daqmi
daqmid
daqmin
daqmo
daqnad
daqnasho
daqni
daqnid
daqnin
daqno
daqramid
daqran¹
daqran²
daqranaan
daqranaansho
daqrid
daqsi
dar¹
dar²
dar³
daraad
daraaf
daraasad
daraaso
daraawiish
darab¹
darab²
darab³
darabdhaqasho
darabdhaqo
darabqaadasho
darabqaado
daradhig¹
daradhig²
daraf
daragad
darajee
darajeyn
darajo¹
darajo²
dar-alla
daran¹
daran²
daran³
darancad
darandawaco
darandoorri¹
darandoorri²
darandoorrin
darandoorris
darandoorriyid
darangee
darangeel
darangeyn
darankutaal
daranmadow
daranyo
daranyoo
daranyood
darar¹
darar²
darari
dararid
dararin
dararsasho
dararso
daras
darasho
darato
darax
daray
darayn
darbaal
darbad
darbadayn
darbadee
darban
darbanaan
darbanaansho
darbasho
darbayn
darbee
darbi¹
darbi²
darbid
darbin
darbo¹
darbo²
darbuugad
darbuush
dardaaran¹
dardaaran²
dardaarmid
dardaarweri
dardaarwerin
dardaarweris
dardar¹
dardar²
dardar³
dardaran¹
dardaran²
dardarid
dardarmid
dardarnaan
dardarnaansho
dardarsamid
dardarsan
dardhaaf¹
dardhaaf²
dardhaafi
dardhaafid
dardhaafin
dardhaafis
dardhad
dardhasho
dardhaysan
dardhaysnaan
dardhaysnaansho
dardho¹
dardho²
daree
dareeme
dareeme-kiimikaad
dareemid
dareemo
dareen¹
dareen²
dareen-indheed
dareensad
dareensan
dareensanaan
dareensanaansho
dareensasho
dareensi
dareensii
dareensiin
dareenso
dareenwade
dareen-xanuun
dareer¹
dareer²
dareeri
dareerid
dareerin¹
dareerin²
dareerin-aritmatig
dareerin-aroorta
dareerin-joometeri
dareerin-kalahaad
dareerin-koobane
dareerin-makoobane
dareeris¹
dareeris²
dareerka-dhiigga
dareersad
dareersasho
dareerso
dareerto
dareewal
darfac
darfi
darfiyid
darfooley
dargad
dargashabeel
darib
darid
dariiq
dariiqo
dariir
dariiran
dariirid
dariirnaan
dariirnaansho
dariishad
daris
darmaan¹
darmaan²
darmad¹
darmad²
darmasho
darmi
darmid
darmin
darmo
darnaan
darnaansho
darni
darno
daro¹
daro²
daroof¹
daroof²
daroofid
daroori¹
daroori²
darooryaamid
darooryaan¹
darooryaan²
darooryid
darraabid
darraad
darraw¹
darraw²
darraysad
darraysasho
darraysi
darrayso
darrib
darribid
darro
darroor¹
darroor²
darroori
darroorid
darroorin
darrow¹
darrow²
darsad
darsamid
darsan¹
darsan²
darsan³
darsanaan
darsanaansho
darsasho
darshad
darsi
darsin
darso
daruur¹
daruur²
daruur³
daruur4
daruurad
daruuran
daruurasho
daruurayn
daruuraysasho
daruurayso
daruur-buureed
daruuree
daruur-hoose
daruuri¹
daruuri²
daruurid
daruurin
daruurnaan
daruurnaansho
daruurnugul
daruuro¹
daruuro²
darwiish
darxad
darxadee
darxumayn
darxumaysad
darxumaysan
darxumaysasho
darxumaysi
darxumaysnaan
darxumaysnaansho
darxumayso
darxumee
darxumi
darxumo
daryaamid
daryaan¹
daryaan²
daryeel¹
daryeel²
daryeelid
daso
dastuur
daw¹
daw²
daw³
dawaad
dawaaf¹
dawaaf²
dawaafi
dawaafid
dawaafin
dawaafsii
dawaafsiin
dawaali
dawaansad
dawaansasho
dawaansi
dawaanso
dawaaqi
dawaar
dawaarad
dawaarle
dawaaro
dawaarwale
dawac
dawacamadow
dawaco
dawakh¹
dawakh²
dawakhaad
dawakhi
dawakhid
dawakhin
dawakhsan
dawakhsanaan
dawakhsanaansho
dawan
dawar¹
dawar²
dawari
dawarid
dawarin
dawarsad
dawarsasho
dawarsi
dawarso
dawax
dawaxaar
dawdabi
dawdabin
dawdar¹
dawdar²
dawdaran
dawdarid
dawdarnaan
dawdarnaansho
dawdarni
dawdarnimo
dawdarno
dawdarroo
dawdarrood
dawdawle
dawdawlee
dawdawleyn
dawee
daweri
dawerin
daweyn
da'weyn
da'weynaan
da'weynaansho
da'weyni
daweysad
daweysasho
daweysi
daweysii
daweysiin
daweyso
dawggal¹
dawggal²
dawggelid
dawi
dawikhi
dawikhid
dawikhin
dawin
dawis
dawixid
dawlad
dawlad-dastuuri-ah
dawladnimo
dawli¹
dawli²
dawliil
dawlin
dawlis
dawlisgoys
dawo
dawoobid
dawo-suuxin
dawow
dawr¹
dawr²
dawre
dawri
dawrid
dawrin
daxal
daxalaysad
daxalaysasho
daxalaysi
daxalayso
day
dayaafad
dayaafadi
dayaafadin
dayaamid
dayaan¹
dayaan²
dayaan³
dayaarad
dayac¹
dayac²
dayacan
dayacid
dayacnaan
dayacnaansho
dayacsan
dayacsanaan
dayacsanaansho
dayactir¹
dayactir²
dayactiran
dayactirid
dayactirnaan
dayactirnaansho
da'yar¹
da'yar²
da'yaraan
da'yaraansho
da'yari
da'yaro
dayasho
dayax
dayaxgacmeed¹
dayaxgacmeed²
dayaxmadoobaad¹
dayaxmadoobaad²
daydo
dayeysan
dayeysii
dayeysiin
dayeysnaan
dayeysnaansho
dayib
dayicid
dayid
daymo
daymoo
daymood
dayn
daynaamiko
daynabo
dayo¹
dayo²
dayoobid
dayow¹
dayow²
dayr
dayradhaaf
dayrcad
dayrdhal
dayri
dayrin
dayris
dayro
dayrqin
dayrsad
dayrsan
dayrsanaan
dayrsanaansho
dayrsasho
dayrsi
dayrsimo
dayrso
dayuurad
dayuus
deb
debac¹
debac²
debacsamid
debacsan¹
debacsan²
debacsanaan
debacsanaansho
debacsanow
debbir
debbiraad
debbirid
debci
debcid
debcin
debdemis
debec¹
debec²
debecla'aan
debecsamid
debecsan¹
debecsan²
debecsanaan
debecsanaansho
debecsanow
debin
debingendi
debis
debrid
debsaar
debweyn
ded¹
ded²
dedaal¹
dedaal²
dedaalid
dedan¹
dedan²
dedan³
deddan
deddanaan
deddanaansho
deddatir¹
deddatir²
deddatirid
deddeg¹
deddeg²
deddegid
deddegsan
deddegsanaan
deddegsanaansho
deddegsiinyo
deddeji
deddejin
deddejis
deddo
deddoo
deddoobid
deddood
deddow
dedeb
dedid
dedmid
dednaan
dednaansho
dee
deeb¹
deeb²
deebaaji
deebaan
deebaani
deebad
deebi
deebin
deebsan
deebsanaan
deebsanaansho
deedifee
deedifeyn
deedifo
deef
deeg¹
deeg³
deegaamee
deegaameyn
deegaamin
deegaan¹
deegaan²
deegaanraac
deegad
deegid
deel
deelqaaf¹
deelqaaf²
deelqaafi
deelqaafid
deelqaafin
deelraac
deen
deensasho
deenso
deeq¹
deeq²
deeqdaran
deeqdarnaan
deeqdarnaansho
deeqdarno
deeqe
deeqid
deeqlay
deeqle
deeqsi
deeqsii
deeqsiin
deeqsiis
deeqsinnimo
deeqtoomid
deeqtoon¹
deeqtoon²
deeqtoonaan
deeqtoonaansho
deeqtoonow
deer
deero
deewali
deex
deexad
deexasho
deexguur
deexo
deg¹
deg²
degaamee
degaameyn
degaami
degaan
degaan-habboon
degaandeg
degaansho
degad
degadduub
degalbaaris
degasho
degdeg²
degdegid
degdegsan
degdegsanaan
degdegsanaansho
degdegsiinyo
degdeji
degdejin
degdejis
degeb
degeltir
degeltirid
deggan
degganaan
degganaansho
degganow
degid
degis
degitaan
degmo
dego
degsaar
degsan
degsanaan
degsanaansho
degsasho
degsiimo
degso
deji
dejin
dejis
deked
deldel¹
deldel²
deldelaad
deldelan
deldelid
deldelnaan
deldelnaansho
deleb
deli
delidhac¹
delidhac²
delidhicid
delleg
dellegan
dellegid
dellegnaan
dellegnaansho
delo
delta
deltooyd
dembaab¹
dembaab²
dembaabi
dembaabid
dembaabin
dembaabsii
dembaabsiin
dembaaji
dembaajin
dembi
dembidhaaf¹
dembidhaaf²
dembidhaafid
dembiilannimo
dembiile
dembitir¹
dembitir²
dembitirid
dementiya
demi
demid
demin
demis
demokaraati
demokarasiya
demokarasiyad
den
denbaab¹
denbaab²
denbaabid
deni
densan
densanaan
densanaansho
derbi
derder¹
derder²
derderan¹
derderan²
derderid
derdermid
derdernaan
derdernaansho
dereb
dereg
derejee
derejeyn
derejo
derged
deri
deridhacyayn
deridhacyee
derin
deris¹
deris²
deris³
deriskunnool¹
deriskunnool²
deriskunnoole
derisnimo
dermad
dermo
derrin
dersi
dersid
dersin
desibel
dewer¹
dewer²
deweri
dewerid
dewerin
dewersad
dewersasho
dewersi
dewerso
deyd
deyid
deyl
deylan
deylnaan
deylnaansho
deylo
deylraac
deyman
deymbax¹
deymbax²
deymbixid
deymbixin
deymi
deymin
deymis
deymoobid
deymow
deyn¹
deyn²
deynhilato
deyni
deynin
deynle
deynlow
deynmid
deynoobid
deynow
deynqabe
deynsad
deynsasho
deynso
deyr
deyraan
deyradhaaf
deys
deysasho
deyso
dib¹
dib²
dibaaji
dibaakh²
dibaakhid
dibaaq
dibaax
dibaaxasho
dibaaxi
dibaaxin
dibaaxis¹
dibaaxis²
dibaaxo
dibad
dibadbax¹
dibadbax²
dibadbixid
dibadjiif
dibadjoog
dibadyaal
dibadyaaloobid
dibadyaalow
dibbaaqo
dibbad
dibbasho
dibbir¹
dibbir²
dibbiraysan
dibbiraysnaan
dibbiraysnaansho
dibbiri
dibbirid
dibbirin
dibbirnimo
dibbiro
dibbirsamid
dibbirsan¹
dibbirsan²
dibbirsanaan
dibbirsanaansho
dibbiryaysan
dibbiryaysnaan
dibbiryaysnaansho
dibbiryo
dibbiryoo
dibbiryood
dibbo
dibbood¹
dibbood²
dibboodi
dibboodid
dibboodin
dibdhac¹
dibdhac²
dibdhicid
dibed
dibi
dibijaano
dibin
dibindaabyee
dibindaabyeyn
dibindaabyo
dibin-siilka
dibir
dįbir
dibirrooti¹
dibirrooti²
dibirrootiyid
dibiyee
dibiyeyn
dibiyeysan
dibiyeysnaan
dibiyeysnaansho
dibiyo
dibjir¹
dibjir²
dibjirid
dibjirnimo
dibjiryo
dibkabe
dibkannaax
dibkannaaxid
dibla'aan
diblad
diblo
diblomaasi
diblomaasiyad
dibqallooc
dibri
dibrin
dibtaag
dibudday
dibudhac
dibudhicid
dibudhicis
dibudhig
dibudhigid
dibudhisid
dibuggurad
dibuggurasho
dibuggurayn
dibugguree
dibugguro
dibugguryee
dibugguryeyn
dibugguryo
dibuhabayn
dibuhabayn-hiddoside
dibunoqosho
dibuquudsi
dibusocod
dibusocodnimo
dibusoonoolaansho
dibusoonoolayn
dibutaati
dibuxorayn
dicaayad
dicaayadee
dicaayadeyn
dicaayo
dicin
did
diddimi
diddimid
diddimin
diddimis
diddin¹
diddin²
diddinsad
diddinsasho
diddinsi
diddinso
didi
didib¹
didib²
didid
didin
didmo
didsan
didsanaan
didsanaansho
didsasho
didso
difaac¹
difaac²
difaacid
difji
difjin
difqi
difqin
dig¹
dig²
digaag
digad
digaggub²
digaggubid
digarrogad
digarrogasho
digarrogo
digasho
digaxaar
digdhaw¹
digdhaw²
digdhebid
digdig
digdigle
digdigo
digid
digiigaxasho
digiigix
digiigixo
digiiran
digir¹
digir²
digirin
digirro
diglayn
digle
diglee
diglow
digniin-kamadambeys-ah
digniin¹
digniin²
digniinsho
digo¹
digo²
digoo
digood
digri¹
digri²
digrii¹
digrii²
digriyid
digsi
digtoon
digtoonaan
digtoonaansho
digtoonow
dihasho
dihin
dihnaan
dihnaansho
diho
di'i
diib
diibaaji
diibsad
diibsasho
diibsi
diibso
di'id
dįid
diid¹
diid²
dįiddan
dįiddanaan
dįiddanaansho
dįiddo
dįiddooy
dįiddow
dįidid
diidid¹
diidid²
dįidis
dįidmo
diidsan
dįidsan
diidsanaan
dįidsanaan
diidsanaansho
dįidsanaansho
dįidsii
dįidsiin
diif
dįif
diifayn
diifaysan
diifaysnaan
diifaysnaansho
diifee
dįifsasho
dįifso
diig
diigaanyo
diihaal¹
diihaal²
diihaalid
diil¹
diil²
diilabadan
diilabadnaan
diilabadnaansho
diilaley
diilalyo
diilan¹
diilan²
diilasho
diilid
diilimayn
diilimee
diilin
diillimayn
diillimee
diillin
diillincaanood
diilmid
diilnaan
diilnaansho
diilo
diimbiyood
diimid
diimis
diimmoon
diimmoonaan
diimmoonaansho
diimmooni
di'in
diin¹
diin²
diin³
diinceelaad
diindarro
diindiimid
dįindiin
diindiin¹
diindiin²
diin-fedeysi
diin-fidiye
diinla'aan
diinlaawe
diinley
diinli'i
diinta-Budhiismaha
diiq¹
diiq²
diiq³
diiqad
diiqadayn
diiqadee
diiqalyayn
diiqalyee
diiqalyeyn
diiqalyo
diiqayn
diiqee
diiqid
diiqlay
diiqo
diiqoo
diiqood
diiqyeer
diir¹
dįir¹
diir²
dįir²
diir³
dįir³
diirad¹
diirad²
diiradayn
diiradeeye
dįiran¹
dįiran²
diirane
diirane-koowaad
dįirasho
diirdiir¹
diirdiir²
diirdiirran
diirdiirranaan
diirdiirranaansho
diirdiir-xariireed
diirfin
diir-hoose
diiri
diirid
dįirid
diirin
diirinle
dįiris
diiris¹
diiris²
dįirmid
dįirnaan
dįirnaansho
diirnax¹
diirnax²
diirnixid
dįiro
diirran¹
diirran²
diirranaan
diirranaansho
diirri
diirrimaad
diirrin
diirris
diirsad
diirsasho
diirsi
diirsimaad
diirso
diis
di'is
diisan
diiseembar
diisid
diisnaan
diisnaansho
di'itaan
diiwaan
diiwaanee
diiwaaneyn
diiwaangeli
diiwaangelin
diiwaanhaye
diiwaanhayn
diiwaani
diiwaanin
diiwaaniye
dikaamid
dikaan¹
dikaan²
dikri¹
dikri²
dikriyid
diktatoor
diktatooriya
diktatooriyad
diktatoornimo
dil¹
dil²
dilaa
dilalyo
dilan¹
dilan²
dilan³
dildil
dildillaac¹
dildillaac²
dildillaac³
dildillaaca-waaberi
dildillaaci
dildillaacid
dildillaacin
dildillaacsan
dildillaacsanaan
dildillaacsanaansho
dile
dili
dilid
dililiqo
dilindillayn
dilindillee
dilindillo
dilindilqo
diliq¹
diliq²
dillaac¹
dillaac²
dillaaci
dillaacid
dillaacin
dillaacsad
dillaacsan
dillaacsanaan
dillaacsanaansho
dillaacsasho
dillaacsi
dillaacso
dillaal¹
dillaal²
dillaalid
dillaalnimo
dillaamid
dillaamo
dillaan¹
dillaan²
dilmid
dilnaan
dilnaansho
dilniin
dilqid
dimcad
dimmi
dimoqaraadi
dimoqraadinnimo
dimoqraadiyad
dimoqraadiyayn
dimoqraadiyee
dimuqraadi
dimuqraadinnimo
dimuqraadiyad
dimuqraadiyee
dimuqraadiyeyn
dinaamiko
dinaas
dincad
dindimi
dindimid
dindimin
dindimis
dindin¹
dindin²
dindinsad
dindinsasho
dindinsi
dindinso
dingax
dingiig¹
dingiig²
dingiigid
dingiigsad
dingiigsasho
dingiigsi
dingiigso
diniimid
diniin¹
diniin²
dinnaago
dinnaaho
dinnaax
dinnad
dinnadbadeed
dinnayn
dinnee
dinno
dinqi
dinqin
diq¹
diq²
diqaysan
diqaysnaan
diqaysnaansho
diqdiq¹
diqdiq²
diqdiqasho
diqdiqayn
diqdiqee
diqdiqo¹
diqdiqo²
diqid
diqo
diqoo
diqoobid
diqood
diqow¹
diqow²
diqsi
dir¹
dir²
dir³
dir4
diraac
diraacasho
diraacgood
diraaco
diraacsad
diraacsasho
diraacso
diraal
diraaso
diraddiraale
diraddirayn
diraddire
diraddiree
diraddiro
diraddiroole
diran
dirayn
dire
direewal
direys
dirfac
dirgasho
dirgo
diric¹
diric²
diricnimo
dirid
diriq
diriqsad
diriqsasho
diriqsi
diriqso
dįrir
dirir¹
dirir²
dįrircawleed
dirirday
dįriri
diririd
dįririn
dįrirsagaaro
dirirsan
dirirsanaan
dirirsanaansho
dirirsii
dirirsiin
diris
dirnaan
dirnaansho
diro
dirqi¹
dirqi²
dirqin
dirqis
dirri
dirrow
dirsasho
dirso
dirxi
diryaamid
diryaan¹
diryaan²
disembar
dishibiliin
disti
distuur
dix
dixad
dixasho
dixi
dixiri
dixo
dixri
diyaad
diyaafad
diyaafadi
diyaafadin
diyaaj
diyaaleetiko
diyaalegtiko
diyaamid
diyaan¹
diyaan²
diyaar
diyaarad
diyaargarayn
diyaargaraysasho
diyaargarayso
diyaargaree
diyaargaroobid
diyaargarow¹
diyaargarow²
diyaari
diyaarin
diyaarsan
diyaarsanaan
diyaarsanaansho
diyaarsasho
diyaarso
diyeenjeefaloon
diyo
diyuuteeriyam
doc
docfaruur¹
docfaruur²
docfaruurid
dockayeer
doco
docogeysi
docol
docosho
dogob
dogox
doh
dohasho
doho
dokhosh
doktoor
doktoornimo
dokumenti
dolmayt
doob¹
doob²
doobbadillaacsad
doobbadillaacsasho
doobbadillaacsi
doobbadillaacso
doobbagoray
doobbashiid
doobbi¹
doobbi²
doobbin
doobbo
doobbogoray
doobdillaacsad
doobdillaacsasho
doobdillaacsi
doobdillaacso
doobgaras
doobgiris
doobgoray
doobguun
doobi¹
doobi²
doobir
doobke
doobshiid
doobte
dooc
doocdooci
doocdoocin
dooci
doocin
dǫod
dood¹
dood²
dood³
doodaa
dood-cilmiyeed
dooddi¹
dooddi²
dooddiyid
doode
doodid
doodis
doofaar
doofaarad
doofaarnimo
doofil
doog¹
doog²
doog³
doogaad
doogad
doogasho
doogayn
doogdhabasho
doogdhabo
doogdhaw
doogee
doogid
doogo
doogoobid
doogow
doograac¹
doograac²
doograacid
doograacis
doogsad
doogsasho
doogsimaad
doogsimo
doogsin
doogso
dooh
doohad
dooh-bibanji
dooh-bibiish
dooh-bicaddaan
dooh-bijoohaar
dooh-bisaliim
dooh-bishiish
dooh-biyeeg
dooji
doojin
doojis
dool¹
dool²
dool³
doolaal
doolaalo
doollar
doolli
doollo
doolo
doolshe
doomaar
doomayn
doombir
doomee
doomid
doomo
dǫon
doon¹
doon²
doon³
doonasho
doondoon¹
doondoon²
doondoonid
doonfaar
doonfaarad
doonge
doonid
doonis
doonnan
doonnanaan
doonnanaansho
doonni
doono
doonyeysad
doonyeysan
doonyeysasho
doonyeysi
doonyeysnaan
doonyeysnaansho
doonyeyso
doonyo
dooq
dooqlaawe
dǫor
door¹
door²
doorad
dooradduur
dooranuug
doorashada
doorasho
dooray
doorbid
doorbidid
dǫori
doori¹
doori²
dooribeyn
doorid
doorin
dǫorin
doorinuug
dooris
dǫoris
dooriso
dooritus
dooro¹
dooro²
doorroone
doorsad
doorsamid
doorsan¹
doorsan²
doorsanaan
doorsanaansho
doorsasho
doorshaan
doorshe
doorsi
doorso
doorsoome
doorsoome-ku-xiran
doorsoome-madaxbannaan
doorsoomid
doorsoon¹
doorsoon²
doorsoon³
doorsoonaan
doorsoonaansho
doorte
doosh
dooshi
doox¹
doox²
dooxada-rift
dooxan¹
dooxan²
dooxane
dooxato
dooxid
dooxmid
dooxnaan
dooxnaansho
dooxo¹
dooxo²
dooxo-daldalan
dooy
dooyee
dooyeyn
dooyeys
dooyo
doqon¹
doqon²
doqondiidsii
doqondiidsiin
doqonniimo
doqonnimo
doqonoobid
doqonow
doqosh
doro
dorraad
dorraato
dotoor
dotoornimo
dow
dowddar¹
dowddar²
dowddarid
dowddarnimo
dowlad
dowladnimo
dowli¹
dowli²
dowlin
dowlis
dowlodamiin
dowr¹
dowr²
dowrid
dowsar
doxore
du'
dub¹
dųb¹
dub²
dųb²
dubaalad
dubaale
dubaaq
dubaaqayn
dubaaqee
dubaaqo
dubaarad
dubaax
dubaaxasho
dubaaxi
dubaaxin
dubaaxis¹
dubaaxis²
dubaaxo
duban
dųban¹
dųban²
dųbasho
dubayo
dubayoobid
dubayow
dubbad¹
dubbad²
dubbadhac¹
dubbadhac²
dubbadhicid
dubbarrid
dubbarridid
dubbasho
dubbe
dubbee
dubbeyn
dubbeys
dubbeysan
dubbeysnaan
dubbeysnaansho
dubbo
dubbur
dubburyo
dubburyoo
dubburyood
dubdhacsi
dubdhexaad
dubduleed
dube
dubeer
dųbid
dublad
dublo
dųbmid
dųbnaan
dųbnaansho
dubnad
dubnax¹
dubnax²
dubnixid
dųbo
dub-sare
dub-soohdin
dubudhac
dubuq
ducaqabe
ducasho
ducee
duceyn
duceysad
duceysan
duceysasho
duceysi
duceysnaan
duceysnaansho
duceyso
ducfi
duco¹
duco²
ducuumasho
ducuumo
dud¹
dųd¹
dud²
dųd²
duddo
duddumagale
duddumo
duddumo-yulug
duddun
dudduub
dudduubid
dudi
dudid
dųdid
dudin
dudis¹
dudis²
dųdmo
dudmo²
dudsan
dųdsan
dudsanaan
dųdsanaan
dudsanaansho
dųdsanaansho
dudsasho
dudso
duf
dųf
dufan
dufandawaco
dufandhawr
dufantirad
dufantirasho
dufantire
dufantiro
dufantiryo
dufayn
dufaysan
dufaysnaan
dufaysnaansho
dufee
dufle
dufni
dufnin
dufoobid
dufow¹
dufow²
dug
dųg¹
dųg²
dugaag
dugaagad
dugaagnimo
dugaagoobid
dugaagow
dugdhabayn
dugdhabee
dugdhabo
dugey
duggaafad
duggaal¹
duggaal²
duggaali
duggaalid
duggaalin
duggaalis
duggaalsan
duggaalsanaan
duggaalsanaansho
duggadhaanis
dųgid
dugle
dugsad
dugsasho
dugsi
dugsii
dugsiin
dugsiis
dugsiley
dugso
dugsoon
dugsoonaan
dugsoonaansho
dugul
duhur
duhur-kulul
duhurnimo
duhursasho
duhurso
duji
dujin
dujis
dukaafad
dukaan
dukaanle
dukad
dukhun
dukhuun
duko
dųl
dul¹
dul²
dulaandul
dulalaati
dulan¹
dulan²
dulbaa'i
dulbaax
dulbadi
dulbeel¹
dulbeel²
dulbeelid
dulcayaar
dulcayaarid
dulci
dulcin
duldhig
duldhigid
duldiir
dulduleel¹
dulduleel²
dulduleeli
dulduleelid
dulduleelin
dulduleelis
duleed
duleedi
duleedin
duleel¹
duleel²
duleeli
duleelid
duleelin
duleeliye
duleeshamid
duleeshan¹
duleeshan²
duleeshnaan
duleeshnaansho
dulfadhi
dulfadhin
dulfadhiyid
dulin
dulin-duleed
dulin-gudeed
dulinnimo
duljoog
duljoogid
dulkahoor¹
dulkahoor²
dulkahoorid
dulkumalable
dullaal¹
dullaal²
dullaalid
dullaalnimo
dullaamid
dullaamo
dullaan¹
dullaan²
dullee
dulleyn
dulleysasho
dulleysi
dulleyso
dulli
dullinimo
dulloobid
dullow¹
dullow²
dulmadow
dulman
dulmanaan
dulmanaansho
dulmar¹
dulmar²
dulmarid
dulmeeran
dulmi¹
dulmi²
dulmici
dulmid
dulmidiid
dulmifiir
dulmiley
dulmilow
dulmin
dulmisan
dulmisanaan
dulmisanaansho
dulmiyid
dulnool
dulnoolaan
dulnoolaansho
dul-ordid
dul-orod
dulqaad
dulqaadad
dulqaadasho
dulqaado
dulqami
dulqamid
dulqamin
dulqan¹
dulqan²
dulsaar¹
dulsaar²
dulsaar³
dulsaaran¹
dulsaaran²
dulsaarid
dulsaarmid
dulsaarnaan
dulsaarnaansho
dulsaaro
dulsabbayn
dulsabbee
duluble
duluc¹
duluc²
dulucsan
dulucsanaan
dulucsanaansho
duluf
dulufaaq
dulufaaqid
dulugle
duluglee
dulugleyn
dululaati
dululub
dulun¹
dulun²
dulundulcee
dulundulceyn
dulundulceys
dulundulceysii
dulundulceysiin
dulundulco
dulxawaaree
dulxawaareyn
dulxumo
dulxun
dulyar
dulyaraan
dulyaraansho
dulyari
dulyaro
dulyeelad
dulyeelasho
dulyeelo
dum(ø)id
dumaa
dumaal¹
dumaal²
dumaalid
dumaalis
dumaashi¹
dumaashi²
duman¹
duman²
dumar
dumarnimo
dumayn
dumays
dumbul
dumbulukh
dumbuluq
dumbuq
dumee
dumi
dumid
dųmid
dumin
dųmis
dumis¹
dumis²
dummad
dumnaan
dumnaansho
dumnad
dun¹
dųn¹
dun²
dųn²
dundumid
dundumo
dundumo-yulug
dundun¹
dundun²
dundun³
dundun4
duni
dunida-saddexaad
dunji
dunmid
dunnayn
dunnee
dunno
dunqaare
dunqaaree
dunqaareyn
dunqaaro
dunsan
dunsanaan
dunsanaansho
dunuunuc¹
dunuunuc²
dunuunucid
dunyir
duq¹
duq²
duq³
duqee
duqey
duqeyn
duqeyti
duqlaal
duqlaalid
duqnimo
duqoobid
duqow¹
duqow²
duqow³
duqsi
duqus
duqush
dur
dųr
duraab¹
duraab²
duraabid
duray
durba
durbaan
durbaansan
durbaansanaan
durbaansanaansho
durbadiiba
durdur¹
durdur²
durduri
dųrduri
durdurid
durdurin
dųrdurin
durduris
dųrduris
durdur-kulul
dųrduro
durduur¹
durduur²
durduurasho
durduurid
durduuro
dure
dureeme
dureemo
dureer¹
dureer²
dureeri
dureerid
dureerin
dureersad
dureersasho
dureerso
durey
dureysan
dureysnaan
dureysnaansho
durgeyshabeel
durgi
durgin
durgis
duri¹
duri²
durid
duriyad
durji
durjid
durjin
durjis
durjisad
durjisan
durjisasho
durjisi
durjisnaan
durjisnaansho
durjiso
durki
durkid
durkin
durkis
durmad
durqi
durqid
durqin
durqis¹
durqis²
durqun
durraamad
durraamasho
durraamo¹
durraamo²
durrin
durriyad
durruje
durruq¹
durruq²
durruqaan
durruqid
durruqsad
durruqsasho
durruqso
duruf
durug
durugsan
durugsanaan
durugsanaansho
durugsasho
durugsi
durugso
duruq
duruqsad
duruqsan
duruqsanaan
duruqsanaansho
duruqsasho
duruqsi
duruqso
duruuf
duruufo
duruus
duryamid
duryan¹
duryan²
duryid
dus
dusaa
dusi
dusid
dusin
dusmee
dusmeyn
duub¹
duub²
duub³
duuban¹
duuban²
duubashi
duubasho
duubcad
duubduub¹
duubduub²
duubduuban¹
duubduuban²
duubduubid
duubduubmid
duubduubnaan
duubduubnaansho
duubi
duubid¹
duubid²
duubis
duubmid
duubnaan
duubnaansho
duubo
dųud
duud¹
duud²
duud³
duud-dhadhaabeed
duuddo
duudduub¹
duudduub²
duudduuban¹
duudduuban²
duudduubid
duudduubmid
duudduubnaan
duudduubnaansho
duudduur¹
duudduur²
duudgal
duudgaloobid
duudgalow¹
duudgalow²
duud-garaac¹
duud-garaac²
duud-garaacasho
duud-garaacid
duud-garaaco
duudgelid
duudi
duudin
duudis
duudlo'aad
duud-oogeed
duudsad
duudsasho
duudseef
duudsi¹
duudsi²
duudsi³
duudsii
duudsiin
duudsiyid
duudso
duuf¹
dųuf¹
duuf²
dųuf²
duufaan
duufaan-kulaalay
duufaan-onkodle
duufid
dųufid
duuflaal¹
duuflaal²
duuflaalad
duuflaalid
duuflaalnimo
duufsad
dųufsad
duufsamid
duufsan¹
duufsan²
duufsanaan
duufsanaansho
duufsasho
dųufsasho
duufsi
dųufsi
duufso
dųufso
duug¹
duug²
duug³
duug4
duugan¹
duugan²
duugid
duugis
duugkufaar
duugmid
duugmo
duugnaan
duugnaansho
duugoobid
duugow¹
duugow²
duuh
duul¹
dųul¹
duul²
dųul²
duulaa
dųulal
duulduul¹
duulduul²
duulduulid
duule
dųule
duuli
dųuli
duulid
dųulid
duulin
dųulin
duulis
dųulis
duuliye
dųuliye
dųullaan
dųullan
duullimaad
dųullimaad
duumadhawr¹
duumadhawr²
duumo
duun
duunkiyeel
duunyo
duur
duurgal
duurgaloobid
duurgalow¹
duurgalow²
duurgelid
duurjoog
duurxul¹
duurxul²
duurxulid
duw
duwali
duwan
duwanaan
duwanaansho
duwanow
duwasho
duwid
duwo
dux¹
dux²
dux³
dux-foosfeyt
duxi¹
duxi²
duxid
duxin
duxis
duxsad
duxsasho
duxsi
duxso
