k
ka¹
ka²
ka³
kaa¹
kaa²
kaa³
kaa4
kaab
kaabad
kaabi
kaabid
kaabsol
kaabsul
kaabul
kaad¹
kaad²
kaadar
kaaddhal
kaaddhalnimo
kąadi
kaadi-dhiigow
kaadi¹
kaadi²
kaadi³
kaadibadshe
kaadicaso
kaadidhiig¹
kaadidhiig²
kaadigubasho
kaadihays
kaadi-ku-ceshoomid
kaadimacaan
kaadimareen¹
kaadimareen²
kaadimmacaan
kaadin
kąadin
kaadiqabad
kaadir
kaadiraac
kaadiraaci
kaadiraacin
kaadiraacis
kaadish
kaadishiil
kaadishir¹
kaadishir²
kaadishirid
kaadisokorow
kaadi-taran
kaadi-yaro
kaadiyid
kaadsad
kaadsanla'
kaadsanla'aan
kaadsanla'aansho
kaadsasho
kaadshid
kaadshii
kaadshiin
kaadsi
kaadsiinyo
kaadso
kaaf
kaafi¹
kaafi²
kaafir
kaafirad
kaafiriin
kaafiyid
kaaftoomid
kaaftoon¹
kaaftoon²
kaafuur
Kaaga¹
kaaga²
kaah¹
kaah²
kaaha-altaratyolet
kaahfalid
kaahi
kaahid
kaahin¹
kaahin²
kaahin-birlabdanabeed
kaahin-dulmadow
kaah-qorraxeed
kaakac
kaaki
kaal¹
kaal²
kaal³
kaalandar
kaalay
kaalbaa
kaali
kaalid
kaalin¹
kaalin²
kaaliyam
kaaliye
kaalmayn
kaalmaysasho
kaalmaysi
kaalmayso
kaalmee
kaalmo
kaalo
kaalori
kaalsiyam
kaalsiyam-haydarogsaydh
kaalsiyam-kaarboneyt
kaalsiyam-salfeyt
kaambe
kaambi
kaambiyid
kaamil¹
kaamil²
kaamilan¹
kaamilan²
kaamilid
kaamilmid
kaamilnaan
kaamilnaansho,
kaamilnaansho
kaan
kaanad
kaankaansasho
kaankaansi
kaankaanso
kaar¹
kaar²
kaarad
kaarbogsilik-asiidh
kaarboohaydrayt
kaarboon
kaarboon-hal-ogsaydh
kaarboo-laba-ogsaydh
kaarbuuno
kaarid
kaarotiin
kaarran
kaarranaan
kaarranaansho
kaartabollaato
kaarto
kaartoogaraafiyada
kaas¹
kaas²
kaashad
kaashi
kaasho
kaatun
kaatuun
kaawi¹
kaawi²
kaawin
kaawiyad
kaawiyadayn
kaawiyadee
kaawiyadeysan
kaawiyadeysnaan
kaawiyadeysnaansho
kaawo
kaay¹
kaay²
kaayaga¹
kaayaga²
kaaye
kaayeysasho
kaayeysi
kaayeyso
kaayid
kaayo¹
kaayo²
kaaysasho
kaayso
kab¹
kab²
kab³
kabaab
kabaabyee
kabaabyeyn
kabaabyeysan
kabaabyeysnaan
kabaabyeysnaansho
kabaabyo
kabaabyoo
kabaabyood
kabaal
kabaay
kabacad
kabacaddayn
kabacaddee
kabadhige
kabajaa
kabajaan
kabalafuq
ku
kaballeef
kaban¹
kaban²
kaban³
kabaqoys
kabar¹
kabar²
kabaraad¹
kabaraad²
kabaraadid
kabaraadis
kabardillaacsasho
kabardillaacsi
kabardillaacso
kabare
kabaro
kabarray
kabash-kabash
kabash-kabashlayn
kabash-kabashlee
kabasho
kabasiib¹
kabasiib²
kabasiibid
kabatol
kabatole
kabawaar¹
kabawaar²
kabawaari
kabawaarid
kabawaarin
kabawaaris
kabawaaro
kabax
kabax-kabax
kabax-kabaxlayn
kabax-kabaxlee
kabaxow
kabay
kabayn
kabbaqable
kabbaqablee
kabbaqableyn
kabbaqableysasho
kabbaqableysi
kabbaqableyso
kabbaqublaysi
kabbaquble
kabbaqublee
kabbaqubleyn
kabbaqubleysasho
kabbaqubleyso
kabbasho
kabbax¹
kabbax²
kabbaysad
kabbaysasho
kabbaysi
kabbayso
kabbi
kabbin
kabbis¹
kabbis²
kabbisan
kabbisid
kabbisii
kabbisiin
kabbisnaan
kabbisnaansho
kabbo¹
kabbo²
kabboo
kabbood¹
kabbood²
kabboosho
kabco
kabee
kabeebey
kabid
kabiir
kabixis
kablakac
kable
kabmid
kabnaan
kabnaansho
kabniin
kabo
kabrar¹
kabrar²
kabrarid
kabrarro
kabriid
kabro
kabsad
kabsar
kabsaro
kabsasho
kabsi
kabsid
kabaha
kabso
kabtan
kabti¹
kabti²
kabtin
kabtiyid
kabud
kabuubyo
kabuubyoo
kabuubyood
kac
khasaarid.
kacaamayn
kacaamee
kacaan
kacaami
kacaamid
kacaamin
kacaan¹
kacaan²
kacaanad
kacaandiid
kacaannimo
kacbo
kacdimi
kacdimid
kacdimin
kacdin¹
kacdin²
kacdood¹
kacdood²
kacdoodid
kacdoomid
kacdoon¹
kacdoon²
kacdoon³
kackac
kacsad
kacsan
kacsanaan
kacsanaansho
kacsasho
kacsi
kacso
kactimi
kactimin
kactin¹
kactin²
kadaalli¹
kadaalli²
kadaalliyid
kadab
kadabshiir
kadaf
kadafjiir
kadafshiir
kadalan
kadalloob¹
kadalloob²
kadalloobi
kadalloobid
kadalloobin
kadalloobsad
kadalloobsan
kadalloobsanaan
kadalloobsanaansho
kadalloobsasho
kadalloobsi
kadalloobso
kadankood¹
kadankood²
kadankood³
kadankoodid
kadankoodsad
kadankoodsan
kadankoodsanaan
kadankoodsanaansho
kadankoodsasho
kadankoodsi
kadankoodso
kadbasho
kadbo
kaddaan
kaddib¹
kaddib²
kaddib³
kaddibaad
kaddibid
kaddibiye
kaddiifad
kaddiifo
kadeed¹
kadeed²
kadeedan¹
kadeedan²
kadeedid
kadeedmid
kadeednaan
kadeednaansho
kadhoorad
kadi
kadiido
kadiidoo
kadiidood
kadiidyo
kadiidyoo
kadiidyood
kadin¹
kadin²
kadiso
kadlayn
kadlays
kadlaysii
kadlaysiin
kadle
kadlee
kaduud¹
kaduud²
kaduudan¹
kaduudan²
kaduudi
kaduudid
kaduudin
kaduudmid
kaduudnaan
kaduudnaansho
ka-faa'iideyste
kafaalad
kafaalaqaad¹
kafaalaqaad²
kafaalaqaadid
kafaalasho
kafaalo¹
kafaalo²
kafaaraggud
kafaaraggudasho
kafaaraggudo
kafaaro
kafad
kafaf
kafafi
kafafid
kafafin
kafafis
kafan¹
kafan²
kafee
kafeyn
kafnid
kaftamid
kaftan¹
kaftan²
kaftandhable
kaftanlow
kafuufo
ka-goys
kahad
kahasho
kaho
kahortag
kahortagga-cudurrada
kahsad
kahsi¹
kahsi²
kahsitire
kahso
kajamid
kajan¹
kajan²
kakabi
kakabin
kakabo
kakan
kakanaan
kakanaansho
kakanaanta-beerka
kakoon
kal¹
kal²
kal³
kala
kalaamidiya
kalaan
kalaankal
kalaawi
kalaawin
kalabbar¹
kalabbar²
kalabbaran¹
kalabbaran²
kalabbarasho
kalabbarid
kalabbarmid
kalabbarnaan
kalabbarnaansho
kalabbaro
kalabbartan
kalabbax¹
kalabbax²
kalabbax³
kalabbaxsan
kalabbaxsanaan
Kalabbaxsanaansho
kalabbaxsasho
kalabbaxso
kalabbayr
kalabbixi
kalabbixid
kalabbixin
kalabbixis
kalabbixiye
kalabbood¹
kalabbood²
kalabboodid
kalabboodsan
kalabboodsanaan
kalabboodsanaansho
kala-dheereynta-dhalmada
kala-durug-qaaradeed
kala-faa'iidaysi
kalafuji
kalafujin
kalafujis
kalafuq¹
kalafuq²
kalafuqid
kalafuqsad
kalafuqsan
kalafuqsanaan
kalafuqsanaansho
kalafuqsasho
kalafuqsi
kalafuqso
kala-furan
kalagal
kalaggoyn
kalaggoys
kalaggurad
kalaggurasho
kalagguris
kalagguro
kalagguur¹
kalagguur²
kalagguur³
kalagguurid
kala-hanqaaran¹
kala-hanqaaran²
kala-hanqaarmid
kala-hanqaarnaan
kala-hanqaarnaansho
kala-jaad
kala-jeexid
kala-kaan
kalaqaad¹
kalaqaad²
kalaqaadid
kala-rog
kalasaar
kalasaarid
kalasarree
kalasarreyn¹
kalasarreyn²
kalasarreys
kalasooc¹
kalasooc²
kalasoocan¹
kalasoocan²
kalasoocid¹
kalasoocid²
kalasoocmid
kalasoocnaan
kalasoocnaansho
kalatag¹
kalatag²
kalategid
kalax
kalaxayad
kalaxayasho
kalaxayo
kalaxigsad
kalaxigsasho
kalaxigsi
kalaxigso
kalbaa
kalbad
kalbax¹
kalbax²
kalbixid
kaldambeed
kaldhaash
kaldhal
kaldheer
kaldho
kal-dibadeedka
kale
kaleto
kalfadhi
kalgacal
kalgacayl
kalgal
kalhoraad
kalhuuris¹
kalhuuris²
kali
kaligitaliye
kaligitashade
kaligoodtashadayaal
kaliil
kali-talis
kalitashad
kalitashi
kalkaal¹
kalkaal²
kalkaalid
kalkaaliso
kalkaaliye
kalkaggeeddi
kalkoon
kalkoosh
kalkulas
kalkulas-abyineed
kalkulas-xigsineed
kallah¹
kallah²
kallahaad
kallahid
kallaho
kallahsan
kallahsanaan
kallahsanaansho
kalleeti¹
kalleeti²
kalleetiyid
kalli
kallif¹
kallif²
kallifid
kallihid
kalloorad
kalluumaysad
kalluumaysasho
kalluumaysato
kalluumaysi
kalluumayso
kalluun
kalmoon
kalnugeyl
kalnuglaan
kalnuglaansho
kalnugul
kaloox
kalsaar
kalsamaan
kalsamaansho
kalsami
kalsan
kalshiyam-side
kalsoon
kalsoonaan
kalsoonaansho
kalsooni
kalsoonidarro
kaltamid
kaltan¹
kaltan²
kaltiri
kaltirin
kaltiris
kalwi
kalwin
kalwis
kalxan
kal-xawaaji
kama'¹
kama'²
kama'id
kaman
kamandhuur¹
kamandhuur²
kamandhuurid
kamas
kamasha
kambal¹
kambal²
kambalid
kambani
kambiyaale
kambrian-ka-horreeye
kamiin
kamiinasho
kamiinjebi
kamiinjebin
kamiinjebis
kamiino
kamma'¹
kamma'²
kamma'id
kammil
kammilan¹
kammilan²
kammilid
kammilmid
kammilnaan
kammilnaansho
kammudbixi
kammudbixin
kammudbixis
kamuun
kan¹
kan²
kan³
kanaaf
kanaal
kandeela
kaneeco
kanguuro
kaniisad
kanjab¹
kanjab²
kanjabid
kankamid
kankan¹
kankan²
kankoon
kankoonsan
kankoonsanaan
kankoonsanaansho
kanooni
kansar
kansarbeereed
kansarka
kansarka
kansarkeene
kansho
kansi
kantiin
kar¹
kar²
kar³
karaab
karaahiyo
karaamayn
karaamaysan
karaamaysnaan
karaamaysnaansho
karaamee
karaamo
karaan
karaaniyam
karaankur
karaar¹
karaar²
korodhka
karaar³
karaar-cufisjiidad
karaari
karaarid
karaarin
karaaris
karaawil
karab
karah
karahsad
karahsasho
karahsi
karahso
karan¹
karan²
karan³
karan4
karantiil
karantiin¹
karantiin²
karar
karasho
karatey
karawaliin
karaytar
karbaash¹
karbaash²
karbaashid
karbuuno
kardhasho
kardho¹
kardho²
kareeb
karfan¹
karfan²
karfanid
karhasho
karhid
karho
kari
karid
kariim
kariin
kariinad
karin¹
karin²
karinbillayn
karinbillaysad
karinbillaysan
karinbillaysasho
karinbillaysi
karinbillaysnaan
karinbillaysnaansho
karinbillayso
karinbille
karinbillee
karinbillo
karingaabad
karis
kariwaa
karjinooma
karkaar
karkabad
karkabadayn
karkabadee
karkabayn
karkabee
karkabeyn
karkabeysan
karkabo
karkar
karkarid
karkarin
karkoor
karmaandho
karmayn
karmee
karmid
karnaan
karnaansho
karniimo
karniin
karo
karood¹
karood²
karoodid
karoor¹
karoor²
karoorad
karooran
karoorasho
karoorid
karoornaan
karoornaansho
karooro
karooto
karraani
karrays
karraysad
karraysi
karrayso
karreeb
karriin
karriinlarroor
karro
karsad
karsan
karsanaan
karsanaansho
karsasho
karshimi
karshimid
karshin¹
karshin²
karsi
karsii
karsiin
karso
karti
kartidarro
kartili'i
kartixumo
karuur¹
karuur²
karuur³
karuur4
karuurad
karuuran¹
karuuran²
karuuran³
karuuran4
karuurasho
karuurid
karuurmid
karuurnaan
karuuran4.
karuurnaansho
karuuro
karwaliin
kas¹
kas²
kasab¹
kasab²
kasaliim
kasbasho
kasbayn
kasbee
kasbid
kasbo¹
kasbo²
kasdaran
kasdarnaan
kasdarnaansho
kasdarro
kashif¹
kashif²
kashifaad
kashifan¹
kashifan²
kashifid
kashifmid
kashifnaan
kashifnaansho
kashiiddo
kashiisho
kashiito
kashkaash¹
kashkaash²
kashkaashad
kashkaashan
kashkaashid
kashkaashis
kashkaashnaan
kashkaashnaansho
kashkaasho
kasid
kaskaasbax¹
kaskaasbax²
kaskaasbixid
kaslaan
kasmo
kasoobbax¹
kasoobbax²
kasoobbax-naas
kasoofeen
kasta
kastan
kasxumaan
kasxumaansho
kasxumi
kasxumo
kasxun
kataan
kati
katib
katiifad
katiinad
katoolig
kaw
kawaamid
kawaan¹
kawaan2
kawaanasho
kawaanid
kawaanle
kawaanley
kawaano
kawaawe
kawaawee
kawaaweyn
kawaaweys
kawaaweysan
kawaaweysanaan
kawaaweysnaansho
kawaweer¹
kawaweer²
kawaweerid
kawaweeris
kawaweero
kawdiid¹
kawdiid²
kawdiidi
kawdiidid
kawdiidin
kawir¹
kawir²
kawirasho
kawirid
kawiro
kawkab¹
kawkab²
kawkabid
kawl¹
kawl²
kawlid
kawrax¹
kawrax²
kawrixi
kawrixid
kawrixin
kawrixis
kawtamid
kawtan¹
kawtan²
kax
kaxaan
kaxarbe
kaxayn
kaxaysad
kaxaysasho
kaxaysi
kaxayso
kaxee
kay¹
kay²
kay³
kayaga
kayd
kayd-ayoonayn
kayd-faraq
kayd-haye
kaydi
kaydin
kaydsad
kaydsan
kaydsanaan
kaydsanaansho
kaydsasho
kaydsi
kaydso
kayga¹
kayga²
kaykayle
kaylakeen
kayle
kaylli
kaymadow
kaymayn
kaymo-caleen-irbadlay
kayn¹
kayn²
kaynaan¹
kaynaan²
kaynaani
kaynaanid
kaynaanin
kayn-badhaale
kayn-maanguruuf
kayn-mansuun
kaynroobaad
kayn-tirid
kayo¹
kayo²
kays
kaytiin
kebbi
kebbin
kebbis¹
kebbis²
kebbisan
kebbisid
kebbisii
kebbisiin
kebbisnaan
kebbisnaansho
kebed
kebedgalool
kebriid
kedi¹
kedi²
kedin
kedis
kediso
kedo
kee¹
kee²
keeb
keed
keeda¹
keeda²
keen¹
keen²
keen³
keenayn
keenee
keenid
keenis
keenna¹
keenna²
keeno
keensad
keensasho
keenso
keer¹
keer²
keeratoosis
kefed
kelbed
kelbi
keli¹
keli²
keli³
keligillabe
keligitaliye
keligitashade
keligitashe
keligoodtashadayaal
kelinnimo
kelitalis
kelitashad
kelitashi
keliya
keliyeysad
keliyeysasho
keliyeyso
kelli¹
kelli²
kelli³
kelli-badeed
kellibalow
kelliggub
kellijuluqle
kelmed
kelmi
kelmidhabad
kelmidhabasho
kelmidhabo
kelya-adag
kelya-adayg
kelya-adkaan
kelya-adkaansho
kelyaciirsad
kelyaciirsasho
kelyaciirsi
kelyaciirso
keni
keni-adag
keni-adayg
keni-adkaan
keni-adkaansho
kensi
keratiin
keretinniism
keylli
keynaan
keyrkeyr¹
keyrkeyr²
keyrkeyri
keyrkeyrid
keyrkeyrin
ki
kibilli
kibir¹
kibir²
kibirsan
kibirsanaan
kibirsanaansho
kibis
kibraan
kibri
kibrid
kibriid
kibrin
kibris
kici
kicid
kicin¹
kolka
kicin²
kicitimid
kicitin¹
kicitin²
kidaar
kidfamid
kidfan¹
kidfan²
kidfanaan
kidfanaansho
kidfid
kidib
kidif¹
kidif²
kifaax¹
kifaax²
kifaaxid
kifaayo
kii¹
kii²
kii³
kiil¹
kiil²
kiilad
kiilan
kiilasho
kiilayn
kiilee
kiilid
kiilnaan
kiilnaansho
kiilo¹
kiilo²
kiilogaraam
kiilomitir
kiilowaat
kiimika
kiin¹
kiin²
kiinjo
kiinna¹
kiinna²
kiintaal
kiis¹
kiis²
kiis³
kiisa¹
kiisa²
kiisad
kiish
kiish
kiishad
kiish-dabac-halbawle
ka
kiishka
kiisid
kiismiskiin
kiitoon
kilkil¹
kilkil²
kilkilayn
kilkilays
kilkilee
kilkilid
kilkilo
killaal¹
kiloogaraam
kiloogaraam-culeys
kimistariga-noolaha
kimistariga-oorgaanigga-ah
kimistariga-orgaanig-ma-ahe
kiniin
kiniini
kintir
kir
kiree
kireyn
kireys
kireysad
kireysasho
kireysi
kireyso
kirib
kiriiri
kirishboy
kirishowmirish
kirishtaan
kirishtaanad
kirishtaannimo
kirkir¹
kirkir²
kirkir³
kirkiran
kirkirid
kirkirmid
kirkirnaan
kirkirnaansho
kirkirre
kirli
kiro
kirtamid
kirtan¹
kirtan²
kis
kįs
kisi
kistoo
kiswad
kitaab
kitaabday
kitaabdeyid
kitaabfur¹
kitaabfur²
kitaabfurid
kitaabgaab
kitaabgaablow
kix
kob
kobatol
kobatole
kobci
kobcid
kobcin
kobcis
koboc¹
koboc²
kobocsan
kobocsanaan
kobocsanaansho
kobocsasho
kobocso
kobojaa
kobolli
kobon
kodho
kodhon
kog
kogid
kogsan
kogsanaan
kogsanaansho
koji
kojin
kojiye
kol¹
kol²
kolay
kolayfiiq
kolaytis
kolka
kolkii
kolkol¹
kolkol²
kolla
kollajiin
kollaydh
kolley
kollooydh-soocid
kolmayn
kolmaysan
kolmaysnaan
kolmaysnaansho
kolmee
kolmo
kolombaawi
kolon
koloraydh
koloriin
kombaleeso
kombiyuutar
kongerees
kontarabaan
kontomaad
kontomeeye
kontomeeyo
konton
kontonaad
kontorool¹
kontorool²
kontoroolan
kontoroolasho
kontoroolid
kontoroolnaan
kontoroolnaansho
kontoroolo
kontrobaan
koo²
koob¹
koob²
koobaab¹
koobaab²
koobaaban
koobaabasho
koobaabid
koobaabnaan
koobaabnaansho
koobaabo
koobaad
kooban¹
kooban²
koobi
koobid
koobin
koobir
koobmid
koobnaan
koobnaansho
koobniin
kood¹
kood²
kooda¹
kooda²
koodh
koodhi
koodhiin
koodi
koodin
koodis
koofaar
koofi
koofiyad
koofiyad-xidid
koofiyo
koofur
koo-insaym
kookas
kooke
kookeyn
kool
koolestarool
kooli
koolin
koolis
koolkooli
koolkoolin
koolkoolis
kooma
koombo
koon
koonbiro
koone
koonfur
koor¹
koor²
koor³
koorabixis
kooraggooye
kooraggooyennimo
kooraqore
koorasaar
koorayn
koore
kooree
koori
koorib
koorid
koorin
koorkoox
koorniya
koorrib
koos
koosaar¹
koosaar²
koosaarad
koosaaran
koosaarasho
koosaarid
koosaarnaan
koosaarnaansho
koosaaro
koosayn
koose
koosee
koostik-bootash
koostik-soodha
kootali
kootalinimo
kootaliyad
koow
koowaad
koox
kooxaha-dhiigga
koox-amayno
kooxayn
kooxays
kooxee
koox-kaarbogsayl
kooxkoox
kor¹
kor²
korad
koran
koranwaa¹
koranwaa²
korasho
kordhi
kordhid
kordhin
kordhis¹
kordhis²
kordhisasho
kordhiso
kordhiye
kore¹
kore²
kori
korid
korin
koris
koritaan-dhaqaale
korjad
korjoog
korjooge
korjoogeyn
korjoogtee
korjoogteyn
korjoogto
korme
kormeer¹
kormeer²
kormeere
kormeerid
kornayl
korneylnimo
korniimo
korniin
koro
korobaxo
korolla-ilaacayaal
koromatidhyo
koromatiin
koromosoom
koromosoom-jinsi
koron
koronkor¹
koronkor²
koronkoraysad
koronkoraysasho
koronkoraysi
koronkorayso
koronkorro
korontayaqaan
koronto
kor-ood
koroomiyam
koror¹
koror²
koror³
kororsad
kororsasho
kororsiimo
kororso
korow
korran
korranaan
korranaansho
korrayn
korree
korriimo
korriin
korsaar¹
korsaar²
korsaar³
korsaaran
korsaarid
korsaarnaan
korsaarnaansho
korsad
korsasho
korshirix
korsii
korsiin
korso
korsocod
korsocoto
korsooh¹
korsooh²
korsoohid
kortag¹
kortag²
kortegid
korubooddo
koryaal
koryeeri
kosayn
kotaanjant
kow
kowaad
kowk
kowrax
kowraxsan
kowrixi
kowrixid
kowrixin
kowsad
kowsasho
kowsi
kowso
koxdin
koyto
ku-dhalasho
ku¹
ku²
ku³
kub
kubaddawaco
kubadhagaxoobid
kubadhagaxow¹
kubadhagaxow²
kubbad
kubbad-badh
kubbayn
kubbays
kubbee
kubeerto
kubkucirroole
kubkusiigaale
kubo
kubram
kud¹
kud²
kudaal¹
kudaal²
kudaal³
kudaalid
kudaankudi
kuddaafad
kuddar
kuddayad
kuddayasho
kuddo
kudhac
kudid
kudkude
kudmo
kuduud¹
kuduud²
kuduudan
kuduudi
kuduudid
kuduudin
kuduudnaan
kuduudnaansho
kuf¹
kuf²
kufaar
kufi
kufid
kufin
kufis
kufkuf¹
kufkuf²
kufkufid
kufniin
kufri¹
kufri²
kufrin
kufrinnimo
kufrisii
kufrisiin
kufriyid
kufsad
kufsasho
kufsi
kufso
kuftin
kug
kuhaamid
kuhaan¹
kuhaan²
kuhaanlow
kujiye
kul
kulaal¹
kulaal²
kulaalaha-koonfureed
kulaalaha-waqooyi
kulaalayaal
kulaale
kulaalid
kulaanbeey
kulan¹
kulan²
kulan³
kulannada-Kaartis
kulanno-cidhifeed
kulansan
kulansanaan
kulansanaansho
kulanti
kulayl
kulayle
kulayli
kulaylin
kulbeeg
kulbeege
kulbixiye¹
kulbixiye²
kul-dahsoon
kul-daynaamika
kuldhac
kul-dhexdhexaadin
kul-dhibib
kuldhuleed
kuldiir¹
kuldiir²
kuldiiri
kuldiirid
kuldiirin
kuldiiris
kulekeeye
kul-falgal
kul-gubash
kulgudbin
kuljiir
kulkulul
kulkululaan
kulkululaansho
kullaab
kullaabi
kullad
kullan
kulleejo
kulliyad
kulmi
kulmid
kulmin
kulmis¹
kulmis²
kulqaad
kulqaad-gaar
kulqaate
kulsamays
kulul
kululaan
kululaansho
kululayn
kululee
kulxidhan
kuma
kumaad
kumaankun
kumanaal
kumanyaal
kumbi
kumbin
kumbis
kumi
kummeelgaar
kumulas
kumuloonimbas
kumus
kun
kur¹
kur²
kur³
kuraankur
kuraas
kuray
kuraysad
kuraysasho
kuraysi
kurayso
kurbayn
kurbaysan
kurbaysnaan
kurbaysnaansho
kurbee
kurbin
kurbo
kurboo
kurbood
kurdad
kurdo
kureeddo
kurid
kurkurray
kurkurraynimo
kurmaan
kurreer
kursi
kursijiif
kurtin
kurtumeysasho
kurtumeyso
kurtun
kurus
kuryeysan
kuryeysnaan
kuryeysnaansho
kuryo
kuryoxoogle
kush
kushad
kusheeg
kushiin
kusho
kusime
kusimid
kusin
kutaan
kutiri-kuteen
kutirsane
kutub
kuud
kuudud¹
kuudud²
kuududi
kuududid
kuududin
kuududiye
kuududshe
kuug
kuuki
kuukiyaan
kuul¹
kuul²
kuulad
kuulam
kuulan
kuulasho
kuuli
kuulid
kuulnaan
kuulnaansho
kuulo
kuumi
kuuni¹
kuuni²
kuunkuun
kuunto
kuunyid
kuur¹
kuur²
kuurgal¹
kuurgal²
kuurgeli
kuurgelid
kuurgelin
kuuri
kuurid
kuurin
kuurkuursad
kuurkuursasho
kuurkuursi
kuurkuurso
kuus¹
kuus²
kuusad
kuusan¹
kuusan²
kankoonsan
kuusid
kuusin
kuuskuus
kuuskuusid
kuusmid
kuusnaan
kuusnaansho
kuusni
kuuti
kuutin
kuutis
kuutiyad
kuwa
kuwaa
kuwaaga
kuwaantam
kuwaartsayd
kuwaas
kuwaatis
kuwama
kuwan
kuwayaga
kuwayga
kuwee
kuweeda
kuweenna
kuweer
kuwii
kuwiinna
kuwiisa
kuwo
kuwoo
kuwoo
kuwooda
kuxige
