khaaddin
khaaddun
khaafsan
khaafsanaan
khaafsanaansho
khaa'in
khaa'iniin
khaa'innimo
khaakhuul
khaalis
khaanad
khaarij
khaariji
khaarijin
khaarijis
khaas
khaash¹
khaash²
khaashid
khaati
khaatimo
khaatir
khaatumo
khaawis¹
khaawis²
khaawisid
khaayin
khaayir¹
khaayir²
khaayirid
khaayis¹
khaayis²
khaayisid
khabaar¹
khabaar²
khabaarid
khabaarsad
khabaarsasho
khabaarsi
khabaarso
khabar¹
khabar²
khabarsad
khabarsasho
khabarsi
khabarso
khabiid
khabiidnimo
khabiir
khad
khadar
khaddaab¹
khaddaab²
khaddaabid
khaddif¹
khaddif²
khaddifid
khaddifsan
khaddifsanaan
khaddifsanaansho
khaddiib
khadyaan
khafiif¹
khafiif²
khafiifi
khafiifid
khafiifin
khafiifis
khafiifnimo
khafiifsan
khafiifsanaan
khafiifsanaansho
khafiyad
khajal¹
khajal²
khajalid
khajil¹
khajil²
khajilaad
khajilid
khal
khalaawo
khalaq
khalfad
khaliif¹
khaliif²
khaliifan
khaliifid
khaliifnaan
khaliifnaansho
khaliifnimo
khalji¹
khalji²
khaljiyid
khalkhal¹
khalkhal²
khalkhal-birlabeed
khalkhalgeli
khalkhalgelin
khalkhalgelis
khalkhali
khalkhalid
khalkhalin
khalkhalsan
khalkhalsanaan
khalkhalsanaansho
khalqi
khalqid
khalwo
khamaar¹
khamaar²
khamaarid
khamaas¹
khamaas²
khamaasid
khamiir¹
khamiir²
khamiiri
khamiirid¹
khamiirid²
khamiirin
khamiis¹
khamiis²
khammaar¹
khammaar²
khammaarid
khamraawi
khamraysan
khamraysnaan
khamraysnaansho
khamri
khamriyacab
khamro
khamsiin
khaniis
khanni
khansiir
kharaab¹
kharaab²
kharaabi
kharaabid
kharaabin
kharaabsan
kharaabsanaan
kharaabsanaansho
kharaar
kharaaraansho
kharaari
kharaarin
kharaarow
kharaf
kharaj
kharajgarayn
kharajgaree
kharash
kharashgarayn
kharashgaree
kharfo
khariidad
khariidad-borojakhsaneyd
khariidad-kala-sarreynta
khariiddo
khariif¹
khariif²
khariifid
kharqaan
kharqaanle
kharqad
kharraab¹
kharraab²
kharraabi
kharraabin
kharraabsan
kharraabsanaan
kharraabsanaansho
kharrib¹
kharrib²
kharribaad
kharriban¹
kharriban²
kharribid
kharribmid
kharribnaan
kharribnaansho
khasaanad
khasaar
khasaari
khasaarid
khasaarin
khasaaro
khasab¹
khasab²
khasbid
khashabad
khashiimiin
khashiin
khashiinnimo
khashin
khashinsaar
khashkhash¹
khashkhash²
khashkhashaad
khashkhashid
khashuuc¹
khashuuc²
khashuucid
khashuucsan
khashuucsanaan
khashuucsanaansho
khasif¹
khasif²
khasifid
khasiis
khasiisiin
khasir¹
khasir²
khasiraad
khasirid
khasiyad
khasiyadayn
khasiyadee
khasnad
khasnaji
khasoobid
khasow
khatal¹
khatal²
khatalaad
khatalan¹
khatalan²
khatalan³
khatalid
khatalmid
khatalnaan
khatalnaansho
khatar
khatif¹
khatif²
khatifid
khatifsan
khatifsanaan
khatifsanaansho
khatimid
khatin¹
khatin²
khawaaf
khawaafad
khawaafiin
khawaafsasho
khawaafso
khawaaji
khawayiis
khawaysii
khawaysiin
khayaamayn
khayaamee
khayaamid
khayaan
khayaanalow
khayaanayn
khayaanee
khayaanid
khayaano
khayli
khaymad
khayr
khayraad
khaysaraan
khibrad
khibro
khiddad
khidmad
khidmee
khidmeyn
khidmo
khidmo-shuruud
khilaaf¹
khilaaf²
khilaafid
khilaafo
khilaafsan
khilaafsanaan
khilaafsanaansho
khilaawayn
khilaawee
khilaawo
khiyaamayn
khiyaamee
khiyaamo
khiyaanayn
khiyaanee
khiyaano
khiyaar
khoobar
khoof¹
khoof²
khoofid
khoori¹
khoori²
khubaro
khudaar
khudbad
khudbasireed
khudbasireysad
khudbasireysasho
khudbasireysi
khudbasireyso
khudbee
khudbeyn
khudbo
khudrad
khulafaa
khulcid
khuluc¹
khuluc²
khumkhum
khuraafaad
khurraad
khusayn
khusee
khushi
khushiye
khushuuc¹
khushuuc²
khushuucid
khushuucsan
khushuucsanaan
khushuucsanaansho
khusuusi
khuuri¹
khuuri²
khuurin
khuuris
khuuro
