m
ma¹
ma²
ma³
ma4
maab
maaci
maacuun
maad
mąad
maadaama
maadad
maadasho
maaddaama
maaddad
maaddi¹
maaddi²
maaddiyad
maaddo
maadee
maadeyn
maadeys
maadeysad
maadeysasho
maadeysi
maadeyso
maadhiin
maadi
maadin
maadis
maadley
maadlow
maado
maadsasho
maadso
maafoos
maag¹
mąag¹
maag²
mąag²
mąagasho
maageer¹
maageer²
maageeran
maageerasho
maageerid
maageernaan
maageernaansho
maageero
maageersan
maageersanaan
maageersanaansho
maaggan
maagganaan
maagganaansho
maagid
mąagid
maagma
mąago
maahane
mąahi
mąahin
maahmaah¹
maahmaah²
maahmaahid
maahmaahyo
maahsan
maahsanaan
maahsanaansho
maahsani
maajeen¹
maajeen²
maajo
maakaal
maakhad
maakhadee
maakhadeyn
maakhiido
maal¹
maal²
maal³
maala-abbaar
maalan
maaleeyo
maalgeli
maalgelin
maalgelis
maali
maalid
maalig
maaliki¹
maaliki²
maalin-dayaxeed
maalin-firfircoone
maalin¹
maalin²
maalindhaaf
maalingaal¹
maalingaal²
maalingaalid
maalingoosad
maalingoosato
maalinjoog¹
maalinjoog²
maalinjoogid
maalinnimo
maalinqad
maalin-qorraxeed
maalinsocod
maalis¹
maalis²
maaliyad
maalmadoone
maalnaan
maalni
maalniin
maalooti
maalqabeen
maalqabeennimo
maalsii
maalsiin
maami
maamin
maamis
maammul¹
maammul²
maammulan
maammulasho
maammule
maammulid
maammulnaan
maammulnaansho
maammulo
maammulxumo
maamul¹
maamul²
maamulan
maamulasho
maamule
maamulid
maamulnaan
maamulnaansho
maamulo
maamulxumo
maamuus¹
maamuus²
maamuusid
maamuusiyad
maamuusjab¹
maamuusjab²
maamuusjebi
maamuusjebid
maamuusjebin
maan¹
maan²
maanac¹
maanac²
maanacan
maanacnaan
maanacnaansho
maanayeyn
maandha
maandhaaf¹
maandhaaf²
maandhaafid
maandhay
maandhe
maandhow
maandoobid
maandoori
maandoorin
maandooriye
maandoorsan
maandoorsanaan
maandoorsanaansho
maandow¹
maandow²
maanfoos
maangaab
maangaaban
maangaabi
maangaabnaan
maangaabnaansho
maangaabnimo
maangad¹
maangad²
maangad³
maangadid
maangal
maangalnimo
maanganiis
maangarad
maangarasho
maangaro
maanicid
maankaal
maanlaawe
maanlaay
maanomitir
maanqaad
maanqaadid
maansabooli¹
maansabooli²
maansabooliyid
maansayahan
maansayn
maansee
maansha
maanso
maansoo
maansood
maanta
maantay
maantomaanto
maantoolayn
maantoolaysad
maantoolaysasho
maantoolaysi
maantoolayso
maantoole
maantoolee
maanyar
maanyaraan
maanyaraansho
maanyari
maanyaro
maanyee
maanyeyn
maanyo¹
maanyo²
maaqal
maaqul
maaquurre
maaquurree
maaquurreyn
maaquurreys
maar¹
maar²
maarad
maaran
maararroobid
maararrow¹
maararrow²
maararruugle
maarasho
maaraweyn
maardhood¹
maardhood²
maardhoodid
maaree
maareeye
maareyn
maareysan
maareysasho
maareysnaan
maareysnaansho
maareyso
maari
maarin
maaris
maarmid
maaro¹
maaro²
maaroobid
maarow
maarriin
maarsasho
maarso¹
maarso²
maaruq
maaruqid
maas
maasha
maashayn
maashays
maashee
maashi
maashii
maashoo
maashood
maasuud
maasuudi
maasuudin
maati
maato
sawiranyahay,
maaweeli
maaweelin
maaweelis
maaweelo
maax¹
maax²
maaxad
maaxasho
maaxi
maaxid
maaxin
maaxo
maaxsan
maaxsanaan
maaxsanaansho
maaxsanow
maayad
maayliin
mab
mabaadi'
mabac
mabda'
mabid
mabsuud¹
mabsuud²
mabsuudi
mabsuudid
mabsuudin
mac¹
mac²
macaadin
macaahado
macaahid
macaamil
macaamilo
macaamiloo
macaamilood
macaammil
macaammilo
macaammiloo
macaammilood
macaan¹
macaan²
macaan³
macaanaan
macaanaansho
macaane
macaanee
macaaneyn
macaaneys
macaaneysad
macaaneysasho
macaaneysi
macaaneyso
macaani
macaanow
macaansad
macaansasho
macaansho
macaansi
macaanso
macaariif
macaash¹
macaash²
macaashi
macaashid
macaashin
macaashle
macaawinad
macaawino
macaddi
macagtoobid
macagtow
macal
macalgad
macalgo
macallimad
macallin
macallinnimo
macaluul¹
macaluul²
nafaqo-darro
macaluulan
ahaansho.
macaluuli
macaluulid
macaluulin
macaluulis¹
macaluulis²
macaluulnaan
macaluulnaansho
macaluushan
macaluushanaan
macaluushnaansho
macandi
macangag¹
macangag²
macangagid
macangagnimo
macarifad
macasalaamee
macasalaameyn
macasalaameys
macasalaamo
macatab
macawis
macayn
macays
macaysad
macaysasho
macayshad
macaysi
macayso
macbiil
macbil
macbilad
macbilasho
macbilo
macbuud
macdaar
macdan¹
macdan²
macduun
macduur
macduurnimo
macee
maceeshad
machad
maci
maciin¹
maciin²
maciindarro
maciinid
maciinla'aan
maciinlaawe
maciinsad
maciinsasho
maciinsi
maciinso
maciishad
maciisho
maclaqad
macmacaan
macmiil
macmil
macnagarasho
macnagaro
macnayn
macnays
macne
macnee
macno
macooyo
macow
macquul
macriifad
macriifo
macruuf
macsarad
macsaro
macshar
macsi
macsiley
macsilow
macsuum¹
macsuum²
macsuuman
macsuumid
mad¹
mad²
madaabax
madaafiic
madaa'iix
madaal
madaali
madaalin
madaalis
madaar¹
madaar²
madaarid
madaddaalad
madaddaalasho
madaddaali
madaddaalin
madaddaalis
madaddaalo¹
madaddaalo²
madag
madal¹
madal²
madalbaaji
madalbaajin
madalbaajis
madalhufi
madalhufin
madalhufis
madalsad
madalsan
madalsanaan
madalsanaansho
madalsanow
madalsasho
madalsi
madalso
madan
madane
madar¹
madar²
madashad
madashan
madashanaan
madashanaansho
madashanow
madasho
madax¹
madax²
madax-adag
madax-adayg¹
madax-adayg²
madax-adaygid
madax-adhaxley
madax-adkaan
madax-adkaansho
madax-araxley
madaxbannaan
madaxbannaanaan
madaxbannaanaansho
madaxbannaani
madaxbannaanow
madaxbuq
madaxbushi
madaxee
madaxeyn
madaxfalluuq
madaxfarad
madaxfareed
madaxfurad
madaxfurasho
madaxfuro
madaxkuti
madaxla'
madaxmaygaag
madaxnimo
madaxsalaax
madaxsalaaxid
madaxshub
madaxti
madaxtinnimo
madaxtooyo
madaxtus¹
madaxtus²
madaxtusid
madaxwareer
madaxweyne
madax-xanuun
madax-xige
madaxyaro
madbacad
madbaco
madbakh
maddaad
maddaalannimo
maddaale
maddan
maddane
maddarab
maddaraq
maddaroorshe
maddiibad
maddiiddaa
maddiiddee
maddiiddeyn
maddiiddeysan
maddiiddeysnaan
maddiiddeysnaansho
maddiiddo
maddiidimi
maddiil
maddo
maddooyaa
maddooyamaddooyo
maddooye
maddooyeysasho
maddooyeysi
maddooyeyso
maddooyo
madduul
madfac
madhaafaan
mad'hab
mad-hab
madhale
madhalennimo
madhaleys¹
madhaleys²
madhaleysnimo
madhan
madhasho
madhintannimo
madhinte
madhoodhee
madhoodheyn
madhoodho
madhxin
madhxiye
madi¹
madi²
madid
madiid¹
madiid²
madiidid
madiidimi
madiidimid
madiidimin
madiidimis¹
madiidimis²
madiidin¹
madiidin²
madiidinnimo
madiidinsad
madiidinsasho
madiidinsi
madiidinso
madiix¹
madiix²
madiixid
madkee
madkeyn
madkeys
madkeysan
madkeysmid
madko
madkoole
madli
madlid
madlin
madluumi
madluumid
madluumin
madluun¹
madluun²
madluunnimo
madluunsan
madluunsanaan
madluunsanaansho
madmad¹
madmad²
madmadid
madnaan
madnaansho
madoobaad
madoobaan
madoobaansho
madoobee
madoobeyn
madoobeysan
madoobeysasho
madoobeysnaan
madoobeysnaansho
madoobeyso
madoobow
madoorsoomaha-kala-furanka
madoorsoomayaal-fisikaad-ee-salka-ah
madoorsoome
madoorsoome-neef
madoow¹
madoow²
madow¹
madow²
madow-hadh
madrasad
madraso
maduul
mafaatiix
mafafaay
mafiiq
mag¹
mag²
magaad
magaag¹
magaag²
magaagid
magaalammadax
magaalaqaran
magaalee
magaaleyn
magaaleysad
magaaleysasho
magaaleysi
magaaleyso
magaalo
magaaloobid
magaalow
magaan¹
magaan²
magaay
magac¹
magac²
magacaabid
magacdar
magacdarid
magacdarree
magacdarreyn
magacdarreys
magacdarri
magacdarro
magacdheer
magacdheeraan
magacdheeraansho
magacdheeri
magacdheerow
magacow¹
magacow²
magacsiin
magacuyaal
magad
magaggooye
magallooti
magan
magangal¹
magangal²
magangeli
magangelid
magangelin
magangelis
magangelyo
magangooye
magangooyo
magangoyn
magasho
magay
magdee
magdeyn
magdeys
magdeysad
magdeysan
magdeysasho
magdeysi
magdeysnaan
magdeysnaansho
magdeyso
magdhabad
magdhabasho
magdhabid
magdhabo
magdhaw¹
magdhaw²
maggaabi
maggaabid
maggaabin
maggaabo
maggaraaso
maggarafoon
maggaroofan
maggeyno
maggow¹
maggow²
maggowsad
maggowsasho
maggowsi
maggowsii
maggowsiin
maggowso
magguur
magguuraan
magguure
magguurto
magid
magli
magmaag
magmaagan
magmaagasho
magmaagid
magmaagnaan
magmaagnaansho
magmaago
magmag
magmagid
magmakayn
magmakee
magniisiyam
mago
magoog¹
magoog²
magoogid
magool¹
magool²
magoolayaal
magooli
magoolid
magoolin
magubte
magudbe¹
magudbe²
magungi
maguug
maguuji
maguujin
magwadaag¹
magwadaag²
magwadaagid
mahabe¹
mahabe²
mahad
mahadceli
mahadcelin
mahadho
mahadi
mahadin
mahadis
mahadnaq¹
mahadnaq²
mahadnaqid
mahadniqid
mahadsan
mahadsanaan
mahadsanaansho
mahadsanid
mahar
mahari
maharin
maharsad
maharsan
maharsanaan
maharsanaansho
maharsasho
maharso
mahasho
mahayammoog
mahayammooge
mahaysato
mahdab
mahdar
mahdi
mahersi
mahiib¹
mahiib²
mahiibi
mahiibid
mahiibin
mahiibsasho
mahiibsii
mahiibsiin
mahiibso
mahiigaan
mahiigaannimo
mahiiggaan
mahiiggaannimo
maho
mahrajaan
mahuraan
majaajilee
majaajileyn
majaajillee
majaajilleyn
majaajillo
majaajilloo
majaajillood
majaajilo
majaajiloo
majaajilood
majaalis
majaaniin
majabbaxsad
majabbaxsasho
majabbaxsi
majabbaxso
majabbixsasho
majabe
majagoror¹
majagoror²
majagorori
majagororid
majagororin
majagororsan
majagororsanaan
majagororsanaansho
majallad
majaqaris
majaraaf
majarafad
majarahaye
majare
majarroggasho
majarrogo
majarroor¹
majarroor²
majarroori
majarroorid
majarroorin
majarroorsan
majarroorsanaan
majarroorsanaansho
majasaar¹
majasaar²
majasaarid
majasuux¹
majasuux²
majasuuxi
majasuuxid
majasuuxin
majasuuxsan
majasuuxsanaansho
majaxaabi
majaxaabin
majaxaabis
majaxaabo
majeerad
majeerasho
majeero
majiir¹
majiir²
majiir³
majiirad
majiirasho
majiire-dayaxeed
majiire-qorraxeed
majiirid
majiiro
majiirsii
majiirsiin
majimow
majin¹
majin²
majinow
majlis
majnuun
majoqaris
majuuji
majuujin
majuujis
majuujisasho
majuujiso
majuujo
majuusi
makaab¹
makaab²
makaaban
makaabi
makaabid
makaabin
makaabis
makaabnaan
makaabnaansho
makaan
makaanig
makaawi
makaay-aaramow
makal¹
makal²
makalaalax¹
makalaalax²
makalaalaxsan
makalaalaxsanaan
makalaalaxsanaansho
makalaalixid
makalan
makalid
makalnaan
makalnaansho
makaraan
makaroofi
makas
makasto
makeekee
makeeko
makhaane
makhaasiin
makhaayaadle
makhaayad
makhaayo
makhabbiyad
makhabbiyo
makharje
makhluuq
makhmal
makhmarad
makhnaatad
makhnaato
makhoor¹
makhoor²
makhoorid
makhrib
makhsin
makhuur¹
makhuur²
makhuuri
makhuurid
makhuurin
makhuursan
makhuursanaan
makhuursanaansho
makiinad
makooko
maktabad
makuuti
mal¹
mal²
mala-abbaar¹
mala-abbaar²
mala-abbaarid
malaace
malaa'ig
malaakh¹
malaakh²
malaakhad
malaakhadi
malaakhadin
malaakhid
malaaq¹
malaaq²
malaas¹
malaas²
malaas³
malaasan¹
malaasan²
malaaseysasho
malaaseyso
malaasid
malaasmid
malaasnaan
malaasnaansho
malaasni
mala-awaal¹
mala-awaal²
mala-awaalid
malaayiin
malab
malabcir
malabmaris
malabsad
malabsasho
malabsi
malabso
malaf
malafsad
malafsasho
malafsi
malafso
malag¹
malag²
malaha
malakamawd
malanda'¹
malanda'²
malandi'id
malas
malasee
malaseyn
malawad
malax
malaxaysad
malaxaysan
malaxaysasho
malaxaysi
malaxaysnaan
malaxaysnaansho
malaxayso
malax-dareer
malayn
malaysad
malaysasho
malaysi
malayso
malbo
malcabad
malcamad
malcaqad
malcuun
malcuunnimo
maldah
maldahan
maldahnaan
maldahnaansho
maldahnow
maldheer
maldihid
male
malee
maleeg
maleegan¹
maleegan²
maleegid
maleegmid
maleegnaan
maleegnaansho
maleeqo
malgacad
malgid
malid
maliid
maliiddo
maliil¹
maliil²
maliili
maliilid
maliilin
maliiq
maliiqan
maliiqid
maliiqnaan
maliiqnaansho
maliiqo
maliishan
maliishanaan
maliishanaansho
maljiid¹
maljiid²
maljiidan
maljiidid
maljiidnaan
maljiidnaansho
malkad¹
malkad²
malkhabad
malkhamad
malko
mallaay
mallay
malleel
malliiqo
malloolli
malluug
malmal
malmalaaddo
malo
malooq
malooqan
malooqasho
malooqid
malooqnaan
malooqnaansho
malooqo
malow
malqabad
malqacad
maluuq
maluuqad
maluuqan
maluuqasho
maluuqid
maluuqnaan
maluuqnaansho
maluuqo
malxaf
malyan
malyuun
mam
mamac
mambar
mamid
ma-milme
mamlakad
mamlako
mamman
mammanaan
mammanaansho
mamnuuc¹
mamnuuc²
mamnuucan
mamnuucid
mamnuucnaan
mamnuucnaansho
mamnuucnow
man
manaafacaad¹
manaafacaad²
manaafacaadid
manaafacaadsasho
manaafacaadso
manaahiij
manaayo
mandad
mandaleel
mandaq
mandarad
mandariin
mandariini
mandharaari
mandhareer
mandharuug
mandheer
mandheerrey
mandhoorrey
mandiil
maneysad
maneysasho
maneysi
maneyso
manfac
manfaco
mangaruuf
mangaruuri
manhaj
mani
manjabbaxsad
manjabbaxsasho
manjabbaxsi
manjabbaxso
manjagoror¹
manjagoror²
manjagorori
manjagororid
manjagororin
manjagororsan
manjagororsanaan
manjagororsanaansho
manjarrogasho
manjarrogo
manjarroor¹
manjarroor²
manjarroori
manjarroorid
manjarroorin
manjarroorsan
manjarroorsanaan
manjarroorsanaansho
manjasaar¹
manjasaar²
manjasaarid
manjasuux¹
manjasuux²
manjasuuxi
manjasuuxid
manjasuuxin
manjasuuxsan
manjasuuxsanaan
manjasuxsanaansho
manjaxaabi
manjaxaabin
manjaxaabis
manjaxaabo
manjo
mannasheegad
mannasheegasho
mannasheego
mannee
mannexe
manneyn
manneysasho
manneyso
manniiqo
manno
mannooge
mannoole
manqas
manqax¹
manqax²
manqaxi
manqixid
manqo
mansab
mansacagaley
mansalugaley
mansalugooley
manshashuur¹
manshashuur²
manshashuurid
manso
mansuun
mantag¹
mantag²
mantagid
mantaji
mantajin
mantajis
manuunsasho
manuunsi
manuunso
manyac¹
manyac²
manyacsan
manyacsanaan
manyacsanaansho
manyici
manyicid
manyicin
manyiikay
maqaal
maqaalad
majallad.
maqaale
maqaalin
maqaalo
maqaame
maqaan
maqaar¹
maqaar²
maqaardhac
maqaar-dhexaad
maqaarholac
maqaar-ku-dur
maqaarsaar¹
maqaarsaar²
maqaarsaarid
maqaarsad
maqaarsasho
maqaarsi
maqaarso
maqaasiin
maqaawiir
maqaaxi
maqaayad
maqaayadle
maqaayo
maqaddin
maqal¹
maqal²
maqal³
maqalsii
maqalsiin
maqan
maqanajooge
maqaraaruf¹
maqaraaruf²
maqaraarufid
maqas
maqashii
maqashiin
maqbaro
maqdarad
maqiiq¹
maqiiq²
maqiiqan
maqiiqid
maqiiqnaan
maqiiqnaansho
maqil
maqle
maqlee
maqleyn
maqli
maqlid
maqnaan
maqnaansho
maqnaddiis
maqnow
maqoor
maqoorad¹
maqoorad²
maqooradasho
maqooradid
maqoorado
maqoorasho
maqooro
maqrib
maqsin
maqsinka-dawada
maqsuud¹
maqsuud²
maqsuudi
maqsuudid
maqsuudin
maquuni
maquunin
maquuno
maquunsad
maquunsasho
maquunso
maquur¹
maquur²
maquuri
maquurid
maquurin
maquursan
maquursanaan
maquursanaansho
maquus¹
maquus²
maquusid
mar¹
mar²
mar³
mar4
maraa
maraabayn
maraabe
maraabee
maraabo
maraaci¹
maraaci²
maraaciyid
maraado
maraajic
maraakiib
maraamayn
maraame
maraamee
maraamiir
maraamo
maraar
maraarnimo
maraay
marabbi
marabboob
marad
maradhaami
maradhaamin
maradhaamo
maradhaarayn
maradhaaree
maradhaari
maradhaarin
maradhaaris
maradhaaro
maradhaarsasho
maradhaarso
marafur
marag
mąrag
maragfur¹
maragfur²
maragfurid
maragkac¹
maragkac²
maragkicid
maragmaddoonto
maragsan
maragsanaan
maragsanaansho
maragsasho
maragsii
maragsiin
maragso
marakaneeco
marakudheg
maran
maranti
maraq¹
maraq²
maraqoobid
maraqow
maraqsaar
maraqsad
maraqsan
maraqsanaan
maraqsanaansho
maraqsasho
maraqso
mararroobid
mararrow¹
mararrow²
marashee
marasheyn
marasheysan
marasheysnaan
marasheysnaansho
marashi
marashiyayn
marashiyee
marashiyeysan
marashiyeysnaan
marashiyeysnaansho
marasho¹
marasho²
maratoon
marawaxad
marawaxadi
marawaxadin
marawaxo
maraweyn
marax¹
marax²
maraxsad
maraxsan
maraxsanaan
maraxsanaansho
maraxsasho
maraxsi
maraxso
maraykaan
marbooc
marbuuc
marcurad
marcuradnimo
marcurasho
mardaaddi¹
mardaaddi²
mardaaddin
mardaaddiyid
mardaaf
mardabaan
mardabayn
mardabee
mardabo
mardaddabaan
mardaddabaanley
mardaddabaanlow
mardaddabo
mardar
mardee
mardeyn
mardhoof
mardimee
mardimeyn
mardin
mardo
marduuf
mareeg
mareegadheer
mareeg-daabacan
mareer
margaag¹
margaag²
margaagid
margan
marganaan
marganaansho
margasho
margaysan
margaysnaan
margaysnaansho
margeelee
margeeleyn
margeeleys
margi
margin
margis
margo¹
margo²
mari¹
mari²
marid
mariid
mariikh
mariil¹
mariil²
mariili
mariilid
mariilin
mariishan
mariishanaan
mariishanaansho
marimba
marin¹
marin²
marin-cidhiidhi
marin-ganacsi
maris¹
maris²
marjaan
marjac
marji
marjiid¹
marjiid²
marjiidan
marjiidid
marjiidnaan
marjiidnaansho
marjin
marjis
marka
markab
markable
markasho
markhaanti
markhaati
markhaatifur¹
markhaatifur²
markhaatifurid
marki
markii
markin
markis
marko
marmaarri¹
marmaarri²
marmaarriyid
marmar¹
marmar²
marmar³
marmarasho
marmarhays
marmarid
marmaro
marmarsiino
marmarsiinyo
marmarsiinyoo
marmarsiinyood
marmarsoo
marmarsood
marnaan
marnaansho
marnow
maro¹
maro²
maro-masaar
maroodi
maroodiyow
maroog
maroogsad
maroogsan
maroogsanaan
maroogsanaansho
maroogsasho
maroogsi
maroogsin
maroogso
marooji
maroojin
maroojis
maroojis-laba-cirifle
marooq
marooqsad
marooqsan
marooqsanaan
marooqsanaansho
marooqsasho
marooqsi
marooqso
maroor¹
maroor²
marooradillaac¹
marooradillaac²
marooradillaaci
marooradillaacid
marooradillaacin
maroori
maroorid
maroorin
marooro
maroorsamid
maroorsan¹
maroorsan²
maroorsanaan
maroorsanaansho
maroorsanow
maroorsasho
maroorso
marqaami
marqaamid
marqaamin
marqaan¹
marqaan²
marqaansan
marqaansanaan
marqaansanaansho
marqaansanow
marqaansii
marqaansiin
marqaansiis
marqaati
marqafur
marqammayr
marqan
marqanaan
marqanaansho
marqasho
marqi
marqid
marqin
marqis
marqo
marra
marras
marre
marriimid
marriin¹
marriin²
marro
marsad
marsan
marsanaan
marsanaansho
marsasho
marshee
marsheyn
marsho
marsii
marsiin
marsiino
marso¹
marso²
marsoobbax
marsubaaliya
marsuubiyaal
martabad
marti¹
marti²
marti³
martiggeli
martiggelin
martiqaad¹
martiqaad²
martiqaadid
martiqadin
martiqadis
martisoor¹
martisoor²
martisoore
martisoorid
martiyee
martiyeyn
martiyid
marwalleys
marwaxad
marwaxad-neefeed
marwaxadi
marwaxadin
marwaxo
marwee
marweyn
marweysan
marweysnaan
marweysnaansho
marwo
marxabba
marxabbaysii
marxabbee
marxabbeyn
marxabbeysiin
marxal
marxalad
marxi
marxid
marxin
marxis
marxuum
maryaad¹
maryaad²
maryaadi
maryaadid
maryaadin
maryaadis
maryamayn
maryamee
mas
masaabax¹
masaabax²
masaabaxan
masaabaxnaan
masaabaxnaansho
masaabaxnow
masaabixid
masaadir
masaafee
masaafeyn
masaafeysasho
masaafeyso
masaafir¹
masaafir²
masaafiri
masaafirid
masaafirin
masaafiris
masaafirsan
masaafirsanaan
masaafirsanaansho
masaafirsanow
masaafo
masaafoo
masaafood
masaafur¹
masaafur²
masaafuri
masaafurid
masaafurin
masaafuris
masaafursan
masaafursanaan
masaafursanaansho
masaafursanow
masaajid¹
masaajid²
masaakiin
masaal
masaaliix
masaamax¹
masaamax²
masaamaxan
masaamaxnaan
masaamaxnaansho
masaamaxnow
masaamiir
masaamixid
masaanic
masaar
masaargaab
masaariif
masaaxad
masaaxo
masabbid¹
masabbid²
masabbidan
masabbidasho
masabbidid
masabbidnaan
masabbidnaansho
masabbido
masacagaley
masaf¹
masaf²
masafo
masaggo
masal¹
masal²
masalaggaab
masalan
masalid
masallaf¹
masallaf²
masallafi
masallafid
masallafin
masallafsan
masallafsanaan
masallafsanaansho
masalle
masalo
mas'alo
masalugaley
masalugooley
masar
masarafad
masawir¹
masawir²
masawirid
masax¹
masax²
masaxad
masaxan
masaxnaan
masaxnaansho
masaxo¹
masaxo²
masay
masayr¹
masayr²
masayri
masayrid
masayrin
masayrrey
masayrrow
masayrsan
masayrsanaan
masayrsanaansho
masayrsanow
masayrsii
masayrsiin
masayrtir¹
masayrtir²
masayrtirid
mascaanood
mascadde
masciideed
masdar
masdarad
masdaro
mase¹
mase²
masee
maseyn
masgeesaale
mashaa'ikh
mashaakil
mashaariic
mashaqayn
mashaqaysan
mashaqaysnaan
mashaqaysnaansho
mashaqayste
mashaqee
mashaqo¹
mashaqo²
mashaqoobid
mashaqow
masharaaf
masharafad
mashashuur¹
mashashuur²
mashashuurid
mashiiggaan
mashiin
mashiingaan
mashiiqsasho
mashiiqsi
mashiiqso
mashmash¹
mashmash²
mashmashid
mashood
mashquul¹
mashquul²
mashquuli
mashquulid
mashquulin
mashquulis
mashquulsan
mashquulsanaan
mashquulsanaansho
mashquulsanow
mashruuc
mashxarad¹
mashxarad²
mashxaradid
masiibo
masiil
masiix
masiixi
masiixinnimo
masiixiyad
masil¹
masil²
masilid
masingow
masixid
masjid
masjoohaar
maskab
maskabjab¹
maskabjab²
maskabjaban
maskabjabi
maskabjabid
maskabjabin
maskabjabnaan
maskabjabnaansho
maskabjabsan
maskabjabsanaan
maskabjabsanaansho
maskan
maskar¹
maskar²
maskarjab¹
maskarjab²
maskarjaban
maskarjabi
maskarjabid
maskarjabin
maskarjabnaan
maskarjabnaansho
maskarjabsan
maskarjabsanaan
maskarjabsanaansho
maskax
maskaxbuq
maskax-dambeed
maskaxfareed
maskaxyaraan
maskaxyari
maskaxyaro¹
maskaxyaro²
maskharo
maskharoo
maskharood
maskiin¹
maskiin²
maskiinad
maskiinnimo
maslax¹
maslax²
maslaxaad
maslaxad
maslaxo
maslixid
masnac
maso
masoobid
masow
masrad
masrax
masrixiyad
masruuf¹
masruuf²
masruufasho
masruufid
masruufo
mastarad
mastaro
mastuurasho
mastuuro
masuubo
masuug¹
masuug²
masuugad
masuugid
masuugnimo
masuugsan
masuugsanaan
masuugsanaansho
masuul
mas'uul
masuuliyad
mas'uuliyad
masuuliyo
mas'uuliyo
mataal
mataan¹
mataan²
mataanayn
mataanee
mataansan
mataansanaan
mataansanaansho
mataatac¹
mataatac²
mataatax¹
mataatax²
mataatax³
mataatax-biita
mataataxsan
mataataxsanaan
mataataxsanaansho
mataaticid
mataatixi
mataatixid
mataatixin
mataatulle
mataatullee
mataatulleyn
mataaxif
matag¹
matag²
matag³
matagid
mataji
matajin
matajis
matal¹
matal²
matalan
matalid
mataraariye
matatar¹
matatar²
matatari
matatarid
matatarin
matataris
matatarsan
matatarsanaan
matatarsanaansho
matax¹
matax²
mataxan
mataxnaan
mataxnaansho
mataxnow
matiitix¹
matiitix²
matiitixi
matiitixid
matiitixin
matiitixis¹
matiitixis²
matiitixsad
matiitixsan
matiitixsanaan
matiitixsanaansho
matiitixsasho
matiitixso
matil¹
matil²
matilaad
matilid
matirsame
matixid
matoobbe
matoobbo
matoor
matoor-danabeed
matoor
matooriste
matxaf
maw
mawaa
mawaashi
mawd
mawduuc
mawe
ma'wi
mawjad¹
mawjad²
mawjad-dayreed
mawjad-gaaban
mawjiid
mawlac
mawle
mawliid
mawqif
maxaa
maxaabiis
maxaad
maxaajiraa
maxaamil
maxaansugaa
maxaar
maxaawacay
maxaayeelay
maxabbo
maxaddo
maxajabad
maxajabo
maxal
maxammas¹
maxammas²
maxammasan
maxammasid
maxammasnaan
maxammasnaansho
maxamuudi
maxan
maxas
maxay
maxaysato
maxbuus
maxdin
maxile
maxisho
maxkamad
maxlal¹
maxlal²
maxlalan
maxlalasho
maxlalid
maxlalnaan
maxlalnaansho
maxlalo
maxmaas
maxmil¹
maxmil²
maxmilan
maxmilid
maxmilnaan
maxmilnaansho
maxmiyad
maxsuul-aayooneed
may
maya
mayaay¹
mayaay²
mayaayid
mayac¹
mayac²
mayacsan
mayacsanaan
mayacsanaansho
mayal
mayay¹
mayay²
mayayid
mayddi¹
mayddi²
maydhaamad
maydhaamasho
maydhaami
maydhaamid
maydhaamin
maydhaamis
maydhaamo
maydhaan¹
maydhaan²
maydhax¹
maydhax²
maydicid
maye
mayici
mayicid
mayicin
maykarafoon
mayl
mayl-badeed
mayli
mayliin
maylin
mayl-juqraafi
mayllin
mayoonge
mayr¹
mayr²
mayrac¹
mayrac²
mayracad
mayracasho
mayracid
mayraco
mayran¹
mayran²
mayraq
mayraqsan
mayraqsanaan
mayraqsanaansho
mayrasho
mayrax
mayraxsad
mayraxsasho
mayraxsi
mayraxso
mayricid
mayrid
mayrmid
mayrnaan
mayrnaansho
mayrniin
mayrnow
mayro¹
mayro²
mayruuf¹
mayruuf²
mayruufi
mayruufid
mayruufin
mayruufis¹
mayruufis²
maysiiliyam
maytokondoriya
maytoosis
med¹
med²
medan
medid
mednaan
mednaansho
mee
meecaad¹
meecaad²
meecaad³
meecaadi
meecaadid
meecaadin
meecaadsan
meecaadsanaan
meecaadsanansho
meeday
meedulla
meegaar¹
meegaar²
meegaaran
meegaarasho
meegaarid
meegaarnaan
meegaarnansho
meegaaro
meegaarsan
meegaarsanaan
meegaarsanaansho
meehaal
meehaalad
meehaalasho
meehaali
meehaalin
meehaalo
meehannaabid
meehannow¹
meehannow²
meel
meelaniin
meelanooma
meelayn
meelaysan
meelaysasho
meelaysnaan
meelaysnaansho
meelayso
meeldhexaad
meeldhexe
meelee
meelgaar¹
meelgaar²
meelgaarid
meelkadhac
meelkuggaar
meelmaag
meelmar¹
meelmar²
meelmari
meelmarid
meelmarin
meelmarsan
meelmarsanaan
meelmarsanaansho
meelnoqo
meelnoqosho
meemman
meeqa
meer¹
meer²
meeraxeer
meere-yare
meere¹
meere²
meeree
meereyn
meereysan
meereysasho
meereysnaan
meereysnaansho
meereyso
meeri
meerid
meerin
meeris¹
meeris²
meerkac-biyood
meerkac-dabayleed
meerkiyuuri
meerkiyuurik-salfaydh
meerkiyuuroos-koloraydh
meerkuri
meermeer¹
meermeer²
meermeeri¹
meermeerid
meermeerin
meermeeris¹
meermeeris²
meermeerto
meersan
meersanaan
meersanaansho
meersasho
meersi
meerso
meertada-Kaalfin
meertada-kaarboon
meertada-Kerb
meertammeerto
meertaysad
meertaysasho
meertaysi
meertayso
meerto
meesi
meesin
meesiyeyn
meetan
meetroo
meeyay
meeye
megag
megdee
megdeyn
megdeys
megdeysad
megdeysan
megdeysasho
megdeysi
megdeysnaan
megdeysnaansho
megdeyso
meged
mehee
meher
meherad
meheradlaawe
meheri
meherin
meherkahorreys
meherkaweyne
mehersad
mehersan
mehersanaan
mehersanaansho
mehersanow
mehersasho
mehersi
meherso
meherxad¹
meherxad²
meherxadid
mehi
mehin
mekaaniko
mekhaan
melay
meleg¹
meleg²
melgid
menijiito
meraayo
mereg
meregsan
meregsanaan
meregsanaansho
mergan
merganaan
merganaansho
mergasho
mergaysan
mergaysnaan
mergaysnaansho
mergi¹
mergi²
mergin
mergis
mergo¹
mergo²
meriid
merji
merjin
merjis
meryaad¹
meryaad²
meryaadi
meryaadid
meryaadin
meryaadis
mesder
meseggo
mesel¹
mesel²
meselid
metafisikis
metasoowa
metel¹
metel²
metelid
meyd
meygaag
meyoosis
meytakaal¹
meytakaal²
meytakaalasho
meytakaalid
meytakaalo
meyti
meyto
mi'
micaahido
micayn
micays
mici
micigabaar
micigabaarrey
miciin¹
miciin²
miciindarro
miciinid
miciinla'aan
miciinlaawe
miciinsad
miciinsasho
miciinsi
miciinso
micilisad
micilisasho
miciliso
micis
miciyalisad
miciyalisasho
miciyaliso
miciyee
miciyeyn
micnagarasho
micnagaro
micnayn
micnays
micne
micnee
micno
micraaj
micyaan
mid¹
mid²
mid³
midaal
midaar¹
midaar²
midaarid
midab
midab-arag-la'aan
midabayn
midabaysan¹
midabaysan²
midabaysasho
midabaysmid
midabaysnaan
midabaysnaansho
midabayso
midabbayn
midabbee
midabdoori
midabdoorin
midabee
midabfaquuq¹
midabfaquuq²
midabfaquuqid
midabgaddoomid
midabgaddoon¹
midabgaddoon²
midabgumaysasho
midabgumaysi
midabgumayso
midabsawir-saafid
midabside
midabtakoor¹
midabtakoor²
midabtakoorid
midbayn
midbee
midbo
middaad
middi
middiil
midee
mideyn
mideysan
mideysii
mideysiin
mideysnaan
mideysnaansho
mideysnow
midid
midig
midigee
midigeyn
midigsaar¹
midigsaar²
midigsaarid
midiid¹
midiid²
midiidid
midiidimi
midiidimid
midiidimin
midiidimis¹
midiidimis²
midiidin¹
midiidin²
midiidinnimo
midiidinsad
midiidinsasho
midiidinsi
midiidinso
midnimo
midoobid
midow¹
midow²
midxin
miftaax
mihi
mihiib¹
mihiib²
mihiibi
mihiibid
mihiibin
mihiibsasho
mihiibsii
mihiibsiin
mihiibso
mihiigaan
mihiigaannimo
mihin
mihindis¹
mihindis²
mihindisid
mihindisoo
mihindisood
mihinse
mihnad
mi'i
miibac
miicila'
miid
miidaami
miidaamin
miidaamis
miidaamo
miidaan¹
miidaan²
miidaanday
miidaandayid
miidaansan
miidaansanaan
miidaansanaansho
miidayn
miiddan
miiddanaan
miiddanaansho
miidee
miidoobid
miidow
miig¹
miig²
miigasho
miige
miigee
miigeyn
miigeysan
miigeysnaan
miigeysnaansho
miiggan
miigganaan
miigganaansho
miigid
miigo¹
miigo²
miiji
miijin
miijis
miijisan
miijisnaan
miijisnaansho
miil
miilaaddiyad
miilaadi
miilasho
miile
miilee
miileyn
miileysad
miileysasho
miileysi
miileyso
miilo¹
miilo²
miin¹
miin²
miinayn
miinaysan
miinaysasho
miinaysnaan
miinaysnaansho
miinayso
miinee
miino
miinshaar¹
miinshaar²
miinshaaree
miinshaareyn
miiq¹
miiq²
miiq³
miiqan¹
miiqan²
miiqasho
miiqid
miiqmid
miiqnaan
miiqnaansho
miiqo
miiq-ruxasho
miir¹
miir²
miir³
miira
miiraale
miiran¹
miiran²
miire
miiri
miirid¹
miirid²
miirin
miiris
miirmid
miirnaan
miirnaansho
miiroole
miirow
miirran
miirranaan
miirranaansho
miirranow
miirrif
miirsad
miirsasho
miirsi
miirsidiid
miirsidiidnimo
miirso
miis¹
miis²
miisaali
miisaaman
miisaamasho
miisaamid
miisaamo
miisaan¹
miisaan²
miisaanan
miisaanasho
miisaanid
miisaaniyad
miisaannaan
miisaannaansho
miisaano
miisad
miisan
miisasho
miisgool
miishaar¹
miishaar²
miishaaree
miishaareyn
miishmiishad
miishmiisho
miisid
miiso
miitaali
mijabbaxsad
mijabbaxsasho
mijabbaxsi
mijabbaxso
mijagoror¹
mijagoror²
mijagorori
mijagororid
mijagororin
mijagororsan
mijagororsanaan
mijagorosanaansho
mijarrogasho
mijarrogo
mijarroor¹
mijarroor²
mijarroori
mijarroorid
mijarroorin
mijarroorsan
mijarroorsanaan
mijarroorsanaansho
mijasaar¹
mijasaar²
mijasaarid
mijaxaabi
mijaxaabis
mijaxaabo
mijilic¹
mijilic²
mijilicid
mijilis
mijin
mijirkoos
mikroskoob
mil¹
mil²
milaad
milaadi
milaadin
milaadsasho
milaadso
milaal¹
milaal²
milaalan¹
milaalan²
milaalid
milaalmid
milaalnaan
milaalnaansho
milan-caadi
milan-sare
milan¹
milan²
milan³
milan4
milan-hoose
milan-joogtayn
milay
milcis
mile
milgee
milgeyn
milgeysasho
milgeyso
milgo
milic
milicsad
milicsasho
milicsi
milicso
milid
milif
miliilic¹
miliilic²
miliilicasho
miliilicid
miliilico
milikh
milil¹
milil²
mililid
mililig
mililigeyn
mililiglee
mililikh
mililikhsan
mililikhsanaan
mililikhsanaansho
miliq¹
miliq²
miliqsan
miliqsanaan
miliqsanaansho
militeri
milix
milixayn
milixaysan
milixaysnaan
milixaysnaansho
milixee
milixi
milixin
milixsanaan
milki¹
milki²
milkiyid
millad
milligraam
millilitir
millimitir
milliqsad
milliqsasho
milliqsi
milliqso
milme
milmid
milmil
milnaan
milnaansho
milnow
milqi
milqid
milqin
milqis
milshi¹
milshi²
milshiyid
miltami
miltamid
miltamin
miltan¹
miltan²
miltansasho
miltanso
milxayn
milxaysan
milxaysnaan
milxaysnaansho
milxee
milxi
milxin
milyan
mimbar
min¹
min²
minaaq
minaarad
minaawar
minan
minbeer
mindhaa
mindheelli
mindhicir¹
mindhicir²
mindhicirisdab
mindhismo
mindi
mindiil
mindirraaci
mindirraacin
mindirraacis
mindumis
minfiiq
minfilaad
minfilaad²
minfilaadid
mingeliyo
mingelyo
mingis
minguuri
minguurin
minguuris
minii
minjabbaxsad
minjabbaxsasho
minjabbaxsi
minjabbaxso
minjagoror¹
minjagoror²
minjagorori
minjagororid
minjagororin
minjagororsan
minjagororsanaan
minjagororsanaansho
minjarrogasho
minjarrogo
minjarroor¹
minjarroor²
minjarroori
minjarroorid
minjarroorin
minjarroorsan
minjarroorsanaan
minjarroorsanaansho
minjasaar¹
minjasaar²
minjasaarid
minjaxaabi
minjaxaabin
minjaxaabis
minjaxaabo
minnasheegad
minnasheegasho
minnasheego
minnee
minneyn
minneysasho
minneyso
minno
mino
minqaad¹
minqaad²
minqaadi
minqaadid
minqaadin
minqax¹
minqax²
minqaxwe
minqixid
mintid¹
mintid²
mintidid
mintidnimo
minweyn
minxiis
minyaro
miqdaaf
miqdaafi
miqdaafin
mir¹
mir²
mir³
miraaf¹
miraaf²
miraafid
miraale
miraayad
miraayo
miracas
miran
mirasho
miratahan
miraxareedaad
mirayn
miraysasho
mirayso
mircanyo
mirdareer
mirdareerid
mirdhi
mirdhid
mirdhin
mirdhis¹
mirdhis²
miree
mirgi
mirgin
mirgis
mirid
miridhee
miridheyn
miridho
mirif
mirigsii
mirigsiin
mirimmiri
miriq¹
miriq²
miriqshaanle
miriqshaanlee
miriqshaanleyn
miriqshaanleys
mirir¹
mirir²
miriri
miririd
miririg
miririglee
miririgleyn
miririn
mirirsan
mirirsanaan
mirirsanaansho
mirji
mirjin
mirjis¹
mirjis²
mirkac¹
mirkac²
mirkici
mirkicid
mirkicin
mirnaan
mirnaansho
miro¹
miro²
mirqid
mirraw
mirriji
mirrijin
mirriq
mirriqsad
mirriqsasho
mirriqsi
mirriqso
miryaad¹
miryaad²
miryaadi
miryaadid
miryaadin
miryaadis
misaal
misana
misbaax
miscilil¹
miscilil²
miscililasho
miscilili
miscililid
miscililin
miscililo
miscililsan
miscililsanaan
miscililsanaansho
miscililsasho
miscililso
miscirir
mise¹
mise²
misee
miseyn
mishaari
mishaariyee
mishaariyeyn
mishiggaan
mishiin
misig
misil
misir
miski
miskiin¹
miskiin²
miskiinad
miskiinlaa
miskiinnimo
mislee
misleyn
misna
misoobid
misow
mistisiimo
mitaal
mitami
mitamid
mitamin
mitan¹
mitan²
mitansasho
mitanso
mitid¹
mitid²
mitidid
mitidnimo
mitimiye
mitir¹
mitir²
mitiri
mitirin
mitiris
mitirkubbe
mitirsad
mitirsan
mitirsanaan
mitirsanaansho
mitirsasho
mitirsi
mitirso
mixdin
mixnad
mixno
mixraab
miyaa
miyelooma
miyi
miyid
miyir
miyir-beel-gaaban
miyirbeel¹
miyirbeel²
miyirbeel³
miyirbeelid
miyiri
miyirin
miyirsad
miyirsasho
miyirsi
miyirso
miyirtir
miyirtirid
miyobi
mocooyo
mohaar
mohasho
mohi
mohin
mohis
moho
mohoor
mohorad
mohosho
mokhoddan
mokhoddon
mokhoor¹
mokhoor²
mokhoorid
mongolisam
monosakaraydh
moobil
mood¹
mǫod¹
mood²
mǫod²
mooddo
moodid
moodo
moodsan
moodsanaan
moodsanaansho
moodsasho
moodsii
moodsiin
moodsiis
moodso
moofayn
moofee
moofo
moog¹
moog²
moogaan
moogaansho
moogeysii
moogeysiin
moogeysiis
moogow
moogtamid
moogtan¹
moogtan²
moohaari
moohaarin
moohaarsan
moohaarsanaan
moohaarsanaansho
mool
moolal
moolarnaan
moolaska
moole
moolikiyuul
moolikiyuul-cirifle
moolikiyuul-weyne
moollee
moolleyn
moolleys
moollo
moolnimo
moolo
moomah
moonooboli
moonosayt
moor
mooradduug¹
mooradduug²
mooradduugid
moorayn
moorays
mooraysad
mooraysan
mooraysasho
mooraysi
mooraysnaan
mooraysnaansho
moorayso
moordi
moordoobid
moordow¹
moordow²
mooree
moorif
mooro
mooryaan
moos¹
moos²
moos³
moosan
moosasho
moos-bukeeni
moosdameeri
moosid
moosin
moosnaan
moosnaansho
mooso
moos-wabiyeed
mootan
mootanaan
mootanaansho
mooti
mootin
mooto
mooy
mooyaane
mooye
mooyee
mooyiye
moqor
moqor-sambabeed
moqorka-kalka-wadnaha
moqorof
moqorsasho
moqorso
moqotin
moraal
morayn
morfiin
morfooloji
moroh
motoor
motooriste
motootax¹
motootax²
motootaxsan
motootaxsanaan
motootaxsanaansho
motootixi
motootixid
motootixin
mowd
mowhibo
mowjad
mowlac
mowle
mowliid
mowluud
mowqif
mowti
mowto
moxog
moxoggo
moxor
moxorcad
moxorcadde
moxorlo'
moxormadoobe
moxormadow
moy
mu'aammarad
mu'addin
mu'allif
mu'asas
mubaax
muc
mucaahido
mucaarad
mucaaradnimo
mucaawinad
mucaawino
mucatab
mucayin
mucjiso
mucurteysan
mucurteysnaan
mucurteysnaansho
mucurti
mucurtiyeysan
mucurtiyeysnaan
mucurtiyeysnaansho
mucurto
mucurtoo
mucurtood
mud
mųd
mudaa
mudaaharaad¹
mudaaharaad²
mudaaharaadid
mudaal
mudac
mudac-middiil
mudan¹
mųdan¹
mudan²
mųdan²
mudan³
mudane
mudanti
mudasho
mųdasho
mudbax¹
mudbax²
mudbaxsan
mudbaxsanaan
mudbaxsanaansho
mudbixi
mudbixid
mudbixin
muddaahanee
muddaahaneyn
muddaahano
muddaaharaad¹
muddaaharaad²
muddaaharaadid
muddaahinee
muddaahineyn
muddaahino
muddac¹
muddac²
muddac-calayhi
muddamdam
muddamdamnimo
muddee
muddeec
muddeecnimo
muddeyn
muddeysan
muddeysnaan
muddeysnaansho
muddici
muddicid
muddiic
muddiicinnimo
muddo
muddug
muddugan
muddugnaan
muddugnaansho
muddugnimo
muddugsan
muddugsanaan
muddugsanaansho
muddul
mu'di
mudid
mu'dinnimo
mudmid
mudnaan
mųdnaan
mudnaansho
mųdnaansho
mudniin
mudnow
mųdnow
mudo
mųdo
mudri
mudrin
mudris
mudur
mudursad
mudursan
mudursanaan
mudursanaansho
mudursasho
mudursi
mudurso
mudutuul
mufanid
mufanidnimo
mufsid
mufsidnimo
muftaax
mufti
mug
mugdi
mug-saafid
muhaajir
muhasho
muhi
muhiimmad
muhiimmo
muhiimnimo
muhim
muhimmad
muhimmo
muhimnimo
muhin
muhis
muho
mujaahid¹
mujaahid²
mujaahidid
mujarrab
mujrim
mujtahid
mujtamac
mujuruc
mukaaw
mukallaf
mukay
mukhaaddaraad
mukhaalafo
mukhaawi
mukhlis
mukhlisnimo
mukhuur¹
mukhuur²
mukhuurid
mukhuurin
mukhuursan
mukhuursanaan
mukhuursanaansho
mukul
mukulaal
mukulaalduureed
mukulaalsabaad
mukur
mulac
mulacyayn
mulacyays
mulacyee
mulbi
mulbin
mulbis
mulbisasho
mulbiso
muldhi
muldhin
muldhisan
muldhisasho
muldhisnaan
muldhisnaansho
muldhiso
muleemi
muleemin
muleemis
mulki¹
mulki²
mulkiyid
mullaax
mullaaxi
mullaaxin
mullaaxis
mullaaxsad
mullaaxsasho
mullaaxsi
mullaaxso
mullaay
mulli¹
mulli²
muluf
mulul¹
mulul²
mululi
mululid
mululin
mululrimid
mululrin¹
mululrin²
muluq¹
muluq²
muluqmuluq
muluqmuluqlayn
muluqmuluqlee
mulux
mulxid¹
mulxid²
mulxidnimo
mu'min
mu'minnimo
munaaddee
munaaddeyn
munaaddo
munaafaq
munaafaqnimo
munaasab
munaasabo
munaasib
mundul
mundulle
munkar
munnaarad
munshaar
munshaaro
muqaaddaraad
muqaal
muqaal-dambe
muqaddas
muqarrar
muqdaaf
muqdaafi
muqdaafin
muqlay
muqlaysan
muqlaysnaan
muqlaysnaansho
muqle
muqleeye
muqlo
muqloo
muqloobid
muqlood
muqlow¹
muqlow²
muqmad
muqmadayn
muqmadaysan
muqmadaysnaan
muqmadaysnaansho
muqmadee
muqshabeel
muqsul
muquuf¹
muquuf²
muquufid
muquuni
muquunin
muquuno
muquunsad
muquunsasho
muquunso
muquur¹
muquur²
muquuri
muquurid
muquurin
muquursan
muquursanaan
muquursanaansho
muquus¹
muquus²
muquusid
mųr
mur¹
mur²
mur³
muraad¹
muraad²
muraaddee
muraaddeyn
muraaddo
muraadi
muraadid
muraadin
muraadsad
muraadsasho
muraadsi
muraadso
muraajaco
muraaqo
muraaqoo
muraaqood
muraaradillaac¹
muraaradillaac²
muraaradillaaci
muraaradillaacid
muraaradillaacin
muraayad
muraayo
murabbi
muran¹
muran²
muransan
muransanaan
muransanaansho
murbax¹
murbax²
murbaxsan
murbaxsanaan
murbaxsanaansho
murbay
murbixi
murbixid
murbixin
murbooc
murcanyo
murcood
murcud
murdad
murdi
murdin
murdis
murdiso
murdud
murdux
murduxan
murduxnaan
murduxnaansho
murgacad
murgacasho
murgaco
murgacsan
murgacsanaan
murgacsanaansho
murgi
murgici
murgicin
murgid
murgin
murgoco
murgoo
murgood
murgucad
murgucasho
murguco¹
murguco²
murgucsan
murgucsanaan
murgucsanaansho
murgux
murguxan
murguxnaan
murguxnaansho
murguxsan
murguxsanaan
murguxsanaansho
muri
murid
muriid
murin
murjaan¹
murjaan²
murjeen
murji
murjin
murjis¹
murjis²
murjuc
murjuq
murjux
murke
murkucad
murkucasho
murkuco¹
murkuco²
murkucsan
murkucsanaan
murkucsanaansho
murkud
murmi
murmid
murmin
murqaami
murqaamid
murqaamin
murqaan¹
murqaan²
murqaansan
murqaansanaan
murqaansanaansho
murqaansanow
murray
murre
murriyad
murriyo
mursasho
murso
murtad
murtadnimo
murti
murtiyee
murtiyeyn
murtiyeysan
murtiyeysnaan
murtiyeysnaansho
murud
murudsad
murudsasho
murudsato
murudso
muruf
murug¹
murug²
murug³
murugee
murugeyn
murugeysan
murugeysnaan
murugeysnaansho
murugo¹
murugo²
murugoo
murugood
murugsad
murugsan
murugsanaan
murugsanaansho
murugsanow
murugsasho
murugsato
murugso
muruq-diillimaysan
muruq-iraadi-ah
muruq-iraadla'
muruq-miiqle
muruq-sisiban
muruq¹
muruq²
muruqmaal
muruqmaalid
muruq-roor
muruqxanuun
murux¹
murux²
muruxsan
muruxsanaan
muruxsanaansho
murwee
murweyn
murweysan
murweysnaan
murweysnaansho
murwo
murxi
murxid
murxin
mus
musaafur¹
musaafur²
musaafuri
musaafurid
musaafurin
musaafuris
musaafursan
musaafursanaan
musaafursanaansho
musaafursanow
musallad
musalladnimo
musallaf¹
musallaf²
musallafi
musallafid
musallafin
musallafnimo
musallafsan
musallafsanaan
musallafsanaansho
musallif¹
musallif²
musallifi
musallifid
musallifin
musallifnimo
musallifsan
musallifsanaan
musallifsanaansho
musannif
musannifnimo
musaraar¹
musaraar²
musaraarid
musaraarsan
musaraarsanaan
musaraarsanaansho
musareed
musareen
musareer¹
musareer²
musareerid
musareersan
musareersanaan
musareersanaansho
musbaar¹
musbaar²
musbaaran
musbaarasho
musbaarid
musbaarnaan
musbaarnaansho
musbaaro
musbaax
mushaalli
mushaalliyee
mushaalliyeyn
mushaar
mushaari
mushaariyee
mushaariyeyn
mushaaro
mushaax¹
mushaax²
mushaaxid
mushkilad
mushkilo
mushqaayad
mushrig
mushtaki
mushtar
mushtari
mushteeg¹
mushteeg²
mushteegid
musiibo
muskullux
muslimad
muslimi
muslimid
muslimin
muslin¹
muslin²
muslinnimo
musmaar¹
musmaar²
musmaaran
musmaarasho
musmaarid
musmaarnaan
musmaarnaansho
musmaaro
musqul
mustacmarad
mustacmir
mustagfi
mustagfinnimo
mustakafi
mustakafinnimo
mustaqbal
mustareex¹
mustareex²
mustareexi
mustareexid
mustareexin
mustareexsan
mustareexsanaan
mustareexsanaansho
musuqmaasuq¹
musuqmaasuq²
musuqmaasuqid
musuraar¹
musuraar²
musuraarid
musuraarsan
musuraarsanaan
musuraarsanaansho
mutacallin
mutakafi
mutakafinnimo
mu'tamir
muteysasho
muteysii
muteysiin
muteyso
mutixid
mutumaad
mutuutax¹
mutuutax²
mutuutaxsan
mutuutaxsanaan
mutuutaxsanaansho
mutuutixi
mutuutixid
mutuutixin
mutux¹
mutux²
mutuxan
mutuxid
mutuxnaan
mutuxnaansho
mutuxnow
muud¹
muud²
muud³
muudaa
muudal
muudi
muudid
muudin
muudsasho
muudsii
muudsiin
muudso
muufayn
muufee
muufo
muug
muuji
muujin
muujis
muul
muumin
muuminnimo
muun
muunad
muunadayn
muunadaysan
muunadaysnaan
muunadaysnaansho
muunadee
muunajab¹
muunajab²
muunajebi
muunajebid
muunajebin
muunayn
muunaysan
muunaysnaan
muunaysnaansho
muunee
muuno
muuq
muuqaal¹
muuqaal²
muuqaalceli
muuqaalcelin
muuqad
muuqasho
muuq-doori
muuqo
muuqsheeg
muurrayn
muurree
muurri
muurrin
muursasho
muursii
muursiin
muurso
muus¹
muus²
muusaabid
muusannaabid
muusannow¹
muusannow²
muusaw
muusid¹
muusid²
muusika
muusiqa
muuso
muusoo
muusood
muwaaddin
muwaafaqo
muxaadarad
muxaadaro
muxtaaj
muxubbo
