q
qaab¹
qaab²
qaaban¹
qaaban²
qaabbil¹
qaabbil²
qaabbilaad
qaabbilid
qaabbilo
qaabbilsan
qaabbilsanaan
qaabbilsanaansho
qaabbilsii
qaabbilsiin
qaabdaran
qaabdarnaan
qaabdarnaansho
qaabdarri
qaabdarro
qaab-dhuleed
qaabi
qaabid
qaabile-kiimikaad
qaabin
qaabis
qaablaawe
qaabmid
qaabnaan
qaabnaansho
qaabsamaan
qaabsamaansho
qaabsami
qaabsamo
qaabsan¹
qaabsan²
qaabsanaan
qaabsanaansho
qaabuuli
qaabxumaan
qaabxumaansho
qaabxumi
qaabxumo
qaabxun
qaac¹
qaac²
qaaci
qaacid
qaacido
qaacin
qaad¹
qaad²
qaadaadhig¹
qaadaadhig²
qaadaadhigid
qaadasho
qaaddac
qaaddacaad
qaaddan
qaaddanaan
qaaddanaansho
qaaddi
qaaddicid
qaaddiro
qaaddo
qaadid
qaadis
qaado
qaadqaad¹
qaadqaad²
qaadqaadid
qaadqamax
qaadsii
qaadsiin
qaadsiis
qaadwale
qaaf
qaafee
qaafeyn
qaafi
qaafil
qaafilo
qaafiri
qaafiyad
qaafiyo
qaafo
qaa'id
qaajabbeel¹
qaajabbeel²
qaajabbeelid
qaajay
qaajaysan
qaajaysnaan
qaajaysnaansho
qaaje
qaajeer
qaajo
qaajoo
qaajood
qaal
qaalaamarogad
qaalaamarrogasho
qaalaamarrogo
qaalalyo
qaalalyoo
qaalalyoobid
qaalalyood
qaalalyow
qaalee
qaaley
qaaleyn
qaali
qaalib
qaaligarayn
qaaligaree
qaaligaroobid
qaaligarow
qaalin¹
qaalin²
qaaliyee
qaaliyeyn
qaaliyoobid
qaaliyow
qaalli
qaalmaqooqshe
qaalmarrogad
qaalmarrogasho
qaalmarrogo
qaalmooti
qaalmootin
qaalmootis
qaaloobid
qaalow
qaambax
qaambixid
qaamee
qaameyn
qaameysan
qaameysnaan
qaameysnaansho
qaamid
qaamoobid
qaamow
qaamowqanshiir¹
qanjirada
qaamowqanshiir²
qaamuus
qaan¹
qaan²
qaan³
qaanbax
qaandhaw¹
qaandhaw²
qaandhebid
qaandhow¹
qaandhow²
qaangaar¹
qaangaar²
qaangaarid
qaangal
qaangelid
qaanqaami
qaanqaamin
qaanqaanni
qaansaley
qaansaqumiye
qaansada
qaansarroobaad¹
qaansarroobaad²
qaansheeg
qaansheegte
qaanso¹
qaanso²
qaanso
qaansoley
qaansoole
qaanuun
qaaq
qaaqami
qaaqamid
qaaqamin
qaaqamis
qaaqan
qaaqle
qaaqlee
qaaqleyn
qaar¹
qayb
qaar²
qaar³
qaaraami
qaaraamid
qaaraan¹
qaaraan²
qaarad
qaarayn
qaarbuuco
qaarbuuxo
qaardheere
qaare
qaaree
qaarid
qaaris
qaarjeex
qaarood
qaarqaad¹
qaarqaad²
qaarqaadid
qaarqaaqan
qaarri
qaarrin
qaarris
qaarsan
qaarsanaan
qaarsanaansho
qaarxabaal¹
qaarxabaal²
qaarxabaalid
qaash
qaashaaran
qaashaarasho
qaashaaro
qaate
qaatil
qaatime
qaatimee
qaatimeyn
qaatin
qaawan
qaawanaan
qaawanaansho
qaawanow
qaawi
qaawin
qaawisasho
qaawiso
qaaxayn
qaaxee
qaaxo¹
qaaxo²
qaaye
qaayib¹
qaayib²
qaayibid
qaayimo
qab¹
qab²
qab³
qabaal¹
qabaal²
qabaanqab¹
qabaanqab²
qabaanqab³
qabaanqabid
qabad
qabadnimo
qabadsii
qabadsiin
qabalax
qabalaxsan
qabalaxsanaan
qabalaxsanaansho
qaballuus
qaballuusnimo
qabandhaco
qabandhacoo
qabandhacood
qabanqaabi
qabanqaabin
qabanqaabo
qabasho
qabatimid
qabatin¹
qabatin²
qabatin³
qabato
qabatoomid
qabatoon¹
qabatoon²
qabax
qabay
qabayaro
qabbaan¹
qabbaan²
qabbaan³
qabbaanid
qabbaansad
qabbaansasho
qabbaansi
qabbaanso
qabbil
qabbilid
qabbir¹
qabbir²
qabbiran
qabbirasho
qabbirid
qabbirnaan
qabbirnaansho
qabbiro
qabco
qabdhan
qabee
qabeyn
qabeys
qabeysasho
qabeyso
qabid
qabiil
qabiili
qabiilo
qabiix
qabil
qablamid
qablan¹
qablan²
qablax
qablaxsan
qablaxsanaan
qablaxsanaansho
qabno
qabo¹
qabo²
qaboobaan
qaboobaansho
qaboobe
qaboobid
qaboobow
qabooji
qaboojin
qaboojisasho
qaboojiso
qaboojiye
qaboone
qaboono
qabow¹
qabow²
qabow³
qabowsasho
qabowso
qaboyaro
qabqab
qabqable
qabqabow
qabri
qabsad
qabsan
qabsanaan
qabsanaansho
qabsasho
qabsato
qabsin
qabsin-ood
qabsin-oodan¹
qabsin-oodan²
qabsin-oodane
qabsin-oodmid
qabso
qabsoomid
qabsoon
qabuul
qabuuro
qabweyn
qabweynaan
qabweynaansho
qabweyni
qabxad
qabxo
qabyaalad
qabyaaladayn
qabyaaladee
qabyaalad
qabyo
qabyoobid
qabyow
qac
qacqac
qad¹
qad²
qadaad¹
qadaad²
qadaadan
qadaadid
qadaadnaan
qadaadnaansho
qadaf¹
qadaf²
qadan
qadaysii
qadaysiin
qaddac¹
qaddac²
qaddacan
qaddacnaan
qaddacnaansho
qaddar¹
qaddar²
qaddar³
qaddaran
qaddari
qaddarid
qaddarin
qaddaris
qaddarjab¹
qaddarjab²
qaddarjaban
qaddarjabi
qaddarjabid
qaddarjabin
qaddarjabnaan
qaddarjabnaansho
qaddarjabsan
qaddarjabsanaan
qaddarjabsanaansho
qaddarjebi
qaddarjebid
qaddarjebin
qaddarnaan
qaddarnaansho
qaddicid
qaddiifad
qaddiman
qaddimid
qaddimnaan
qaddimnaansho
qaddin
qaddiyad
qadduun
qadee
qadeyn
qadeysii
qadeysiin
qadfan
qadfanaan
qadfanaansho
qadfid
qadhin
qadi¹
qadi²
qadid
qadiid
qadiidi
qadiidin
qadiidsan
qadiidsanaan
qadiidsanaansho
qadiim
qadiin¹
qadiin²
qadin
qadis
qado
qadoodi
qadow¹
qadow²
qadsan
qadsanaan
qadsanaansho
qadsanow
qadwid
qafaal¹
qafaal²
qafaalan
qafaalasho
qafaalid
qafaalnaan
qafaalnaansho
qafaalo
qafal
qafalmardax
qafalmarjac
qafas
qafil¹
qafil²
qafilan
qafilasho
qafilid
qafilnaan
qafilnaansho
qafilo
qafis
qafish
qaflad¹
qaflad²
qaflamid
qaflan¹
qaflan²
qaflanaan
qaflanaansho
qaflasho
qaflid
qaflo¹
qaflo²
qafro
qahar¹
qahar²
qahraan
qahran
qahranaan
qahranaansho
qahrid
qahwe
qajaaful
qajaar
qajac
qajajac
qajeel¹
qajeel²
qajeelid
qal¹
qal²
qalaad
qąlaad¹
qąlaad²
qąlaadid
qalaamaanyo
qalaanqal¹
qalaanqal²
qalaanqalmadow
qalab
qalabayn
qalabee
qal-aboodi
qalad¹
qalad²
qalaggoo
qalaggoyn
qalal
qalalaas
qalalaase
qalalaaso
qalalab
qalalabi
qalalabin
qalalabsasho
qalalabso
qalamaanyo
qalami¹
qalami²
qalammi
qalan¹
qalan²
qalanjo
qalasho
qalaw
qalawille
qalawle
qalawo
qalax
qalayn
qalays
qalaysan
qalaysasho
qalaysi
qalaysnaan
qalaysnaansho
qalayso
qalbac
qalbi
qalbidaciif
qalbifarnaan
qalbifarnaansho
qalbifuran
qalbifurnaan
qalbifurnaansho
qalbifurnow
qalbifurraan
qalbifurraansho
qalbifurrow
qalbijab¹
qalbijab²
qalbijebi
qalbijebid
qalbijebin
qalbisamaan
qalbisamaansho
qalbisami
qalbisamo
qalbisamow
qalbisan
qalbisnaan
qalbisnaansho
qalbixumaan
qalbixumaansho
qalbixume
qalbixumeyn
qalbixumi
qalbixumo
qalbixumow
qalbixun
qalcad
qalco
qaldamid
qaldan¹
qaldan²
qaldanaan
qaldanaansho
qaldhac¹
qaldhac²
qaldhacan
qaldhacnaan
qaldhacnaansho
qaldheb
qaldhebid
qaldhex
qaldhicid
qaldhocod
qaldhow
qaldid
qalee
qaleyn
qaleys
qaleysan
qaleysnaan
qaleysnaansho
qalfaad¹
qalfaad²
qalfaadid
qalfoof
qalfoon
qalid
qaliid
qalin
qalindaar¹
qalindaar²
qalindaarasho
qalindaarid
qalindaaro
qalinduurre
qalinjebi
qalinjebin
qalinmadow
qalinshubato
qalinshube
qallaafo
qallaal¹
qallaal²
qallac¹
qallac²
qallacan
qallacid
qallacnaan
qallacnaansho
qallaco
qallad¹
qallad²
qalladasho
qallado
qallaf¹
qallaf²
qallafi
qallafid
qallafin
qallafsan
qallafsanaan
qallafsanaansho
qallaji
qallajin
qallajis¹
qallajis²
qallal¹
qallal²
qallalan
qallalid
qallalnaan
qallalnaansho
qallax¹
qallax²
qallaxan
qallaxnaan
qallaxnaansho
qallayl
qallayn
qalle
qallee
qalleyf
qallib¹
qallib²
qallibaad
qalliban¹
qalliban²
qallibid
qallibmid
qallibnaan
qallibnaansho
qallicid
qalliin¹
qalliin²
qallixid
qallooc¹
qallooc²
qallooc³
qalloocan
qalloocasho
qallooci
qalloocid
qalloocin
qalloocnaan
qallooco
qalloocsan
qalloocsanaan
qalloocsanaansho
qalloocsasho
qalloocsi
qalloocso
qalluud¹
qalluud²
qalluudid
qalluudsan
qalluudsanaan
qalluudsanaansho
qalluul¹
qalluul²
qalluulid
qalmaan
qalmashube
qalmid
qalnaan
qalnaansho
qalniin
qalo¹
qalo²
qalo³
qaloo
qalood
qaloombi¹
qaloombi²
qaloombin
qaloombiyid
qaloon
qaloondub
qaloonfirdhis
qalow
qalowle
qalowlee
qalowleyn
qalqaali
qalqaalin
qalqaalis
qalqaalli
qalqaalo
qalqal¹
qalqal²
qalqale
qalqali
qalqalid
qalqalin
qalqalli
qalqalsan
qalqalsanaan
qalqalsanaansho
qalwayn
qalwee
qalwi
qalwin
qalwis
qalwo
qalyaro
qalyayax
qalyayaxsan
qalyayaxsanaan
qalyayaxsanaansho
qamaamid
qamaamud¹
qamaamud²
qamaamudan
qamaamudid
qamaamudnaan
qamaamudnaansho
qamaan¹
qamaan²
qamadi
qamandhaceysan
qamandhaceysnaan
qamandhaceysnaansho
qamandhaco
qamandhacoo
qamandhacood
qamanyuus
qamarshiid¹
qamarshiid²
qamarshiidan
qamarshiidid
qamarshiidnaan
qamarshiidnaansho
qambarac
qambaruur
qambaruursan
qambaruursanaan
qambaruursanaansho
qambaruursasho
qambaruurso
qamboob¹
qamboob²
qamiic¹
qamiic²
qamiicid
qamiicsan
qamiicsanaan
qamiicsanaansho
qamiir¹
qamiir²
qamiiri
qamiirid
qamiirin
qamiirsan
qamiirsanaan
qamiirsanaansho
qamiirsasho
qamiirsi
qamiirso
qamir¹
qamir²
qamirid
qamis¹
qamis²
qamisan
qamisasho
qamisid
qamisnaan
qamisnaansho
qamiso
qammaac¹
qammaac²
qammaacid
qammaad¹
qammaad²
qammaadi
qammaadid
qammaadin
qammaadsan
qammaadsanaan
qammaadsanaansho
qammaamiir
qammaamuur
qammi
qamuunyeeysan
qamuunyeysnaan
qamuunyeysnaansho
qamuunyo
qamuunyoo
qamuunyood
qamuuri
qamuurin
qamuuris
qamuursan
qamuursanaan
qamuursanaansho
qan
qanaan¹
qanaan²
qanaani
qanaanin
qanaat
qanabee
qanabeyn
qanabo
qanac¹
qanac²
qanacsan
qanacsanaan
qanacsanaansho
qanax
qanci
qancid
qancin
qancis
qandac¹
qandac²
qandacsan
qandacsanaan
qandacsanaansho
qandacsasho
qandacsi
qandacso
qandal
qandaraas
qandhada-deng
qandhaggalti
qandhar
qandhasho
qandhee
qandheyn
qandheysan
qandheysnaan
qandheysnaansho
qandhi
qandhicil
qandhin
qandhiso
qandho¹
qandho²
qandho³
qandho-baaratifo
Baktiiriyada
qandhoo
qandhood
qandho-tifow
qandhuufad
qandhuufasho
qandhuufo¹
qandhuufo²
qandhuur
qandi
qandici
qandicid
qandicin
qandicis
qandiir¹
qandiir²
qandiiri
qandiirid
qandiirin
qandood¹
qandood²
qandoodid
qanduur
qaneecaad¹
qaneecaad²
qaneecaadid
qaneeco
qani
qaniimad
qaniimeysad
qaniimeysasho
qaniimeysi
qaniimeyso
qaniimo
qaniin¹
qaniin²
qaniinid
qaniinsii
qaniinsiin
qaniinyo
qaninnimo
qanjaaful
qanjad
qanjaruufasho
qanjaruufo¹
qanjaruufo²
qanje
qanjidh
qanjidh-taymas
qanjidh-dhidid
qanjidhka-tayroydh
qanjidh-kelyood
qanjidh-marinla'
qanjidhada-marinkala'
qanjidh-marinleh
qanjidh-tarmeed
qanjiiri
qanjiirin
qanjiiro
qanjir¹
qanjir²
qanjirabarar
qanjirbarar¹
qanjirbarar²
qanjir-bituwitary
qanjir-borosteyd
qanjirid
qanjir-kelyood
qanjir-liinfeed
qanjirsan
qanjirsanaan
qanjirsanaansho
qanjo
qanjoofil
qanjool
qansax
qanshiir
qanweyn
qanweynaan
qanweynaansho
qanyar
qanyaraan
qanyaraansho
qaqaan
qaqabow
qaqashaaf
qaqashaafid
qar¹
qar²
qaraab¹
qaraab²
qaraabaggoo
qaraabaggooyn
qaraabaggooys
qaraabakiil¹
qaraabakiil²
qaraabakiilid
qaraabaqansax
qaraabasho
qaraabaysad
qaraabaysasho
qaraabayso
qaraabid
qaraabo¹
qaraabo²
qaraafiic
qaraami
qaraar¹
qaraar²
qaraar³
qaraarid
qaraaxad
qaraaxadayn
qaraaxadee
qaraaxadi
qaraaxadin
qarabbax
qarabbaxsad
qarabbaxsasho
qarabbaxsi
qarabbaxso
qarabbixi
qarabbixin
qarad
qaraf¹
qaraf²
qaraf³
qarafeysasho
qarafeyso
qarafo
qarafsasho
qarafso
qaramada-Midoobay
qaramee
qarameyn
qaran
qarandi
qaranful
qarannimo
qaranqaar
qaranqaaro
qaraq¹
qaraq²
qaraqan
qaraqmid
qarar
qararab
qararabdheere
qararable
qararabsad
qararabsasho
qararabsi
qararabso
qararamsad
qararamsasho
qararamsi
qararamso
qararro
qaras
qarash
qarashayeysan
qarashayeysnaan
qarashayeysnaansho
qarashee
qarasheyn
qarasheysan
qarasheysnaan
qarasheysnaansho
qarashyee
qarashyeyn
qarasoobid
qarasow
qaraw¹
qaraw²
qarax¹
qarax²
qarayn
qarbad
qarbaqarbee
qarbaqarbeyn
qarbaqarbo
qarbed
qarbidix¹
qarbidix²
qarbidxan
qarbidxanaan
qarbidxanaansho
qarbidxasho
qarbidxid
qarbidxo
qarbud¹
qarbud²
qarbudaad
qarbudid
qardaas
qardab
qardabee
qardabeyn
qardabid
qardabo
qardajeex¹
qardajeex²
qardajeexid
qardajeexsii
qardajeexsiin
qardan
qardanaan
qardanaansho
qardayn
qardaysad
qardaysan
qardaysasho
qardaysi
qardaysii
qardaysiin
qardaysnaan
qardaysnaansho
qardayso
qardee
qardhaas
qardhabo
qardho
qardo
qardoo
qardoobid
qardood
qardoofee
qardoofeyn
qardoofo
qardow¹
qardow²
qare
qaredameer
qareduur
qaree
qareemid
qareen¹
qareen²
qareennimo
qareensasho
qareenso
qarfacad
qarfad¹
qarfad²
qarfadid
qarfo
qari
qariib¹
qariib²
qariib³
qariibi
qariibid¹
qariibid²
qariibin
qariibis
qariid¹
qariid²
qariidid
qariin
qariir
qariisad
qarin
qaris
qar-iskatuur
qar-iskatuurnimo
qar-iskaxoor
qar-iskaxoornimo
qarjaamaysad
qarjaamaysasho
qarjaamaysi
qarjaamayso
qarmuun¹
qarmuun²
qarmuunaan
qarmuunaansho
qarmuusi
qarni
qarnugeyl
qarnugul
qaro
qaroobbe
qaroof
qaroofali
qaroofan¹
qaroofan²
qaroofid
qaroofmid
qaroofnaan
qaroofnaansho
qaroomaale
qaroomato
qaroomaysad
qaroomaysasho
qaroomaysato
qaroomaysi
qaroomayso
qaroon
qaroor
qarow¹
qarow²
qarqar¹
qarqar²
qarqarayn
qarqaree
qarqari
qarqarid
qarqarin
qarqariye
qarqariyo
qarqarrooti¹
qarqarrooti²
qarqarrootiyid
qarqarsi¹
qarqarsi²
qarqarsii
qarqarsiin
qarqarsiinyo
qarqarsinaan
qarqarsinaansho
qarqarsiyan
qarqarsiyid
qarqaryeysan
qarqaryeysnaan
qarqaryeysnaansho
qarqaryo
qarqaryoo
qarqaryood
qarqid
qarqoor¹
qarqoor²
qarqoorid
qarqoosh
qarraac¹
qarraac²
qarraacan
qarraacid
qarraacnaan
qarraacnaansho
qarraaf¹
qarraaf²
qarraafid
qarraafis
qarracan¹
qarracan²
qarracmid
qarradh
qarrar¹
qarrar²
qarrari
qarrarid
qarrarin
qarrer¹
qarrer²
qarreran
qarreri
qarrerid
qarrerin
qarreris
qarrernaan
qarrernaansho
qarri¹
qarri²
qarrir¹
qarrir²
qarriran
qarririd
qarrirnaan
qarrirnaansho
qarrog
qarroor¹
qarroor²
qarroorid
qarsad
qarsan
qarsanaan
qarsanaansho
qarsasho
qarshad
qarshi
qarsho
qarsi
qarsin
qarso
qarsoodi
qarsoomid
qarsoon¹
qarsoon²
qarsoonaan
qarsoonaansho
qartab
qartabid
qartabo
qartabyo
qartebid
qaruuf¹
qaruuf²
qaruufid
qaruufo
qaruufsii
qaruufsiin
qaruunbow
qaruurad
qarwid
qarxad
qarxasho
qarxi
qarxid
qarxin
qarxis
qarxo
qaryaan
qaryad
qaryo
qas¹
qas²
qasaal¹
qasaal²
qasaalan
qasaalasho
qasaalid
qasaalnaan
qasaalnaansho
qasaalo
qasaanqas
qasaasil¹
qasaasil²
qasaasilid
qasab
qasabad
qasac
qasacad
qasacadayn
qasacadee
qasacadeysan
qasacadeysnaan
qasacadeysnaansho
qasad¹
qasad²
qasan¹
qasan²
qasdi
qasdid
qasgoo
qasgoyn
qash
qashaaf¹
qashaaf²
qashaafid
qashar
qashinqub
qashir
qaabka
qashoobid
qashow
qashqash
qashqashaad
qashqashid
qashwad
qasid
qasiido
qasil¹
qasil²
qasilasho
qasilid
qasilo
qasir
qaslad
qasli
qasmaansad
qasmaansasho
qasmaansi
qasmaanso
qasmid
qasnaan
qasnaansho
qasri
qaswade
qataar¹
qataar²
qataaran¹
qataaran²
qataarid
qataarmid
qataarnaan
qataarnaansho
qatan
qatanaan
qatanaansho
qatanow
qataysii
qataysiin
qatimi
qatimid
qatimin
qatimis
qatin¹
qatin²
qatindhaaf¹
qatindhaaf²
qatindhaafid
qatinsan
qatinsanaan
qatinsanaansho
qatooyo
qaw¹
qaw²
qawaacid
qawaaniin
qawaar
qawaarnimo
qawaasimo
qawad¹
qawad²
qawadid
qawadsan
qawadsanaan
qawadsanaansho
qawid
qawjad
qawl¹
qawl²
qawlad
qawlal¹
qawlal²
qawlalan
qawlalid
qawlalnaan
qawlalnaansho
qawle¹
qawle²
qawley
qawlid
qawmiyad
qawqab¹
qawqab²
qawqabid
qawrar¹
qawrar²
qawrarid
qaws
qawsasho
qawshad
qawsho
qawsi
qawsii
qawsiin
qawso
qax¹
qax²
qaxaab¹
qaxaab²
qaxaabad
qaxaabnimo
qaxaanqax¹
qaxaanqax²
qaxaanqixid
qaxan¹
qaxan²
qaxanqax¹
qaxanqax²
qaxanqixid
qaxar¹
qaxar²
qaxbad
qaxbo
qaxi
qaxid
qaxin
qaxmi
qaxmid
qaxmin
qaxooti
qaxraan
qaxran
qaxranaan
qaxranaansho
qaxrid
qaxsan
qaxsanaan
qaxsanaansho
qaxsasho
qaxso
qaxwayn
qaxwe
qaxwee
qaxwo
qay¹
qay²
qayaayo
qayaayoobid
qayaayow
qayacato
qayax¹
qayax²
qayaxan¹
qayaxan²
qayaxmid
qayaxnaan
qayaxnaansho
qayb-bulsho
qayb-goobo
qayb¹
qayb²
qayb³
qayb4
qayb5
qaybgal¹
qaybgal²
qaybgale
qaybgeli
qaybgelid
qaybgelin
qaybi
qaybid
qaybin
qaybis
qaybiye
qayblibaax
qaybqaadasho
qaybqaado
qaybsad
qaybsamid
qaybsan-unug
qaybsan¹
qaybsan²
qaybsanaan
qaybsanaansho
qaybsasho
qaybshaha-ay-wadaagaan
qaybshe
qaybsi
qaybsii
qaybsiin
qaybso
qaybta-kaadimareenka
qaybta-lafaha
qaybta-liimbigada-ee-maskaxda
qayb-xareedayn
qayd
qaydan
qaydar
qaydasho
qaydid
qaydin
qaydin-hays
qaydnaan
qaydnaansho
qaydo
qayid
qayil¹
qayil²
qayilaad
qayilid
qayilsan
qayilsanaan
qayilsanaansho
qayilsii
qayilsiin
qayir¹
qayir²
qayiraad
qayiran¹
qayiran²
qayirasho
qayirid
qayirmid
qayirnaan
qayirnaansho
qayiro
qayixid
qayl
qaylad
qayladdir
qayladdirasho
qayladdirid
qayladdiro
qayladdirsasho
qayladdirso
qayladdoon¹
qayladdoon²
qayladhaami
qayladhaamin
qayladhaamis
qayladhaamo
qayladhaan
qayladhaansad
qayladhaansasho
qayladhaansi
qayladhaanso
qayladhawr
qaylaggee
qaylaggeyn
qaylaggeys
qaylakeen¹
qaylakeen²
qaylakeenid
qaylaroor¹
qaylaroor²
qaylaroorid
qaylarraac¹
qaylarraac²
qaylarraacid
qayli
qaylid
qaylin
qaylis
qaylisii
qaylisiin
qaylo
qaymbaar
qayme
qaymee
qaymeyn
qaynuun
qayoo
qayood
qayr
qayraami
qayraamin
qayraamis
qayraan¹
qayraan²
qayraansan
qayraansanaan
qayraansanaansho
qayrab
qayrabnimo
qayriin
qayro
qaysadhabad
qaysadhabasho
qaysadhabo
qaysaraamayn
qaysaraamee
qaysaraan
qayshad
qaysho
qayso
qeeriin
qeex
qeexan
qeexid
qeexnaan
qeexnaansho
qeyd
qeydaddaar
qeydar
qeydin
qeydo
qeynuun
qeyr
qeyrabbax
qeyro
qiblad
qiblee
qibleyn
qibleysad
qibleysan
qibleysasho
qibleysi
qibleysnaan
qibleysnaansho
qibleyso
qiblo
qiic¹
qiic²
qiici
qiicid
qiicin
qiil
qiilqiil
qiimabbarar
qiimad
qiimadhac
qiimaha-sugan-ee-leeb
qiimaha-sugan-ee-tiro-murakab
qiimasheeg
qiimayn
qiime
qiime-tamar-gubasho
qiimee
qiimi
qiimo
qiiq¹
qiiq²
qiiqaab¹
qiiqaab²
qiiqaabid
qiiqbiyood
qiiqi
qiiqid
qiiqin
qiiq-iskuqarin
qiiq-iskuqaris
qiiqsasho
qiiqso
qiiraqiiro
qiiro
qiiroo
qiirood
qiixdheer
qilqiil
qindi
qir
qiraal
qirasho
qirayn
qirdaas
qiree
qirid
qirinqiir
qiro¹
qiro²
qirsan
qirsanaan
qirsanaansho
qisaas¹
qisaas²
qisaasan
qisaasid
qisaasnaan
qisaasnaansho
qisayn
qisee
qish¹
qish²
qishid
qiso
qisoo
qisood
qix
qixi
qixid
qixin
qiyaame
qiyaas¹
qiyaas²
qiyaas³
qiyaasan
qiyaasid
qiyaas-khariidadeed
qiyaasnaan
qiyaasnaansho
qob
qobbe
qobbo
qoble
qobo
qobosh
qobtol¹
qobtol²
qobtolan
qobtolid
qobtolnaan
qobtolnaansho
qod¹
qod²
qod³
qod4
qodaal
qodaal-buureed
qodan¹
qodan²
qodasho
qodato
qodax
qodaxbadeed
qodaxtool
qodban
qodbanaan
qodbanaansho
qodbid
qoddo
qode
qodhacayso
qodid
qoditaan
qodmid
qodnaan
qodnaansho
qodniin
qodo
qodob¹
qodob²
qodob³
qodobka
qodow
qof¹
qof²
qofayn
qofee
qofnimo
qol
qolaab
qolayn
qolaysad
qolaysan
qolaysasho
qolaysi
qolaysmid
qolayso
qoldhob
qolee
qolfaad¹
qolfaad²
qolfaadid
qolfaysad
qolfaysasho
qolfaysi
qolfayso
qollad
qolo
qolobdhabad
qolobdhabasho
qolobdhabo
qolof
qolofaysasho
qolofayso
qolofdhacsad
qolofdhacsasho
qolofdhacsi
qolofdhacso
qolofqab
qoloqolee
qoloqoleyn
qoloqoleys
qoloqolo
qolqol¹
qoqobay
qolqol²
qolqolan
qolqolid
qolti
qombob¹
qombob²
qombobid
qombobsan
qombobsanaan
qombobsanaansho
qommod
qommodsad
qommodsasho
qommodsi
qommodso
qondhacaysasho
qondhacaysi
qondhacayso
qondhaco
qonfid
qonof¹
qonof²
qoo
qoob
qoobad
qoobley
qooddi
qoode
qoodee
qoodeyn
qoodeysasho
qoodeysi
qoodeyso
qoodo
qoodow
qoofal¹
qoofal²
qoofalan
qoofalid
qoofalnaan
qoofalnaansho
qoofar
qool¹
qool²
qoolaab¹
qoolaab²
qoolaaban¹
qoolaaban²
qoolaabasho
qoolaabid
qoolaabmid
qoolaabnaan
qoolaabnaansho
qoolaabo
qoolaati
qoolaaw¹
qoolaaw²
qoolad
qoolan¹
qoolan²
qoolati
qooli
qoolid
qoolin
qoollaalli¹
qoollaalli²
qoollaalliyid
qoolley
qoolli
qoollin
qoollis
qoolmid
qoolnaan
qoolnaansho
qoomammayn
qoomammays
qoomammee
qoomammo
qooman
qoombi¹
qoombi²
qoombin
qoomid
qoomman
qoommanaan
qoommanaansho
qoon¹
qoon²
qoon³
qoon4
qoondayn
qoondaysasho
qoondaysi
qoondayso
qoondee
qoone
qoonmid
qoonqoon
qoonsad
qoonsasho
qoonsi
qoonsimaad
qoonso
qooq¹
qooq²
qooqaar¹
qǫoqaar¹
qooqaar²
qǫoqaar²
qooqaarasho
qooqaarid
qǫoqaarid
qooqaaro
qooqaarsasho
qooqaarso
qooqan
qooqid
qooqnaan
qooqnaansho
qoor
qǫor
qooraansad
qooraansasho
qooraansi
qooraanso
qooraar¹
qooraar²
qooraarid
qooraarsad
qooraarsasho
qooraarsi
qooraarso
qoorad
qooradheere
qooraggoo
qooraggooyo
qooraggoy
qooraggoyn
qooraggoys
qoorasho
qooratayn
qooratee
qooratirsi
qoorato
qoordiid¹
qoordiid²
qoordiidan
qoordiidasho
qoordiidid
qoordiidnaan
qoordiidnaansho
qoordiido
qoordiir¹
qoordiir²
qoordiirasho
qoordiirid
qoordiiro
qoorgoo
qoorgooye¹
qoorgooye²
qoorgooyn
qoorjabane
qoorkaddiid
qoorkaddiidid
qooro¹
qooro²
qoorqab
qoorsasho
qoorsi
qoorso
qoortool
qoorxayd
qoorxayo
qoorxir
qooryalo
qooryoomid
qooryoon¹
qooryoon²
qooryoon³
qooryoon4
qoosh¹
qoosh²
qooshan
qooshid
qooshnaan
qooshnaansho
qoosiherin
qoox
qooxan
qooxid
qooxnaan
qooxnaansho
qooy
qoqob¹
qoqob²
qoqob³
qoqoban
qoqobgoo
qoqobgoyn
qoqob-horraad-maskaxeed
qoqobid
qoqoble
qoqobnaan
qoqobnaansho
qor¹
qor²
qoraa
qoraaje
qoraal
qoraal-baali
qoraalkii-dadkii-hore
qorabixis
qoran¹
qoran²
qorasho
qordhabe
qordi
qordin
qore
qorequdde
qorfe
qorfo
qori
qorid
qori-ismaris
qorijiid¹
qorijiid²
qorijiidid
qorimo
qoriqaad¹
qoriqaad²
qoriqaadid
qoririd
qoriridasho
qorirido
qoris
qorisaar¹
qoryo,
qorisaar²
qorisaarid
qorisla'aan
qoritaan
qorituraad
qorituur¹
qorituur²
qorituurad
qorituurasho
qorituurid
qorituuro
qorixarar
qorixardhe
qormayn
qormee
qormid
qormo
qornaan
qornaansho
qorniimo
qorniin
qoro
qorofol
qoronful
qoroqoro
qoroqoronimo
qoroqoroobid
qoroqorow
qorqode
qorqoran
qorqornaan
qorqornaansho
qorraaje
qorrato
qorrax
qorraxayn
qorraxaysad
qorraxaysan
qorraxaysasho
qorraxaysi
qorraxaysnaan
qorraxaysnaansho
qorraxayso
qorraxdhac
qorraxdheere
qorraxee
qorraxmadoobaad
qorraxoo
qorraxood
qorraxsad
qorraxsasho
qorraxsi
qorraxsiidhac
qorraxsin
qorraxso
qorrax-soobax
qorshayn
qorshe
qorshe
qorshee
qoryarare
qoryasho
qoryayn
qoryee
qoryeysad
qoryeysan
qoryeysasho
qoryeysi
qoryeyso
qoryo¹
qoryo²
qosli
qoslid
qoslin
qosol¹
qosol²
qosolbile
qosolgariir¹
qosolgariir²
qosolgariirid
qosolkujaab
qotin
qotintabane
qotintogane
qoto
qoto-ekeeye
qotome
qotomi
qotomid
qotomin
qoton¹
qoton²
qotonsad
qotonsan
qotonsanaan
qotonsanaansho
qotonsasho
qotonsi
qotonso
qowjad
qowlad
qowlannimo
qowle¹
qowle²
qowleysasho
qowleysato
qowleyso
qowmiyad
qows
qowsaar
qow-weyn
qox
qoy
qoyaami
qoyaamin
qoyaan
qoyan
qoyanaan
qoyanaansho
qoyid
qoyn
qoys
qub¹
qub²
qub³
qubad¹
qubad²
quban
qubasho
qubbad
qubbad-shiileed
qubbo
qubee
qubeyn
qubeys
qubeysasho
qubeyso
qubid
quble
qubleey
qubnaan
qubnaansho
qubo¹
qubo²
qubsii
qubsiin
qubul
quburi
qubuul
qubuur
qubuurro
qudde
quddee
quddeyn
qudduuc
qudduucnimo
qudkool
qudrad
qudunquute
qudunquuto
qudur
qudurad
quduro
quf
qufac¹
qufac²
qufad
qufan
qufasho
qufe
qufici
quficid
quficin
qufid
qufnaan
qufnaansho
qufo
qufraan
quful¹
quful²
qufulad
qufulan
qufulasho
qufulid
qufulnaan
qufulnaansho
qufulo
qujayn
qujays
qujee
qul
qulaami
qulaamin
qulaamis
qulaan
qulaanqulshe
qulaanqulye
qulban
qulbanaan
qulbi
qulbid
qulbin
qullatayn
qulqul-badweyn
qulqul-qumman
qulqul-talantaaliya
qulqul¹
qulqul²
qulqul³
qulqulad
qulquladayn
qulquladee
qulquli
qulqulid
qulqulin
qulub¹
qulub²
qulubsan
qulubsanaan
qulubsanaansho
qulubsii
qulubsiin
quluc
qulucfage
qulul
qululuc
quluub
quluud
quluul
quluulad
quluulasho
quluulo
qumannimo
qumanyannimo
qumanyaysad
qumanyaysasho
qumanyaysi
qumanyayso
qumanyo
qumaqase
qumay
qumayanimo
qumayaysad
qumayaysasho
qumayayso
qumayeysi
qumaynnimo
qumayo
qumbaar
qumbac
qumbacasho
qumbaco
qumbahool
qumbahoole
qumbe
qumbulad
qumi
qumid
qumin
qumiyeyn
qummaati¹
qummaati²
qummaatid
qumman¹
qumman²
qumman³
qumman4
qummanaan
qummanaansho
qummud
qummudsad
qummudsasho
qummudsi
qummudso
qun¹
qun²
qunbe
qunde
qundhac
qundhacaysad
qundhacaysasho
qundhacaysi
qundhacayso
qundhaco
qundho
qundhoco
qunful¹
qunful²
qunfulan
qunfulasho
qunfulid
qunfulnaan
qunfulnaansho
qunfulo
qunjee
qunjeyn
qunjuraaf¹
qunjuraaf²
qunjuraafid
qunsad
qunsasho
qunso
qunsul
qunsul-xigeen
qunsuliyad
qunuud
qunux
qunyar
qunyarsocod
qunyarsocodnimo
qur
quraac
quraacasho
quraaco
Quraan
Qur'aan
quraan-akhris
quraanjo
quraanqaad
quraansaar¹
quraansaar²
quraansaarid
quraanyo
quraaqur
quraar
quraarad¹
quraarad²
quraarqor
qurac
qurbaan
qurbaansasho
qurbaanso
qurbac
qurbacyee
qurbacyeyn
qurbacyeys
qurban
qurbanaan
qurbanaansho
qurbax
qurbe
qurbid
qurbixid
qurbo
qurcis
qurdan
qurdanaan
qurdanaansho
qurdho
qurdid
qurdo¹
qurdo²
qurdowalaq
qurdowalaqnimo
qurdudumsad
qurdudumsasho
qurdudumsi
qurdudumso
qurgo'
qurgo'id
qurgoo
qurgooyo
qurgoyn
quri
qurin
quris
qurjad
qurjujubsad
qurjujubsasho
qurjujubsi
qurjujubso
qurjujumsad
qurjujumsasho
qurjujumsi
qurjujumso
qurmi
qurmid
qurmin
qurmoon¹
qurmoon²
qurmoonaan
qurmoonaansho
qurmuun¹
qurmuun²
qurmuunaan
qurmuunaansho
qurqur
qurquri
qurqurin
qurquris
qurquro
qurqursan
qurqursanaan
qurqursanaansho
qursi
qurub¹
qurub²
qurub³
qurub-logardam
qurud¹
qurud²
qurumo
qurumohuluko
qurumoqoobley
qurun¹
qurun²
qurunsan
qurunsanaan
qurunsanaansho
qurunsasho
qurunso
qururumsad
qururumsasho
qururumsi
qururumso
qurus
quruun
quruurux
quruurux-bataax
quruuruxi
quruuruxin
quruuruxis
quruush
qurux
quruxsami
quruxsan
quruxsanaan
quruxsanaansho
quruxsasho
quruxso
qurux-u-bogid
qurwaa
qurwaayid
qurxan
qurxanaan
qurxanaansho
qurxi
qurxin
qurxoon
qurxoonaan
qurxoonaansho
qurxub
quse
qush
qushaash¹
qushaash²
qushaashid
qushayn
qushaysan
qushaysnaan
qushaysnaansho
qushee
qushqush¹
qushqush²
qushqushid
qushuuc¹
qushuuc²
qushuucid
qushuucsan
qushuucsanaan
qushuucsanaansho
qusley
qusur
qusuusi
qutool
quud¹
quud²
quudad
quudasho
quuddarrayn
quuddarree
quuddarro
quudi
quudin
quudis
quudo
quudowsasho
quudowsi
quudowso
quudquuto
quudsasho
quudsi
quudso
quulle
quun-saneed
quuqlayn
quuqle
quuqlee
quur¹
quur²
quurid
quuris
quuriwaa
quuriwaayid
quursad
quursasho
quursi
quurso
quuruwalle
quus¹
quus²
quus³
quusad
quusasho
quuse
quusi
quusid
quuso
quutaquute
quutaquuto
quwaax
quwaaxsasho
quwaaxso
quwad
quwee
quweyn
quweysan
quweysasho
quweysnaan
quweysnaansho
quweyso
quwo
quwoobid
quwow
quxuub¹
quxuub²
quxuubnimo
