x
xaab¹
xaab²
xaabayn
xaabee
xaabi
xaabid
xaabin
xaabis
xaabo
xaabsad
xaabsasho
xaabsi
xaabso
xaad
xaadi
xaadin
xaadir¹
xaadir²
xaadiri
xaadirid
xaadirin
xaadiris
xaadirsan
xaadirsanaan
xaadirsanaansho
xaadsasho
xaadso
xaafad
xaafood
xaajaggal
xaajayaqaan
xaajeysad
xaajeysasho
xaajeysi
xaajeyso
xaaji
xaajinnimo
xaajiyad
xaajo
xaajoo
xaajood
xaajootamid
xaajootan¹
xaajootan²
xaakin
xaako
xaakoo
xaakood
xaal¹
xaal²
xaalad
xaalad-beeggaal
xaaladduun
xaalayn
xaalee
xaalid
xaalmari
xaalmarin
xaalo
xaaluf¹
xaaluf²
xaalufi
xaalufid
xaalufin
xaaluq
xaammil
xaammilo
xaani
xaano
xaanshi
xaaq
xaaqid
xaaqin
xaaqsasho
xaaqso
xąar
xaar¹
xaar²
xaaraamayn
xaaraamaysan
xaaraamaysnaan
xaaraamaysnaansho
xaaraamee
xaaraami
xaaraan
xaaraannimo
xaaraanquute
xaaraansan
xaaraansanaan
xaaraansanaansho
xaaraantimayn
xaaraantimee
xaaraantinnimo
xaaraanyahan
xąaran
xaarasho
xaari
xaarid
xąarid
xaarin¹
xaarin²
xąarnaan
xąarnaansho
xaaro
xaarsii
xaarsiin
xaarwalwaal
xaarxaar
xaarxaari
xaarxaarin
xaarxaaro
xaas¹
xaas²
xaasaami
xaasaamid
xaasaamin
xaasaan¹
xaasaan²
xaasaanqabow
xaasha
xaashi
xaasi
xaasid¹
xąasid¹
xaasid²
xąasid²
xaasidad
xaasidnimo
xaasil
xaasin
xaasoobid
xaasow
xaawalay
xaawi
xaawin
xaaxeeyo
xaaxi
xab
xab¹
xuubabka
xab²
xabaal¹
xabaal²
xabaal³
xabaalan
xabaalaqode
xabaalaquf
xabaalasho
xabaalbilaash
xabaalfure
xabaalid
xabaalnaan
xabaalnaansho
xabaalnololi
xabaalnololin
xabaalo¹
xabaalo²
xabad
xabag
xabagbarshe
xabagbarshi
xabagbarsho
xabagdhiig
xabash
xabashi
xabawar
xabawari
xabawarin
xabawaris
xabbaar¹
xabbaar²
xabbaarid
xabbad
xabbadayn
xabbadee
xabbadqaad
xabbaji
xabbajin
xabbajis
xabbis¹
xabbis²
xabbisan
xabbisid
xabbisnaan
xabbisnaansho
xabbururi
xabbururin
xabbururis
xabeeb¹
xabeeb²
xabeebi
xabeebid
xabeebin
xabeebsad
xabeebsan
xabeebsanaan
xabeebsanaansho
xabeebsasho
xabeebso
xabeed
xabiib
xabkaysad
xabkaysasho
xabkaysi
xabkayso
xabow
xabsi
xabud
xabuubane
xabxab
xad
xąd¹
xąd²
xąd³
xadaafiir
xadaarad
xadaf¹
xadaf²
xadan
xadatayn
xadatee
xadato
xad-awoodeed
xadaysan
xaddaarad
xad-dhaaf¹
xad-dhaaf²
xad-dhaafid
xaddi
xaddi
xaddid
xaddidan
xaddidhaaf
xaddidhaafsii
xaddidhaafsiin
xaddidid
xaddiditaanka-PH
xaddidnaan
xaddidnaansho
xaddi-foolwaa
xaddiid
xaddiis
xaddiisqudsi
xaddi-roobaad
xądee
xądeyn
xądeysan
xądeysnaan
xądeysnaansho
xadfan
xadfanaan
xadfanaansho
xadfid
xadgudbid
xadgudub¹
xadgudub²
xadid
xądid
xadiidin
xadnaan
xadnaansho
xadrayn
xadree
xadro
xafaarad
xafaare
xafash
xafid
xafidan
xafidid
xafidnaan
xafidnaansho
xafiiltamid
xafiiltan¹
xafiiltan²
xafiis
xaflad
xag¹
xag²
xag³
xagaa¹
xagaa²
xagaabbax
xagaaf¹
xagaaf²
xagaaf³
xagaafayn
xagaafe
xagaafee
xagaafi
xagaafid
xagaafin
xagaafis
xagaafo
xagaal
xagaali
xagaalin
xagaalis
xagaalsasho
xagaalso
xagaay
xagaayo
xagafsasho
xagafso
xagaggaro
xagaggeli
xagaggelin
xagal-daacsan
xagal-fiiqan
xagal-qumman
xagal-furan
xagal-janjeedh
xagal-masaafo-cabbire
xagal-qumman
xagal-toosan
xagal¹
xagal²
xagal-adke
xagaldaac¹
xagaldaac²
xagaldaacid
xagaldaaco
xagalkaddaac
xagalkaddaacid
xagalo
xagan¹
xagan²
xagar
xagasho
xagatin
xagato
xagaysasho
xagaysi
xagayso
xagge
xaggee
xagid
xagjir
xaglagooye
xagli
xaglin
xaglis¹
xaglis²
xaglisid
xaglo-isqummiye
xaglo-istoosiya
xaglo-talantaali
xagmaal
xagmaalid
xagmar
xagmarid
xagmid
xagnaan
xagnaansho
xago
xagurrin
xagxag¹
xagxag²
xagxagasho
xagxagid
xagxago
xaj
xaji¹
xaji²
xajiimee
xajiimeyn
xajiimeysan
xajiimeysnaan
xajiimeysnaansho
xajiimo
xajiimoo
xajiimood
xajiin¹
xajiin²
xajiinbadeed
xajiinmadow
xajiintir
xajin
xajiyid
xajmi
xakaamad
xakaar¹
xakaar²
xakaarid
xakab
xakamayn
xakamaysan
xakamaysnaan
xakamaysnaansho
xakame
xakamee
xakumid
xakun
xąl
xal¹
xal²
xalaal
xalaalayn
xalaalays
xalaalaysad
xalaalaysasho
xalaalayso
xalaalee
xalaalquute
xalaawi
xaladhaley
xalan
xalay
xalaydhaley
xalayto
xalfoof
xalid
xaliib
xaliiban
xaliilad
xallaafato
xallad
xalladee
xalladeyn
xalleef
xalleefato
xalleefi
xalleefin
xalleefsan
xalleefsanaan
xalleefsanaansho
xalli¹
xalli²
xalli³
xalliiban
xallin¹
xallin²
xallis
xallisan¹
xallisan²
xallismid
xallisnaan
xallisnaansho
xalnaan
xalnaansho
xalus
xaluul
xaluulad
xaluulasho
xaluulo
xalwad
xalwo
xalxal¹
xalxal²
xalxali
xalxalid
xalxalin
xamaal¹
xamaal²
xamaali
xamaalid
xamaalinnimo
xamaamo
xamaan
xamaar
xamaarad
xamaarasho
xamaarato
xamaarid
xamaaro
xamaasad
xamakow
xamar¹
xamar²
xamash
xamasho
xambaar¹
xambaar²
xambaarad
xambaaraggudub
xambaaran
xambaarasho
xambaarid
xambaarnaan
xambaarnaansho
xambaaro
xambaaro²
xambaarsad
xambaarsan
xambaarsanaan
xambaarsanaansho
xambaarso
xambali
xambus
xamdi¹
xamdi²
xamdinnaq¹
xamdinnaq²
xamdinnaqid
xamdiyid
xameyti
xameyti-mareen
xamiiq
xamiiqreeb
xamiiqreebid
xamiir
xamil
xamli
xammaag
xammaagid
xammaal¹
xammaal²
xammaali
xammaalid
xammaalinnimo
xammayn
xammaysan
xammaysnaan
xammaysnaansho
xammee
xammeeti
xammis
xammisan
xammisid
xammisnaan
xammisnaansho
xammur
xammuul
xammuurad
xammuuradayn
xammuuradaysan
xammuurad
xammuuradaysnaan
xammuuradaysnaansho
xammuuradee
xamo
xamur
xamuul
xamxam
xamxamaa
xamxamlee
xamxamleyn
xan
xanaaji
xanaajin
xanaakad
xanaakadayn
xanaakadee
xanaanada-xoolaha
xanaaq¹
xanaaq²
xanaaqid
xanaaqsan
xanaaqsanaan
xanaaqsanaansho
xanaf
xanafi
xanafiya
xanan
xanantayn
xanantee
xananto
xanatayn
xanatee
xanato
xandal
xandho
xandulle
xanfaf¹
xanfaf²
xanfafid
xanfal
xanfaley
xanfaloobid
xanfalow
xanfar
xanful
xangaruufad
xangaruufasho
xangaruufo¹
xangaruufo²
xangeeyo
xangulle¹
xangulle²
xangullo
xaniid
xaniin
xanjaad
xanjaf
xanjafee
xanjafeyn
xanjeer
xanjeerad
xanjeerasho
xanjeero
xanjo
xankakaabsad
xankakaabsasho
xankakaabso
xankoobid
xannaanayn
xannaanee
xannaano
xannib¹
xannib²
xannibaad
xannibad
xanniban¹
xanniban²
xannibid
xannibmid
xannibnaan
xannibnaansho
xansas
xansasho
xansaso
xanshar
xanshashaq¹
xanshashaq²
xanshashaqid
xanshiri
xanshirin
xanso
xantiir¹
xantiir²
xantiirid
xantiirnimo
xanto
xantoobayn
xantoobee
xantoobi
xantoobin
xantoobo
xantoobsad
xantoobsasho
xantoobso
xanuuji
xanuujin
xanuun-bi'iye
xanuun¹
xanuun²
xanuunid
xanuunsad
xanuunsan
xanuunsanaan
xanuunsanaansho
xanuunsasho
xanuunso
xaq
xaqaanni
xaqaggaro
xaq-codbixinta
xaqdarro
xaqdhawr¹
xaqdhawr²
xaqdhawrid
xaqiiji
xaqiijin
xaqiiq
xaqiiqato
xaqiiqo
xaqiiqsad
xaqiiqsasho
xaqiiqso
xaqir¹
xaqir²
xaqiraad
xaqiran
xaqirid
xaqirnaan
xaqirnaansho
xaqsoor¹
xaqsoor²
xaqsooran
xaqsoorid
xaqsoornaan
xaqsoornaansho
xaqtamid
xaqtan
xaquuq¹
xaquuq²
xaquuqan
xaquuqato
xaquuqid
xaquuqnaan
xaquuqnaansho
xar
xaraabad
xaraar
xarąar¹
xarąar²
xaraaraansho
xaraarad
xaraaradoobid
xaraaradow¹
xaraaradow²
xaraari
xaraarid
xaraarin
xaraaroowe
xaraarow
xaraarug¹
xaraarug²
xaraarugid
xaraash¹
xaraash²
xaraashid
xarad
xaradhaami
xaradhaamin
xaradhaamo
xaraf
xarafsad
xarafsasho
xarafsi
xarafso
xarakaad
xarakad
xarakayn
xarakaysan
xarakaysnaan
xarakaysnaansho
xarakee
xarakeysan
xarako
xuruufta
xaram
xaran
xarar¹
xarar²
xarbad
xarbi¹
xarbi²
xarbin
xarbiyid
xardhan
xardhanaan
xardhanaansho
xardhid
xareed
xareedayn
xareedeeye
xareedi
xareedin
xareedis
xarfaan
xarfad¹
xarfad²
xarfadayn
xarfadee
xarfasho¹
xarfasho²
xarfi
xarfin¹
xarfin²
xarfo¹
xarfo²
xargag¹
xargag²
xargagid¹
xargagid²
xargagoosasho
xargagooso
xargagsan
xargagsanaan
xargagsanaansho
xargaha-codka
xarig
xariggoys
xarigxarig
xarigxoolaad
xariif
xariiftamid
xariiftan¹
xariiftan²
xariir¹
xąriir¹
xariir²
xąriir²
xariir³
xariirad
xariirasho
xariiri
xariirid
xąriirid
xariirin
xariiro
xariq-ku-ligan-sallax
xarkag¹
xarkag²
xarkagid
xarkagsan
xarkagsanaan
xarkagsanaansho
xarmal
xarmasho
xarmo
xaroor
xarraamid
xarraan¹
xarraan²
xarragayn
xarragaysan
xarragaysii
xarragaysiin
xarragaysnaan
xarragaysnaansho
xarragee
xarrago
xarragoo
xarragood
xarre
xarriijin
xarriiq¹
xarriiq²
xarriiq³
xarriiqa-waqtiyeynta-caalamiga
xarriiqan
xarriiq-badh
xarriiqid
xarriiqin
xarriiqnaan
xarriiqnaansho
xarriiq-taabte
xarriiq-xoog
xarrish
xarrishaad
xarrishid
xarshaash¹
xarshaash²
xarshaashid
xarshaasho
xarun
xaruubbamid
xaruumbi
xaruumbin
xaruumid
xaruun
xaruun²
xaryami
xaryamid
xaryamin
xaryan¹
xaryan²
xas
xasaagaysasho
xasaagaysi
xasaagayso
xasaago
xasaasi
xasad¹
xasad²
xasanaad
xasarad
xasaradayn
xasaradee
xasaw
xasayn
xasaysan
xasaysnaan
xasaysnaansho
xasdid
xasee
xash
xashaash¹
xashaash²
xashaashid
xashar
xasharaad
xashiish
xashiishad
xashin
xashir
xashiri
xashirin
xashwad
xasidid
xasiigin
xasil¹
xasil²
xasildarro
xasili
xasilid
xasilin
xasillan
xasillanaan
xasillanaansho
xasilloon
xasilloonaan
xasilloonaansho
xasillooni
xasin
xaskul
xasuuq
xasuuqid
xataa
xatab
xatabad
xatooyo
xaw
xawaad
xawaadeen
xawaaj
xawaaji
xawaal¹
xawaal²
xawaalad
xawaarayn
xawaare
xawaare-ileys
xawaaree
xawaare-hoor
xawaash
xawaldaar
xawayaan
xawbaf
xawil
xawilad
xawilid
xawlalmariid
xawlli
xawlmariid
xawo¹
xawo²
xawr
xawri
xawrin
xay
xayaab
xayaabo
xayaad¹
xayaad²
xayaadid
xayawaan
xayawaan-caabud
xayawaannimo
xayaysasho
xayaysii
xayaysiin
xayaysiis
xayayso
xaybooro
xayd
xaydaamasho
xaydaamid
xaydaamo
xaydaan¹
xaydaan²
xaydan
xayddaan
xaydhayn
xaydid
xaydnaan
xaydnaansho
xaydo
xayeeshi
xayeesi
xayeesinnimo
xayi
xayir
xayiraad¹
xayiraad²
xayiran¹
xayiran²
xayiran³
xayirid
xayirmid
xayirnaan
xayirnaansho
xayl¹
xayl²
xaylid
xayn
xayndaab
xaynoosh
xayo
xayr
xayraamid
xayraan¹
xayraan²
xayrarriyaad
xayraxade
xayroobid
xayrow
xays
xaysin
xayuubi
xayuubin
xayuubsasho
xayuubsi
xayuubso
xeeb-yar
xeeb¹
xeeb²
xeebad
xeebasho
xeebo
xeegaan
xeego
xeel
xeelad
xeeladayn
xeeladee
xeelayn
xeeldheer
xeeldheeraan
xeeldheeraansho
xeeldheere
xeeldheeri
xeelee
xeelo
xeer-ciqaab
xeer-fal-cuf
xeer-hees
xeer-silsilad
xeer¹
xeer²
xeeran
xeerar-waarid
xeerbeeg
xeerburis
xeerdhaari
xeerhoosaad
xeeri¹
xeeri²
xeerid
xeer-ilaaliye
xeerjajab
xeerjebis
xeerka-1aad-ee-Niyuuton
xeerka-Aarkimidiyas
xeerka-Boyl
xeerka-danab-soocidda-Faaradhay
xeerka-dhaalton-ee-cadaadis-qaybeed
xeerka-Jaarles
xeerka-kala-dhigga
xeerka-kala-hormarinta
xeerka-kosayn
xeerka-Kuulam
xeerka-Lenis
xeerka-noqodka
xeerka-qalloocsanka
xeerka-sayn
xeerka-2aad-ee-Niyuuton
xeerka-3aad-ee-Niyuuton
xeernaan
xeernaansho
xeer-neefeed
xeero¹
xeero²
xeeryan
xeeryanaan
xeeryanaansho
xeeryaqaan
xeeryid
xer
xerageddi
xerageddin
xerageddis
xerageddisad
xerageddisasho
xerageddiso
xerageli
xeragelin
xeraguul
xerayn
xeraysad
xeraysan
xeraysasho
xeraysi
xeraysnaan
xeraysnaansho
xerayso
xeree
xergee
xergeyn
xero
xerodhaaf¹
xerodhaaf²
xerodhaafid
xerokabaad
xerokadareeris
xeroo
xerood
xerri
xerrin
xersilow
xexeb
xeyd
xeydan¹
xeydan²
xeydasho
xeydid
xeydmid
xeydnaan
xeydnaansho
xeydo
xeyraxagato
xiddaayad
xiddayn
xiddaysad
xiddaysan
xiddaysasho
xiddaysi
xiddaysnaan
xiddaysnaansho
xiddee
xiddig-cirif
xiddig¹
xiddig²
xiddigasheeg
xiddigdhul
xiddigi
xiddigin
xiddigis
xiddigiye
xiddigle
xiddo
xidh-yar
xidhiidhis
xidid¹
xidid²
xidid³
xididbarar
xidid-ciriirshe
xidid-dabciye
xididdeysasho
xididdeyso
xididi
xididid
xididin
xididmaskaxeed
xididnimo
xididshe
xididxanuun
xidig
xidiidin
xidinxiito
xifaalayn
xifaalee
xifaalo
xifaalootan
xifaaltamid
xifaaltan¹
xifaaltan²
xifasho
xifo
xig¹
xig²
xig³
xigaal
xigaalo
xigasho
xigid
xigmaati
xigmad
xigo¹
xigo²
xigsasho
xigsii
xigsiin
xigsiisan
xigsimi
xigsimid
xigsimin
xigsin¹
xigsin²
xigsinayn
xigso
xigtannimo
xigto
xiid
xiidan¹
xiidan²
xiidgood
xiidmo
xiidxiito
xiiji
xiijin
xiilo
xiimi
xiimid
xiimin
xiin¹
xiin²
xiinto
xiiq¹
xiiq²
xiiq³
xiiqdheer¹
xiiqdheer²
xiiqid
xiiqlee
xiiqley
xiiqleyn
xiiqsan
xiiqsanaan
xiiqsanaansho
xiir
xiiran
xiirasho
xiirid
xiirimaad
xiirnaan
xiirnaansho
xiirniin
xiiro
xiirrimaad
xiis¹
xiis²
xiisaan
xiisad
xiisadhac
xiisadhicid
xiisayn
xiisee
xiisid
xiiso
xiiso-elektaroon
xiisoo
xiisood
xiito
xiitoole
xijaab¹
xijaab²
xijaaban
xijaabasho
xijaabid
xijaabnaan
xijaabnaansho
xijaabo
xiji¹
xiji²
xijin
xikaayayn
xikaayee
xikaayo
xikaayoo
xikaayood
xil¹
xil²
xilafur¹
xilafur²
xilafurid
xilafursii
xilafursiin
xilagube
xila-irmaanis
xila-irmaaniye
xilasho
xilbax¹
xilbax²
xilbixi
xilbixid
xilbixin
xildhibaan
xildiid
xilfe
xilid
xilkas
xilkasnimo
xillad
xilli¹
xilli²
xilo¹
xilo²
xiloodi
xiloodin
xilqaamid
xilqaan¹
xilqaan²
xilqabeen
xilqo
xiltir¹
xiltir²
xiltirid
xilwareejin
xilyaxyax
ximaar
ximaayayn
ximaayee
ximaayo
ximi
ximin
ximir
ximre
xin
xaasidnimo
xinif
xiniin¹
xiniin²
xiniin³
xiniintaabasho
xiniintaabo
xiniin-xolac
xiniinyataabasho
xiniinyataabo
xinjir
xinjir-roor
xinne
xinnee
xinneyn
xinneysasho
xinneyso
xinni
xiqdi
xir¹
xir²
xiran¹
xiran²
xirasho
xirfad
xirfadle
xirfo
xirgi
xirid
xiriir¹
xiriir²
xiriir³
xiriirfur¹
xiriirfur²
xiriirfurad
xiriirfurasho
xiriirfurid
xiriirfuro
xiriiri
xiriirid
xiriirin
xiriiriye¹
xiriiriye²
xiriirsan
xiriirsanaan
xiriirsanaansho
xiriirsasho
xiriirso
xiritaan
xirmayn
xirmee
xirmid
xirmo
xirnaan
xirnaansho
xirniin
xiro
xirrib
xirribaggub
xirribaggubid
xirsi
xirsifur
xirsixir¹
xirsixir²
xirsixiran
xirsixirid
xirsixirnaan
xirsixirnaansho
xirxiran
xirxirnaan
xirxirnaansho
xis
xisaab¹
xisaab²
xisaab³
xisaabaad
xisaaban
xisaabasho
xisaabfal-asaasiga-ah
xisaabi
xisaabid
xisaabin
xisaabiye
xisaabnaan
xisaabnaansho
xisaabo
xisaabsan
xisaabsanaan
xisaabsanaansho
xisaabsasho
xisaabso
xisaabtamid
xisaabtan¹
xisaabtan²
xisad
xisbi
xisbiyiin
xisdi
xishmo
xishoo
xishood
xishoodsii
xishoodsiin
xiskiisan
xiskimi
xiskimid
xiskimin
xiskin¹
xiskin²
xisti
xitaa
xobbor
xobboran
xobbornaan
xobbornaansho
xoday
xodxodasho
xodxodo¹
xodxodo²
xog¹
xog²
xog³
xoghaye
xoghayn
xogid
xogmooge
xogogaal
xogogaalnimo
xogsasho
xogwaraysasho
xogwaraysi
xogwarayso
xogwarramid
xogwarran¹
xogwarran²
xoldhan
xoldhanaan
xoldhanaansho
xoldhid
xolod
xolodho
xolor
xolxol
xood¹
xood²
xood³
xoodaami
xoodaamin
xoodan¹
xoodan²
xoodasho
xoodbeeg
xoode
xoodi
xoodid
xoodin
xoodmid
xoodnaan¹
xoodnaan²
xoodnaan³
xoodnaansho
xoodo
xoodsad
xoodsan
xoodsanaan
xoodsanaansho
xoodsasho
xoodsi
xoodso
xood-taabte
xoog-xuddun-ujeed
xoog¹
xoog²
xoog³
xoogaa
xoog-bah-isjiidad
xoog-danabwade
xoogee
xoogeyn
xoogeysasho
xoogeyso
xoogid
xoogoobid
xoogow¹
xoogow²
xoogsasho
xoogsato
xoogsi
xoogso
xoogxaraash
xoogxaraashnimo
xoog-xuddun-ka-jeed
xooji
xoojin
xoolaaley
xooladhaqasho
xooladhaqato
xoolaggoo
xoolaggooyo
xoolaggoyn
xoolaley
xoolatir
xoolatirid
xoolatirsasho
xoolatirsi
xoolatirso
xoolayn
xoolaysad
xoolaysan
xoolaysasho
xoolaysi
xoolaysnaan
xoolaysnaansho
xoolayso
xoolee
xoolo
xoolohunnay
xoolo-ogaa
xoolo-ogaal
xoolo-ogaalnimo
xoolo-ogaannimo
xoon¹
xoon²
xoon³
xoonsamid
xoonsan¹
xoonsan²
xoonsanaan
xoonsanaansho
xoonshinniyeed
xoor¹
xoor²
xoor³
xoori
xoorid
xoorin
xoorsato
xoosh
xoox
xooxi
xoox
xooxin
xooxsad
xooxsasho
xooxso
xoq¹
xoq²
xoq³
xoqad¹
xoqad²
xoqado
xoqasho
xoqato
xoqe
xoqid
xoqo
xor
xorayn
xoree
xorgog¹
xorgog²
xorgogid
xorgogsan
xorgogsanaan
xorgogsanaansho
xorjab¹
xorjab²
xorjabid
xornimo
xoroobid
xorow
xorre
xorriyad
xorriyo
xorshosh
xortol¹
xortol²
xortolan
xortolasho
xortolid
xortolnaan
xortolnaansho
xortolo
xoryeel¹
xoryeel²
xoxob
xubbi
xubbul-yeeg
xubeer
xubeerid
xubeero
xubin
xubin-dhac
xubin-holac
xubnayn
xubnee
xubno-holac
xuddumi
xuddumin
xuddun¹
xuddun²
xuddunxir¹
xuddunxir²
xuddunxirid
xuddur
xudduud¹
xudduud²
xuf
xufnugeyl
xug¹
xug²
xugid
xugmi
xugun
xujaale
xujee
xujeey
xujeyn
xujo
xujoobid
xujoole
xujow
xujub
xujuub
xukuman
xukumid
xukumnaan
xukumnaansho
xukun-militeri
xukun¹
xukun²
xukun-la'aan
xukuumad
xul¹
xul²
xulad
xulafo
xulan
xulanti
xulasho
xulasho-dabeeci
xulato
xulbad
xuli
xulid
xulin
xulnaan
xulnaansho
xulo
xuloobid
xulow¹
xulow²
xulquun
xuluf
xulus
xuluul
xuluulad
xuluulasho
xuluuli
xuluulin
xuluulo
xuluushan
xuluushanaan
xuluushanaansho
xulxul
xumaan¹
xumaan²
xumaansho
xumadoon
xumaraadis
xumayn
xumays¹
xumays²
xumbayn
xumbaysii
xumbaysiin
xumbee
xumbo
xumbuse
xumee
xumi
xummad
xummadaysan
xummadaysnaan
xummadaysnaansho
xummad-guduud
xummad-hurdo
xumo
xun
xundhur¹
xundhur²
xundhur-ameebeed
xundhur-bakteeriyeed
xundhuro
xunguruf
xuquuq
xur
xurbi
xurbin¹
xurbin²
xurbiye
xurbo
xurguf
xurgufsii
xurgufsiin
xurmayn
xurmaysan
xurmaysnaan
xurmaysnaansho
xurmee
xurmo
xurquun
xurub
xuruubbamid
xuruubban¹
xuruubban²
xuruuf
xuruumid
xuruun¹
xuruun²
xus¹
xus²
xusan
xushlayn
xushle
xushlee
xushmad
xushmadarro
xushmadayn
xushmadee
xushmayn
xushmee
xushmo
xusid
xusli
xuslin
xusnaan
xusnaansho
xusul
xusulduub¹
xusulduub²
xusulduubid
xusullaysasho
xusullaysi
xusullayso
xusuus
xusuusad
xusuusan
xusuusasho
xusuusdhig
xusuusi
xusuusin
xusuusnaan
xusuusnaansho
xusuuso
xusuusqor
xutubi
xutubin
xutush
xuub¹
xuub²
xuubabbays
xuub-badh-habe
xuub-balaasmeed
xuubdhacsad
xuubdhacsasho
xuubdhacsi
xuubdhacso
xuubdillaac
xuubdillaacsad
xuubdillaacsasho
xuubdillaacsi
xuubdillaacso
xuubi¹
xuubi²
xuub-ileed-holac
xuubin
xuubka
xuubka
xuub-malaas
xuub-maskaxeed
xuub-muruqeed
xuubsad
xuubsasho
xuubsi
xuubsiibad
xuubsiibasho
xuubsiibo
xuubso
xuub-ubuceed
xuub-wadne
xuub-wadneed
xuub-xabeed
xuudhayn
xuudhee
xuudheys
xuuko
xuunsho
xuur
xųur
xuuralcayn
xuuri
xuurin
xuurtayn
xuurtaysii
xuurtaysiin
xuurtee
xuurto
xuurtoo
xuurtood
xuux
xuuxi
