y
yaa¹
yaa²
yaa³
yaa4
yaab¹
yaab²
yaabban
yaabbanaan
yaabbanaansho
yaabi
yaabid
yaabin
yaabis¹
yaabis²
yaabsan
yaabsanaan
yaabsanaansho
yaac
yaaci
yaacid
yaacin
yaacis
yaacsan
yaacsanaan
yaacsanaansho
yaadaddo
yaahuu
yaallin
yaambo
yaanbo
yaanyo
yaanyuur
yaaq
yaaqil
yaaquud
yaar¹
yaar²
yaardi
yaare
yaarid
yaasiinmaddoone
yaaw
yabaal¹
yabaal²
yabaalid
yabaaq
yabadhaalo
yabaq¹
yabaq²
yabar
yabarayn
yabaree
yabaro
yablas¹
yablas²
yablasid
yabooh¹
yabooh²
yaboohi
yaboohid
yaboohin
yaboohis
yaboohsad
yaboohsasho
yaboohsi
yaboohso
yabqid
yac¹
yac²
yacarun
yacay¹
yacay²
yacayan
yacayid
yacaynaan
yacaynaansho
yacni
yacyacood
yad¹
yad²
yadan
yadid
yagcar
yagleel¹
yagleel²
yagleelid
yah
yahaabur
yahaaburnimo
yahan
yakayn
yake
yakee
yakeysan
yakeysanaan
yakeysanaansho
yakoobid
yakow
yal
yalaalug
yalaalugo
yalaalugoo
yalaalugood
yalaalugsan
yalaalugsanaan
yalaalugsanaansho
yalalaxo
yalanyalxo
yalanyalxoo
yalanyalxood
yalax
yaleex
yamaan
yamaarug
yamays
yamxeeri
yamxeerin
yamxeero
yamyam
yaqfo
yaqiin
yaqiinsasho
yaqiinsi
yaqiinso
yaqyaqsasho
yaqyaqsi
yaqyaqsii
yaqyaqsiin
yaqyaqso
yaqyaqsoo
yaqyaqsood
yar¹
yar²
yar³
yaraan¹
yaraan²
yaraansho
yarad
yarayn¹
yarayn²
yarays
yaraysad
yaraysasho
yaraysi
yaraysii
yaraysiin
yarayso
yare
yaree
yarehe
yariis¹
yariis²
yaris
yarow
yaryarayn
yaryaraysasho
yaryaree
yaryareyso
yaryaro
yas
yasid
yasir
yasirid
yatiin
yaw
yawyab¹
yawyab²
yawyabid
yaxaas
yaxdho
yaxoob
yaxoobid
yaxuus
yaxuusoobid
yaxuusow
yaxyax¹
yaxyax²
yaxyaxi
yaxyaxid
yaxyaxin
yeber
yed¹
yed²
yedid
yeeg
yeeg-bibanji
yeeg-bibiish
yeeg-bicaddaan
yeeg-bidooh
yeeg-bijoohaar
yeeg-bisaliim
yeeg-bishiish
yeegtiis
yeeke
yeel¹
yeel²
yeel³
yeel4
yeel5
yeelaal
yeelaali
yeelaalin
yeelan
yeelasho
yeele
yeelid
yeelin
yeelnaan
yeelnaansho
yeelo
yeelsii
yeelsiin
yeelyeel
yeelyeelad
yeelyeelasho
yeelyeelid
yeelyeelo
yeer¹
yeer²
yeerasho
yeeri
yeerid
yeerin
yeeris¹
yeeris²
yeero
yeersasho
yeerso
yeey
yerid
yeris
yersin
yey
yib¹
yib²
yibal
yibid
yibir¹
yibir²
yibirnimo
yiblasho
yiblo
yicib
yicibciye
yiciis
yicis
yicisnimo
yididdiilo
yir
yirid
yix
yohoomid
yohoon¹
yohoon²
yohoonsan
yohoonsanaan
yohoonsanaansho
yoobsan
yoobsanaan
yoobsanaansho
yoobsasho
yoobso
yooco
yoofil
yookayn
yookaysan
yookaysnaan
yookaysnaansho
yookee
yooko
yool
yoolaal
yoolaalid
yoolgaar¹
yoolgaar²
yoolgaarid
yoolyool¹
yoolyool²
yoolyoolid
yoome
yoomid
yoon¹
yoon²
yoonge
yoos
yoose
yooyootamid
yooyootan¹
yooyootan²
yoxoob¹
yoxoob²
yoxoobid
yoxoobsasho
yoxoobso
yu'ad
yu'asho
yucub
yuf
yulkhad
yulqamid
yulqan¹
yulqan²
yulul
yumbad
yumbasho
yumbi
yumbin
yumbo
yu'o
yur
yurasil
yurayn
yuree
yurqudle
yuruuruc
yusur
yutucsasho
yutucso
yuub¹
yuub²
yuuban
yuubid
yuubnaan
yuubnaansho
yuuc¹
yuuc²
yuucan
yuucid
yuucnaan
yuucnaansho
yuuq
yuuqan
yuuqid
yuuqnaan
yuuqnaansho
yuur
yuuriya
yuurur¹
yuurur²
yuururid
yuxuud
