a
aa'
aa¹
Aa²
aa³
Aabayeel¹
Aabayeel²
Aabayeelid
Aabayn
Aabbannimo
Aabbayaal
Aabbe
Aabbo
aabbur¹
aabbur²
aabburan¹
aabburan²
aabburid
aabburmid
aabburnaan
aabburnaansho
Aabee
Aabeyeelid
Aabi
aabiweyrax
Aabo
Aabonimo
Aabyoo
Aabyood
Aad
Ąad¹
Ąad²
Ąad³
aadaab
aadaamid
aadaan¹
aadaan²
aadami
aadaminnimo¹
aadaminnimo²
aadane
aaddamid
aaddan¹
aaddan²
aaddan³
aaddin
aadeer
aadi
aadid
aadimo
aadin
aadiraac
aadmi
aadminnimo
aadsii
aadsiin
aadyar
aaf
aafayn
aafee
aafeysan
aafeysnaan
aafeysnaansho
aafo
aafoobid
aafow
aag
aagaan¹
aagaan²
aagga-qabow
aah
aaho
aa'id
aajur
aakhir
aakhiritaan
aakhiro
aakhirutahan
aakib
aal¹
al²
aalaa
ąalad
ąaladee
ąaladeyn
ąaladeysan
ąaladeysnaan
ąaladeysnaansho
ąalad-kabniin
aale
aalkol
aalkolo
aallid
aalo
aameel
ąamiin
ąamiinsad
ąamiinsasho
ąamiinsi
ąamiinso
ąammiin
ąammiinsad
ąammiinsasho
ąammiinso
ąammin¹
ąammin²
ąamminaad
ąamminbax
ąamminbixid
ąammindarreysad
ąammindarreysasho
ąammindarreysi
ąammindarreyso
ąammindarro
ąamminid
ąamminnimo
ąamminsan
ąamminsanaan
ąamminsanaansho
ąamminsanow
ąamminsii
ąamminsiin
aammus¹
aammus²
aammusan
aammusdaran
aammusdarnaan
aammusdarnaansho
aammusi
aammusid
aammusin
aammusis
aammusnaan
aammusnaansho
aan¹
aan²
aanayn
aanaysasho
aanaysi
aanayso
aanee
aannu
aano
aar¹
aar²
aaraa'
aarad
aaradee
aaradeyn
aaradeysan
aaradeysnaan
aaradeysnaansho
aaran
aarbax¹
aarbax²
aarbi-aar
aarbixid
aardoon
aardoonad
aardoonasho
aardoono
aargalaan
aargoonle
aargoosad
aargoosasho
aargoosi
aargooso
aargud
aargudasho
aargudis
aarid
aaris
aarnimo
aarsashaddoon
aarsasho
aarsi
aarso
aas¹
aas²
aasaas¹
aasaasan¹
aasaasan²
aasaasi
aasaasid
aasaasmid
aasaasnaan
aasaasnaansho
aasan¹
aasan²
aashuun
aasid
aasmid
aasnaan
aasnaansho
aasnow
aaway
aawaye
aawi
aawil¹
aawil²
aawilid
aawin
aawis
aawo
aayad
aayakatalin
aayakatashi
aayar
aayatiin
aayaxumaan
aayaxumaansho
aayaxumaansho
aayaxumi
aayaxumo
aayaxun
aaye
aayid
aayis
aayo¹
aayo²
aayodhiin
aayon
aayoonayn
ab¹
ab²
abaab¹
abaab²
abaabi
abaabid
abaabin
abaabis
abaabul¹
abaabul²
abaabulan
abaabulay
abaabule
abaabulid
abaabulnaan
abaabulnaansho
abaad¹
abaad²
abaadi
abaadid
abaadin
abaadsii
abaadsiin
abaahi¹
abaahi²
abaahin
abaahis
abaahiyid
abaaji¹
abaaji²
abaajiyid
abaal
abaalceli
abaalcelin
abaalcelis
abaaldaran
abaaldarnaan
abaaldarnaansho
abaaldarro
abaaldhac¹
abaaldhac²
abaaldhicid
abaaldooris
abaalgud¹
abaalmarin.
abaalgud²
abaalgudid
abaalhay
abaalhayn
abaali
abaalmari
abaalmarin
abaalmaris
abaar
abaarayn
abaaraysad
abaaraysan
abaaraysasho
abaaraysi
abaaraysii
abaaraysiin
abaaraysnaan
abaaraysnaansho
abaarayso
abaaree
abaareysad
abaarikeentay
abaaroobid
abaarow
abaarsad
abaarsasho
abaarso
abaaseere
booranaha
abab¹
abab²
ababi
ababid
ababin
ababis
abad
abadan
abaddar
abaddarnimo
abakaar
abakaarnimo
abaqaal¹
abaqaal²
abaqaalid
abasax¹
abasax²
abasaxan
abasaxi
abasaxnaan
abasaxnaansho
abasaxsan
abasaxsanaan
abasaxsanaansho
abashuqle
abashuqlee
abashuqleyn
abasixid
abataqan
abaydimi
abaydimin
abaydin
abbaan
abbaanduul
abbaanduule
abbaannimo
abbaansasho
abbaansi
abbaanso
abbaanwarre
abbaar¹
abbaar²
abbaar³
abbaaran¹
abbaaran²
abbaare
abbaarid
abbaarmid
abbaarnaan
abbaarnaansho
abbaarqaadasho
abbaarqaado
abbaarsii
abbaarsiin
abbaato
abbaay
abbaay
abbaaye
abbaayguddoy
abbaayo
abbaseere
abboow
abboowe
abbuul
abdo
abeer
abeesabbadeed
abeesajilfaaley
abeesalugaley
abeesaxambaar
abeeso
abeesojufaaley
abeesow
abguri
abhi
abhin
abhis
abid
abiid
abitey
abjac
abjacnimo
abjad
abjed
abkow
abkownimo
abla'ablayn
ablaawe
abley
abnaq¹
abnaq²
abnaq³
abnaqid
ab'ogaa
aboobid
aboodi
aboor¹
aboor²
aboornimo
abootannimo
abooto
abooto-idabbadis
ab'orijinis
abqaad
abqo
abraar¹
abraar²
abraarid
abraarsii
abraarsiin
abraarsiis
abriil
abriile
abris
absaxan
abshir
absiisa
abti
abtibadbaadeed
abtinnimo
abtiri
abtirin
abtiris
abtirsad
abtirsasho
abtirsi
abtirsiimo
abtirsiino
abtirsiinyo
abtirso
abtisarow
abtiyoobid
abtiyow¹
abtiyow²
abur
aburi
aburin
aburshuqlayn
aburshuqle
aburshuqlee
abuuddocan
abuuddoocan
abuudiiq
abuullan
abuumaqas
abuur¹
abuur²
abuur³
abuuran¹
abuuran²
abuurcas
abuure
abuurid
abuuris
abuuritaan
abuurmid
abuurnaan
abuurnaansho
abuutufaax
abwaan
abwaanad
abwaannimo
abxad
abyamid
abyan¹
abyan²
abyanaha-logaridam
abyane-huban
abyin
abyineed-aan-hubnayn
abyineed-huban
abyin-jeexeed
abyood
abyoone
acuudu-billaahi
acuudu-billaysad
acuudu-billaysasho
acuudu-billeysi
acuudu-billeyso
acyuun
adaa
adaadax¹
adaadax²
adaadi
adaadixid
adaadumasho
adaadumid
adaadumo
adaadun¹
adaadun²
adaahi
adaan
adaarbiciid
adab¹
adab²
adable
adaddaah¹
adaddaah²
adaddaahid
adag
adamaddoon
adame
adami
adamiyeysasho
adamiyeysi
adamiyeyso
adan
adar
adarbiciid
adayg
addeec¹
addeec²
addeecid
addeecis
addeecsan
addeecsanaan
addeecsanaansho
addimaad
addimid
addin¹
addin²
addin³
addinmaal
addoomoobid
addoomow
addoon¹
addoon²
addoonnimo
addoonsad
addoonsasho
addoonsi
addoonso
adduun
adduunweyne
adduunyo
adeeg¹
adeeg²
adeegasho
adeege
adeegid
adeego
adeegsad
adeegsi
adeegto
adeer
adeernimo
adeeryo
adhaxle
adi
adiga
adinayn
adiyo
adkaan
adkaansho
adkayn
adkaysad
adkaysan¹
adkaysan²
adkaysasho
adkaysi¹
adkaysi²
adkaysiinyo
adkaysin
adkayso
adke
adkee
adkow
adna
adoo
adooga
adse
aduu
adwaar
adyadee
adyadeynaf¹
af¹
af²
afaaf
afacaayil
afaggaal
afar
afaraad
afardhegood
afaree
afareyn
afareys
afareysad
afareysasho
afareysi
afareyso
afarfaallow
afarfoolle
afargees
afariyotobnaad
afar-jiho
afar-madaxle
afarqaad¹
afarqaad²
afarqaadid
afarqaadis
afarqaadlays
afarqaadle
afarqaadleyn
afarran¹
afarran²
afarranaan
afarranaansho
afarrey
afarsuulle
afartamaad
afartambax¹
afartambax²
afartambixi
afartambixid
afartambixin
afartameeye
afartameeyo
afartan
afartanaad
afartanbax¹
afartanbax²
afartanbixi
afartanbixid
afartanbixin
afartaneeye
afayn
afays
afaysan¹
afaysan²
afaysasho
afaysmid
afaysnaan
afaysnaansho
afayso
afbadan
afbadnaan
afbadnaansho
afbar
afbarad
afbarasho
afbarid
afbaro
afbax¹
afbax²
afbeel¹
afbeel²
afbeelid
afbilaabasho
afbilaabo
afbilaw
afbixid
afbuur¹
afbuur²
afbuurid
afcaal
afcaan
afcadde
afceli
afcelin
afcelis
afceliso
afceliye
afcuug
afdabayl
afdaran
afdarnaan
afdarnaansho
afdarraan
afdarraansho
afdarro
afdhaaf
afdhaafid
afdhabaandhab¹
afdhabaandhab²
afdhabaandhabid
afdhabaandhaw
afdhalow
afdheere
afdhuub
afdhuubyaalayn
afdhuubyaale
afdhuubyaalee
afdoolin
afduub¹
afduub²
afduuban
afduube
afduubid
afduubnaan
afduubnaansho
afee
afeef
afeefad
afeefasho
afeefo
afeeftamid
afeeftan
affur¹
affur²
affuran
affuri
affurid
affurin
affurnaan
affurnaansho
affursii
affursiin
afgaab
afgammuur¹
afgammuur²
afgammuuran¹
afgammuuran²
afgammuurid
afgammuurmid
afgammuurnaan
afgammuurnaansho
afgammuux¹
afgammuuxan¹
afgammuuxan²
afgammuuxmid
afgammuuxnaan
afgamuuran¹
afgamuuran²
afgamuurmid
afgamuurnaansho
afgamuuxan¹
afgamuuxan²
afgamuuxmid
afgamuuxnaan
afgamuuxnaansho
afgarad
afgarasho
afgaro
afgarooc
afgaroocnimo
afgembi¹
afgembi²
afgembin
afgembiyid
afgobaadsad
